/* automatically generated by rust-bindgen 0.69.4 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {

pub const MOVE_BLOOM_DOOM: u32 = 859;
pub const MOVE_GIGAVOLT_HAVOC: u32 = 860;
pub const MOVE_SHATTERED_PSYCHE: u32 = 861;
pub const MOVE_SUBZERO_SLAMMER: u32 = 862;
pub const MOVE_DEVASTATING_DRAKE: u32 = 863;
pub const MOVE_BLACK_HOLE_ECLIPSE: u32 = 864;
pub const MOVE_TWINKLE_TACKLE: u32 = 865;
pub const MOVE_CATASTROPIKA: u32 = 866;
pub const MOVE_10000000_VOLT_THUNDERBOLT: u32 = 867;
pub const MOVE_STOKED_SPARKSURFER: u32 = 868;
pub const MOVE_EXTREME_EVOBOOST: u32 = 869;
pub const MOVE_PULVERIZING_PANCAKE: u32 = 870;
pub const MOVE_GENESIS_SUPERNOVA: u32 = 871;
pub const MOVE_SINISTER_ARROW_RAID: u32 = 872;
pub const MOVE_MALICIOUS_MOONSAULT: u32 = 873;
pub const MOVE_OCEANIC_OPERETTA: u32 = 874;
pub const MOVE_SPLINTERED_STORMSHARDS: u32 = 875;
pub const MOVE_LETS_SNUGGLE_FOREVER: u32 = 876;
pub const MOVE_CLANGOROUS_SOULBLAZE: u32 = 877;
pub const MOVE_GUARDIAN_OF_ALOLA: u32 = 878;
pub const MOVE_SEARING_SUNRAZE_SMASH: u32 = 879;
pub const MOVE_MENACING_MOONRAZE_MAELSTROM: u32 = 880;
pub const MOVE_LIGHT_THAT_BURNS_THE_SKY: u32 = 881;
pub const MOVE_SOUL_STEALING_7_STAR_STRIKE: u32 = 882;
pub const FIRST_Z_MOVE: u32 = 848;
pub const LAST_Z_MOVE: u32 = 882;
pub const MOVES_COUNT_Z: u32 = 883;
pub const FIRST_MAX_MOVE: u32 = 883;
pub const MOVE_UNAVAILABLE: u32 = 65535;
pub type va_list = *mut ::std::os::raw::c_char;
extern "C" {
    pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
extern "C" {
    pub fn __security_init_cookie();
}
extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize) -> !;
}
extern "C" {
    pub static mut __security_cookie: usize;
}
pub type __crt_bool = bool;
extern "C" {
    pub fn _invalid_parameter_noinfo();
}
extern "C" {
    pub fn _invalid_parameter_noinfo_noreturn() -> !;
}
extern "C" {
    pub fn _invoke_watson(
        _Expression: *const wchar_t,
        _FunctionName: *const wchar_t,
        _FileName: *const wchar_t,
        _LineNo: ::std::os::raw::c_uint,
        _Reserved: usize,
    ) -> !;
}
pub type errno_t = ::std::os::raw::c_int;
pub type wint_t = ::std::os::raw::c_ushort;
pub type wctype_t = ::std::os::raw::c_ushort;
pub type __time32_t = ::std::os::raw::c_long;
pub type __time64_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data_public {
    pub _locale_pctype: *const ::std::os::raw::c_ushort,
    pub _locale_mb_cur_max: ::std::os::raw::c_int,
    pub _locale_lc_codepage: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___crt_locale_data_public() {
    const UNINIT: ::std::mem::MaybeUninit<__crt_locale_data_public> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__crt_locale_data_public>(),
        16usize,
        concat!("Size of: ", stringify!(__crt_locale_data_public))
    );
    assert_eq!(
        ::std::mem::align_of::<__crt_locale_data_public>(),
        8usize,
        concat!("Alignment of ", stringify!(__crt_locale_data_public))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_pctype) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_pctype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_mb_cur_max) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_mb_cur_max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_lc_codepage) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_lc_codepage)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_pointers {
    pub locinfo: *mut __crt_locale_data,
    pub mbcinfo: *mut __crt_multibyte_data,
}
#[test]
fn bindgen_test_layout___crt_locale_pointers() {
    const UNINIT: ::std::mem::MaybeUninit<__crt_locale_pointers> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__crt_locale_pointers>(),
        16usize,
        concat!("Size of: ", stringify!(__crt_locale_pointers))
    );
    assert_eq!(
        ::std::mem::align_of::<__crt_locale_pointers>(),
        8usize,
        concat!("Alignment of ", stringify!(__crt_locale_pointers))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).locinfo) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_pointers),
            "::",
            stringify!(locinfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mbcinfo) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_pointers),
            "::",
            stringify!(mbcinfo)
        )
    );
}
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Mbstatet {
    pub _Wchar: ::std::os::raw::c_ulong,
    pub _Byte: ::std::os::raw::c_ushort,
    pub _State: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout__Mbstatet() {
    const UNINIT: ::std::mem::MaybeUninit<_Mbstatet> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_Mbstatet>(),
        8usize,
        concat!("Size of: ", stringify!(_Mbstatet))
    );
    assert_eq!(
        ::std::mem::align_of::<_Mbstatet>(),
        4usize,
        concat!("Alignment of ", stringify!(_Mbstatet))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._Wchar) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_Wchar)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._Byte) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_Byte)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._State) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_State)
        )
    );
}
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = usize;
extern "C" {
    pub fn _errno() -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn _set_errno(_Value: ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
    pub fn _get_errno(_Value: *mut ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
    pub fn __doserrno() -> *mut ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn _set_doserrno(_Value: ::std::os::raw::c_ulong) -> errno_t;
}
extern "C" {
    pub fn _get_doserrno(_Value: *mut ::std::os::raw::c_ulong) -> errno_t;
}
extern "C" {
    pub fn memchr(
        _Buf: *const ::std::os::raw::c_void,
        _Val: ::std::os::raw::c_int,
        _MaxCount: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcmp(
        _Buf1: *const ::std::os::raw::c_void,
        _Buf2: *const ::std::os::raw::c_void,
        _Size: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memcpy(
        _Dst: *mut ::std::os::raw::c_void,
        _Src: *const ::std::os::raw::c_void,
        _Size: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memmove(
        _Dst: *mut ::std::os::raw::c_void,
        _Src: *const ::std::os::raw::c_void,
        _Size: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset(
        _Dst: *mut ::std::os::raw::c_void,
        _Val: ::std::os::raw::c_int,
        _Size: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strchr(
        _Str: *const ::std::os::raw::c_char,
        _Val: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrchr(
        _Str: *const ::std::os::raw::c_char,
        _Ch: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strstr(
        _Str: *const ::std::os::raw::c_char,
        _SubStr: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn wcschr(
        _Str: *const ::std::os::raw::c_ushort,
        _Ch: ::std::os::raw::c_ushort,
    ) -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn wcsrchr(_Str: *const wchar_t, _Ch: wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsstr(_Str: *const wchar_t, _SubStr: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _memicmp(
        _Buf1: *const ::std::os::raw::c_void,
        _Buf2: *const ::std::os::raw::c_void,
        _Size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _memicmp_l(
        _Buf1: *const ::std::os::raw::c_void,
        _Buf2: *const ::std::os::raw::c_void,
        _Size: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memccpy(
        _Dst: *mut ::std::os::raw::c_void,
        _Src: *const ::std::os::raw::c_void,
        _Val: ::std::os::raw::c_int,
        _Size: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memicmp(
        _Buf1: *const ::std::os::raw::c_void,
        _Buf2: *const ::std::os::raw::c_void,
        _Size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcscat_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcscpy_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcsncat_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcsncpy_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcstok_s(
        _String: *mut wchar_t,
        _Delimiter: *const wchar_t,
        _Context: *mut *mut wchar_t,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcsdup(_String: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcscat(_Destination: *mut wchar_t, _Source: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcscmp(
        _String1: *const ::std::os::raw::c_ushort,
        _String2: *const ::std::os::raw::c_ushort,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcscpy(_Destination: *mut wchar_t, _Source: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcscspn(_String: *const wchar_t, _Control: *const wchar_t) -> usize;
}
extern "C" {
    pub fn wcslen(_String: *const ::std::os::raw::c_ushort) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn wcsnlen(_Source: *const wchar_t, _MaxCount: usize) -> usize;
}
extern "C" {
    pub fn wcsncat(
        _Destination: *mut wchar_t,
        _Source: *const wchar_t,
        _Count: usize,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsncmp(
        _String1: *const ::std::os::raw::c_ushort,
        _String2: *const ::std::os::raw::c_ushort,
        _MaxCount: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcsncpy(
        _Destination: *mut wchar_t,
        _Source: *const wchar_t,
        _Count: usize,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn wcspbrk(_String: *const wchar_t, _Control: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsspn(_String: *const wchar_t, _Control: *const wchar_t) -> usize;
}
extern "C" {
    pub fn wcstok(
        _String: *mut wchar_t,
        _Delimiter: *const wchar_t,
        _Context: *mut *mut wchar_t,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcserror(_ErrorNumber: ::std::os::raw::c_int) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcserror_s(
        _Buffer: *mut wchar_t,
        _SizeInWords: usize,
        _ErrorNumber: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn __wcserror(_String: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn __wcserror_s(
        _Buffer: *mut wchar_t,
        _SizeInWords: usize,
        _ErrorMessage: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _wcsicmp(_String1: *const wchar_t, _String2: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsicmp_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsnicmp(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsnicmp_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsnset_s(
        _Destination: *mut wchar_t,
        _SizeInWords: usize,
        _Value: wchar_t,
        _MaxCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn _wcsnset(_String: *mut wchar_t, _Value: wchar_t, _MaxCount: usize) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcsrev(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcsset_s(_Destination: *mut wchar_t, _SizeInWords: usize, _Value: wchar_t) -> errno_t;
}
extern "C" {
    pub fn _wcsset(_String: *mut wchar_t, _Value: wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcslwr_s(_String: *mut wchar_t, _SizeInWords: usize) -> errno_t;
}
extern "C" {
    pub fn _wcslwr(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcslwr_s_l(_String: *mut wchar_t, _SizeInWords: usize, _Locale: _locale_t) -> errno_t;
}
extern "C" {
    pub fn _wcslwr_l(_String: *mut wchar_t, _Locale: _locale_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcsupr_s(_String: *mut wchar_t, _Size: usize) -> errno_t;
}
extern "C" {
    pub fn _wcsupr(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcsupr_s_l(_String: *mut wchar_t, _Size: usize, _Locale: _locale_t) -> errno_t;
}
extern "C" {
    pub fn _wcsupr_l(_String: *mut wchar_t, _Locale: _locale_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsxfrm(_Destination: *mut wchar_t, _Source: *const wchar_t, _MaxCount: usize) -> usize;
}
extern "C" {
    pub fn _wcsxfrm_l(
        _Destination: *mut wchar_t,
        _Source: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> usize;
}
extern "C" {
    pub fn wcscoll(_String1: *const wchar_t, _String2: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcscoll_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsicoll(_String1: *const wchar_t, _String2: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsicoll_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsncoll(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsncoll_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsnicoll(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsnicoll_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcsdup(_String: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsicmp(_String1: *const wchar_t, _String2: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcsnicmp(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcsnset(_String: *mut wchar_t, _Value: wchar_t, _MaxCount: usize) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsrev(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsset(_String: *mut wchar_t, _Value: wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcslwr(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsupr(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsicoll(_String1: *const wchar_t, _String2: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcpy_s(
        _Destination: *mut ::std::os::raw::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn strcat_s(
        _Destination: *mut ::std::os::raw::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn strerror_s(
        _Buffer: *mut ::std::os::raw::c_char,
        _SizeInBytes: usize,
        _ErrorNumber: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn strncat_s(
        _Destination: *mut ::std::os::raw::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const ::std::os::raw::c_char,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
extern "C" {
    pub fn strncpy_s(
        _Destination: *mut ::std::os::raw::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const ::std::os::raw::c_char,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
extern "C" {
    pub fn strtok_s(
        _String: *mut ::std::os::raw::c_char,
        _Delimiter: *const ::std::os::raw::c_char,
        _Context: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _memccpy(
        _Dst: *mut ::std::os::raw::c_void,
        _Src: *const ::std::os::raw::c_void,
        _Val: ::std::os::raw::c_int,
        _MaxCount: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strcat(
        _Destination: *mut ::std::os::raw::c_char,
        _Source: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmp(
        _Str1: *const ::std::os::raw::c_char,
        _Str2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _strcmpi(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcoll(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _strcoll_l(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcpy(
        _Destination: *mut ::std::os::raw::c_char,
        _Source: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcspn(
        _Str: *const ::std::os::raw::c_char,
        _Control: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _strdup(_Source: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _strerror(_ErrorMessage: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _strerror_s(
        _Buffer: *mut ::std::os::raw::c_char,
        _SizeInBytes: usize,
        _ErrorMessage: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn strerror(_ErrorMessage: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _stricmp(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _stricoll(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _stricoll_l(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _stricmp_l(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strlen(_Str: *const ::std::os::raw::c_char) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _strlwr_s(_String: *mut ::std::os::raw::c_char, _Size: usize) -> errno_t;
}
extern "C" {
    pub fn _strlwr(_String: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _strlwr_s_l(
        _String: *mut ::std::os::raw::c_char,
        _Size: usize,
        _Locale: _locale_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _strlwr_l(
        _String: *mut ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncat(
        _Destination: *mut ::std::os::raw::c_char,
        _Source: *const ::std::os::raw::c_char,
        _Count: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncmp(
        _Str1: *const ::std::os::raw::c_char,
        _Str2: *const ::std::os::raw::c_char,
        _MaxCount: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _strnicmp(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _strnicmp_l(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _strnicoll(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _strnicoll_l(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _strncoll(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _strncoll_l(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __strncnt(_String: *const ::std::os::raw::c_char, _Count: usize) -> usize;
}
extern "C" {
    pub fn strncpy(
        _Destination: *mut ::std::os::raw::c_char,
        _Source: *const ::std::os::raw::c_char,
        _Count: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strnlen(_String: *const ::std::os::raw::c_char, _MaxCount: usize) -> usize;
}
extern "C" {
    pub fn _strnset_s(
        _String: *mut ::std::os::raw::c_char,
        _SizeInBytes: usize,
        _Value: ::std::os::raw::c_int,
        _MaxCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn _strnset(
        _Destination: *mut ::std::os::raw::c_char,
        _Value: ::std::os::raw::c_int,
        _Count: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strpbrk(
        _Str: *const ::std::os::raw::c_char,
        _Control: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _strrev(_Str: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _strset_s(
        _Destination: *mut ::std::os::raw::c_char,
        _DestinationSize: usize,
        _Value: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _strset(
        _Destination: *mut ::std::os::raw::c_char,
        _Value: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strspn(
        _Str: *const ::std::os::raw::c_char,
        _Control: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtok(
        _String: *mut ::std::os::raw::c_char,
        _Delimiter: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _strupr_s(_String: *mut ::std::os::raw::c_char, _Size: usize) -> errno_t;
}
extern "C" {
    pub fn _strupr(_String: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _strupr_s_l(
        _String: *mut ::std::os::raw::c_char,
        _Size: usize,
        _Locale: _locale_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _strupr_l(
        _String: *mut ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strxfrm(
        _Destination: *mut ::std::os::raw::c_char,
        _Source: *const ::std::os::raw::c_char,
        _MaxCount: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _strxfrm_l(
        _Destination: *mut ::std::os::raw::c_char,
        _Source: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> usize;
}
extern "C" {
    pub fn strdup(_String: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmpi(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn stricmp(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strlwr(_String: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strnicmp(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strnset(
        _String: *mut ::std::os::raw::c_char,
        _Value: ::std::os::raw::c_int,
        _MaxCount: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrev(_String: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strset(
        _String: *mut ::std::os::raw::c_char,
        _Value: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strupr(_String: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
pub type max_align_t = f64;
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
pub type u8_ = u8;
pub type u16_ = u16;
pub type u32_ = u32;
pub type u64_ = u64;
pub type s8 = i8;
pub type s16 = i16;
pub type s32 = i32;
pub type s64 = i64;
pub type vu8 = u8_;
pub type vu16 = u16_;
pub type vu32 = u32_;
pub type vu64 = u64_;
pub type vs8 = s8;
pub type vs16 = s16;
pub type vs32 = s32;
pub type vs64 = s64;
pub type f32_ = f32;
pub type f64_ = f64;
pub type bool8 = u8_;
pub type bool16 = u16_;
pub type bool32 = u32_;
pub type vbool8 = vu8;
pub type vbool16 = vu16;
pub type vbool32 = vu32;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct BgCnt {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[test]
fn bindgen_test_layout_BgCnt() {
    assert_eq!(
        ::std::mem::size_of::<BgCnt>(),
        2usize,
        concat!("Size of: ", stringify!(BgCnt))
    );
    assert_eq!(
        ::std::mem::align_of::<BgCnt>(),
        1usize,
        concat!("Alignment of ", stringify!(BgCnt))
    );
}
impl BgCnt {
    #[inline]
    pub fn priority(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_priority(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn charBaseBlock(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_charBaseBlock(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn dsCharBaseBlock(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_dsCharBaseBlock(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn mosaic(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_mosaic(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn palettes(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_palettes(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn screenBaseBlock(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 5u8) as u16) }
    }
    #[inline]
    pub fn set_screenBaseBlock(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn areaOverflowMode(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_areaOverflowMode(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn screenSize(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_screenSize(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        priority: u16_,
        charBaseBlock: u16_,
        dsCharBaseBlock: u16_,
        mosaic: u16_,
        palettes: u16_,
        screenBaseBlock: u16_,
        areaOverflowMode: u16_,
        screenSize: u16_,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let priority: u16 = unsafe { ::std::mem::transmute(priority) };
            priority as u64
        });
        __bindgen_bitfield_unit.set(2usize, 2u8, {
            let charBaseBlock: u16 = unsafe { ::std::mem::transmute(charBaseBlock) };
            charBaseBlock as u64
        });
        __bindgen_bitfield_unit.set(4usize, 2u8, {
            let dsCharBaseBlock: u16 = unsafe { ::std::mem::transmute(dsCharBaseBlock) };
            dsCharBaseBlock as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let mosaic: u16 = unsafe { ::std::mem::transmute(mosaic) };
            mosaic as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let palettes: u16 = unsafe { ::std::mem::transmute(palettes) };
            palettes as u64
        });
        __bindgen_bitfield_unit.set(8usize, 5u8, {
            let screenBaseBlock: u16 = unsafe { ::std::mem::transmute(screenBaseBlock) };
            screenBaseBlock as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let areaOverflowMode: u16 = unsafe { ::std::mem::transmute(areaOverflowMode) };
            areaOverflowMode as u64
        });
        __bindgen_bitfield_unit.set(14usize, 2u8, {
            let screenSize: u16 = unsafe { ::std::mem::transmute(screenSize) };
            screenSize as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type vBgCnt = BgCnt;
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct PlttData {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[test]
fn bindgen_test_layout_PlttData() {
    assert_eq!(
        ::std::mem::size_of::<PlttData>(),
        2usize,
        concat!("Size of: ", stringify!(PlttData))
    );
    assert_eq!(
        ::std::mem::align_of::<PlttData>(),
        2usize,
        concat!("Alignment of ", stringify!(PlttData))
    );
}
impl PlttData {
    #[inline]
    pub fn r(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 5u8) as u16) }
    }
    #[inline]
    pub fn set_r(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn g(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 5u8) as u16) }
    }
    #[inline]
    pub fn set_g(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn b(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 5u8) as u16) }
    }
    #[inline]
    pub fn set_b(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn unused_15(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_unused_15(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        r: u16_,
        g: u16_,
        b: u16_,
        unused_15: u16_,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 5u8, {
            let r: u16 = unsafe { ::std::mem::transmute(r) };
            r as u64
        });
        __bindgen_bitfield_unit.set(5usize, 5u8, {
            let g: u16 = unsafe { ::std::mem::transmute(g) };
            g as u64
        });
        __bindgen_bitfield_unit.set(10usize, 5u8, {
            let b: u16 = unsafe { ::std::mem::transmute(b) };
            b as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let unused_15: u16 = unsafe { ::std::mem::transmute(unused_15) };
            unused_15 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct OamData {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 6usize]>,
    pub affineParam: u16_,
}
#[test]
fn bindgen_test_layout_OamData() {
    const UNINIT: ::std::mem::MaybeUninit<OamData> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<OamData>(),
        8usize,
        concat!("Size of: ", stringify!(OamData))
    );
    assert_eq!(
        ::std::mem::align_of::<OamData>(),
        4usize,
        concat!("Alignment of ", stringify!(OamData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).affineParam) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(OamData),
            "::",
            stringify!(affineParam)
        )
    );
}
impl OamData {
    #[inline]
    pub fn y(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_y(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn affineMode(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_affineMode(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn objMode(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_objMode(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn mosaic(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_mosaic(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bpp(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bpp(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn shape(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_shape(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn x(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 9u8) as u32) }
    }
    #[inline]
    pub fn set_x(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub fn matrixNum(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(25usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_matrixNum(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(25usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn size(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(30usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_size(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(30usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn tileNum(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 10u8) as u16) }
    }
    #[inline]
    pub fn set_tileNum(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 10u8, val as u64)
        }
    }
    #[inline]
    pub fn priority(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(42usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_priority(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(42usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn paletteNum(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(44usize, 4u8) as u16) }
    }
    #[inline]
    pub fn set_paletteNum(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(44usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        y: u32_,
        affineMode: u32_,
        objMode: u32_,
        mosaic: u32_,
        bpp: u32_,
        shape: u32_,
        x: u32_,
        matrixNum: u32_,
        size: u32_,
        tileNum: u16_,
        priority: u16_,
        paletteNum: u16_,
    ) -> __BindgenBitfieldUnit<[u8; 6usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 6usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let y: u32 = unsafe { ::std::mem::transmute(y) };
            y as u64
        });
        __bindgen_bitfield_unit.set(8usize, 2u8, {
            let affineMode: u32 = unsafe { ::std::mem::transmute(affineMode) };
            affineMode as u64
        });
        __bindgen_bitfield_unit.set(10usize, 2u8, {
            let objMode: u32 = unsafe { ::std::mem::transmute(objMode) };
            objMode as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let mosaic: u32 = unsafe { ::std::mem::transmute(mosaic) };
            mosaic as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let bpp: u32 = unsafe { ::std::mem::transmute(bpp) };
            bpp as u64
        });
        __bindgen_bitfield_unit.set(14usize, 2u8, {
            let shape: u32 = unsafe { ::std::mem::transmute(shape) };
            shape as u64
        });
        __bindgen_bitfield_unit.set(16usize, 9u8, {
            let x: u32 = unsafe { ::std::mem::transmute(x) };
            x as u64
        });
        __bindgen_bitfield_unit.set(25usize, 5u8, {
            let matrixNum: u32 = unsafe { ::std::mem::transmute(matrixNum) };
            matrixNum as u64
        });
        __bindgen_bitfield_unit.set(30usize, 2u8, {
            let size: u32 = unsafe { ::std::mem::transmute(size) };
            size as u64
        });
        __bindgen_bitfield_unit.set(32usize, 10u8, {
            let tileNum: u16 = unsafe { ::std::mem::transmute(tileNum) };
            tileNum as u64
        });
        __bindgen_bitfield_unit.set(42usize, 2u8, {
            let priority: u16 = unsafe { ::std::mem::transmute(priority) };
            priority as u64
        });
        __bindgen_bitfield_unit.set(44usize, 4u8, {
            let paletteNum: u16 = unsafe { ::std::mem::transmute(paletteNum) };
            paletteNum as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BgAffineSrcData {
    pub texX: s32,
    pub texY: s32,
    pub scrX: s16,
    pub scrY: s16,
    pub sx: s16,
    pub sy: s16,
    pub alpha: u16_,
}
#[test]
fn bindgen_test_layout_BgAffineSrcData() {
    const UNINIT: ::std::mem::MaybeUninit<BgAffineSrcData> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BgAffineSrcData>(),
        20usize,
        concat!("Size of: ", stringify!(BgAffineSrcData))
    );
    assert_eq!(
        ::std::mem::align_of::<BgAffineSrcData>(),
        4usize,
        concat!("Alignment of ", stringify!(BgAffineSrcData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).texX) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BgAffineSrcData),
            "::",
            stringify!(texX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).texY) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BgAffineSrcData),
            "::",
            stringify!(texY)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scrX) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BgAffineSrcData),
            "::",
            stringify!(scrX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scrY) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(BgAffineSrcData),
            "::",
            stringify!(scrY)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sx) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BgAffineSrcData),
            "::",
            stringify!(sx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sy) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(BgAffineSrcData),
            "::",
            stringify!(sy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alpha) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BgAffineSrcData),
            "::",
            stringify!(alpha)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BgAffineDstData {
    pub pa: s16,
    pub pb: s16,
    pub pc: s16,
    pub pd: s16,
    pub dx: s32,
    pub dy: s32,
}
#[test]
fn bindgen_test_layout_BgAffineDstData() {
    const UNINIT: ::std::mem::MaybeUninit<BgAffineDstData> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BgAffineDstData>(),
        16usize,
        concat!("Size of: ", stringify!(BgAffineDstData))
    );
    assert_eq!(
        ::std::mem::align_of::<BgAffineDstData>(),
        4usize,
        concat!("Alignment of ", stringify!(BgAffineDstData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pa) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BgAffineDstData),
            "::",
            stringify!(pa)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pb) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(BgAffineDstData),
            "::",
            stringify!(pb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pc) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BgAffineDstData),
            "::",
            stringify!(pc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pd) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(BgAffineDstData),
            "::",
            stringify!(pd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dx) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BgAffineDstData),
            "::",
            stringify!(dx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dy) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BgAffineDstData),
            "::",
            stringify!(dy)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ObjAffineSrcData {
    pub xScale: s16,
    pub yScale: s16,
    pub rotation: u16_,
}
#[test]
fn bindgen_test_layout_ObjAffineSrcData() {
    const UNINIT: ::std::mem::MaybeUninit<ObjAffineSrcData> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ObjAffineSrcData>(),
        6usize,
        concat!("Size of: ", stringify!(ObjAffineSrcData))
    );
    assert_eq!(
        ::std::mem::align_of::<ObjAffineSrcData>(),
        2usize,
        concat!("Alignment of ", stringify!(ObjAffineSrcData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xScale) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjAffineSrcData),
            "::",
            stringify!(xScale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).yScale) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjAffineSrcData),
            "::",
            stringify!(yScale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rotation) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjAffineSrcData),
            "::",
            stringify!(rotation)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SioMultiCnt {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub data: u16_,
}
#[test]
fn bindgen_test_layout_SioMultiCnt() {
    const UNINIT: ::std::mem::MaybeUninit<SioMultiCnt> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SioMultiCnt>(),
        4usize,
        concat!("Size of: ", stringify!(SioMultiCnt))
    );
    assert_eq!(
        ::std::mem::align_of::<SioMultiCnt>(),
        2usize,
        concat!("Alignment of ", stringify!(SioMultiCnt))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(SioMultiCnt),
            "::",
            stringify!(data)
        )
    );
}
impl SioMultiCnt {
    #[inline]
    pub fn baudRate(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_baudRate(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn si(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_si(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn sd(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_sd(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn id(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_id(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn error(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_error(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enable(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_enable(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn unused_11_8(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 4u8) as u16) }
    }
    #[inline]
    pub fn set_unused_11_8(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn mode(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_mode(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn intrEnable(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_intrEnable(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn unused_15(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_unused_15(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        baudRate: u16_,
        si: u16_,
        sd: u16_,
        id: u16_,
        error: u16_,
        enable: u16_,
        unused_11_8: u16_,
        mode: u16_,
        intrEnable: u16_,
        unused_15: u16_,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let baudRate: u16 = unsafe { ::std::mem::transmute(baudRate) };
            baudRate as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let si: u16 = unsafe { ::std::mem::transmute(si) };
            si as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let sd: u16 = unsafe { ::std::mem::transmute(sd) };
            sd as u64
        });
        __bindgen_bitfield_unit.set(4usize, 2u8, {
            let id: u16 = unsafe { ::std::mem::transmute(id) };
            id as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let error: u16 = unsafe { ::std::mem::transmute(error) };
            error as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let enable: u16 = unsafe { ::std::mem::transmute(enable) };
            enable as u64
        });
        __bindgen_bitfield_unit.set(8usize, 4u8, {
            let unused_11_8: u16 = unsafe { ::std::mem::transmute(unused_11_8) };
            unused_11_8 as u64
        });
        __bindgen_bitfield_unit.set(12usize, 2u8, {
            let mode: u16 = unsafe { ::std::mem::transmute(mode) };
            mode as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let intrEnable: u16 = unsafe { ::std::mem::transmute(intrEnable) };
            intrEnable as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let unused_15: u16 = unsafe { ::std::mem::transmute(unused_15) };
            unused_15 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MultiBootParam {
    pub system_work: [u32_; 5usize],
    pub handshake_data: u8_,
    pub handshake_timeout: u16_,
    pub probe_count: u8_,
    pub client_data: [u8_; 3usize],
    pub palette_data: u8_,
    pub response_bit: u8_,
    pub client_bit: u8_,
    pub reserved1: u8_,
    pub boot_srcp: *const u8_,
    pub boot_endp: *const u8_,
    pub masterp: *const u8_,
    pub reserved2: [*mut u8_; 3usize],
    pub system_work2: [u32_; 4usize],
    pub sendflag: u8_,
    pub probe_target_bit: u8_,
    pub check_wait: u8_,
    pub server_type: u8_,
}
#[test]
fn bindgen_test_layout_MultiBootParam() {
    const UNINIT: ::std::mem::MaybeUninit<MultiBootParam> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<MultiBootParam>(),
        104usize,
        concat!("Size of: ", stringify!(MultiBootParam))
    );
    assert_eq!(
        ::std::mem::align_of::<MultiBootParam>(),
        8usize,
        concat!("Alignment of ", stringify!(MultiBootParam))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).system_work) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MultiBootParam),
            "::",
            stringify!(system_work)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handshake_data) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(MultiBootParam),
            "::",
            stringify!(handshake_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handshake_timeout) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(MultiBootParam),
            "::",
            stringify!(handshake_timeout)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).probe_count) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MultiBootParam),
            "::",
            stringify!(probe_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).client_data) as usize - ptr as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(MultiBootParam),
            "::",
            stringify!(client_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).palette_data) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(MultiBootParam),
            "::",
            stringify!(palette_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).response_bit) as usize - ptr as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(MultiBootParam),
            "::",
            stringify!(response_bit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).client_bit) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(MultiBootParam),
            "::",
            stringify!(client_bit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved1) as usize - ptr as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(MultiBootParam),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).boot_srcp) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(MultiBootParam),
            "::",
            stringify!(boot_srcp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).boot_endp) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(MultiBootParam),
            "::",
            stringify!(boot_endp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).masterp) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(MultiBootParam),
            "::",
            stringify!(masterp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved2) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(MultiBootParam),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).system_work2) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(MultiBootParam),
            "::",
            stringify!(system_work2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sendflag) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(MultiBootParam),
            "::",
            stringify!(sendflag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).probe_target_bit) as usize - ptr as usize },
        97usize,
        concat!(
            "Offset of field: ",
            stringify!(MultiBootParam),
            "::",
            stringify!(probe_target_bit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).check_wait) as usize - ptr as usize },
        98usize,
        concat!(
            "Offset of field: ",
            stringify!(MultiBootParam),
            "::",
            stringify!(check_wait)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).server_type) as usize - ptr as usize },
        99usize,
        concat!(
            "Offset of field: ",
            stringify!(MultiBootParam),
            "::",
            stringify!(server_type)
        )
    );
}
extern "C" {
    pub fn SoftReset(resetFlags: u32_);
}
extern "C" {
    pub fn RegisterRamReset(resetFlags: u32_);
}
extern "C" {
    pub fn VBlankIntrWait();
}
extern "C" {
    pub fn Sqrt(num: u32_) -> u16_;
}
extern "C" {
    pub fn ArcTan2(x: s16, y: s16) -> u16_;
}
extern "C" {
    pub fn CpuSet(
        src: *const ::std::os::raw::c_void,
        dest: *mut ::std::os::raw::c_void,
        control: u32_,
    );
}
extern "C" {
    pub fn CpuFastSet(
        src: *const ::std::os::raw::c_void,
        dest: *mut ::std::os::raw::c_void,
        control: u32_,
    );
}
extern "C" {
    pub fn BgAffineSet(src: *mut BgAffineSrcData, dest: *mut BgAffineDstData, count: s32);
}
extern "C" {
    pub fn ObjAffineSet(
        src: *mut ObjAffineSrcData,
        dest: *mut ::std::os::raw::c_void,
        count: s32,
        offset: s32,
    );
}
extern "C" {
    pub fn LZ77UnCompWram(src: *const u32_, dest: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn LZ77UnCompVram(src: *const u32_, dest: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn RLUnCompWram(src: *const ::std::os::raw::c_void, dest: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn RLUnCompVram(src: *const ::std::os::raw::c_void, dest: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn MultiBoot(mp: *mut MultiBootParam) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Div(num: s32, denom: s32) -> s32;
}
pub type q4_12_t = s16;
pub type uq4_12_t = u32_;
pub const NATIONAL_DEX_NONE: _bindgen_ty_1 = 0;
pub const NATIONAL_DEX_BULBASAUR: _bindgen_ty_1 = 1;
pub const NATIONAL_DEX_IVYSAUR: _bindgen_ty_1 = 2;
pub const NATIONAL_DEX_VENUSAUR: _bindgen_ty_1 = 3;
pub const NATIONAL_DEX_CHARMANDER: _bindgen_ty_1 = 4;
pub const NATIONAL_DEX_CHARMELEON: _bindgen_ty_1 = 5;
pub const NATIONAL_DEX_CHARIZARD: _bindgen_ty_1 = 6;
pub const NATIONAL_DEX_SQUIRTLE: _bindgen_ty_1 = 7;
pub const NATIONAL_DEX_WARTORTLE: _bindgen_ty_1 = 8;
pub const NATIONAL_DEX_BLASTOISE: _bindgen_ty_1 = 9;
pub const NATIONAL_DEX_CATERPIE: _bindgen_ty_1 = 10;
pub const NATIONAL_DEX_METAPOD: _bindgen_ty_1 = 11;
pub const NATIONAL_DEX_BUTTERFREE: _bindgen_ty_1 = 12;
pub const NATIONAL_DEX_WEEDLE: _bindgen_ty_1 = 13;
pub const NATIONAL_DEX_KAKUNA: _bindgen_ty_1 = 14;
pub const NATIONAL_DEX_BEEDRILL: _bindgen_ty_1 = 15;
pub const NATIONAL_DEX_PIDGEY: _bindgen_ty_1 = 16;
pub const NATIONAL_DEX_PIDGEOTTO: _bindgen_ty_1 = 17;
pub const NATIONAL_DEX_PIDGEOT: _bindgen_ty_1 = 18;
pub const NATIONAL_DEX_RATTATA: _bindgen_ty_1 = 19;
pub const NATIONAL_DEX_RATICATE: _bindgen_ty_1 = 20;
pub const NATIONAL_DEX_SPEAROW: _bindgen_ty_1 = 21;
pub const NATIONAL_DEX_FEAROW: _bindgen_ty_1 = 22;
pub const NATIONAL_DEX_EKANS: _bindgen_ty_1 = 23;
pub const NATIONAL_DEX_ARBOK: _bindgen_ty_1 = 24;
pub const NATIONAL_DEX_PIKACHU: _bindgen_ty_1 = 25;
pub const NATIONAL_DEX_RAICHU: _bindgen_ty_1 = 26;
pub const NATIONAL_DEX_SANDSHREW: _bindgen_ty_1 = 27;
pub const NATIONAL_DEX_SANDSLASH: _bindgen_ty_1 = 28;
pub const NATIONAL_DEX_NIDORAN_F: _bindgen_ty_1 = 29;
pub const NATIONAL_DEX_NIDORINA: _bindgen_ty_1 = 30;
pub const NATIONAL_DEX_NIDOQUEEN: _bindgen_ty_1 = 31;
pub const NATIONAL_DEX_NIDORAN_M: _bindgen_ty_1 = 32;
pub const NATIONAL_DEX_NIDORINO: _bindgen_ty_1 = 33;
pub const NATIONAL_DEX_NIDOKING: _bindgen_ty_1 = 34;
pub const NATIONAL_DEX_CLEFAIRY: _bindgen_ty_1 = 35;
pub const NATIONAL_DEX_CLEFABLE: _bindgen_ty_1 = 36;
pub const NATIONAL_DEX_VULPIX: _bindgen_ty_1 = 37;
pub const NATIONAL_DEX_NINETALES: _bindgen_ty_1 = 38;
pub const NATIONAL_DEX_JIGGLYPUFF: _bindgen_ty_1 = 39;
pub const NATIONAL_DEX_WIGGLYTUFF: _bindgen_ty_1 = 40;
pub const NATIONAL_DEX_ZUBAT: _bindgen_ty_1 = 41;
pub const NATIONAL_DEX_GOLBAT: _bindgen_ty_1 = 42;
pub const NATIONAL_DEX_ODDISH: _bindgen_ty_1 = 43;
pub const NATIONAL_DEX_GLOOM: _bindgen_ty_1 = 44;
pub const NATIONAL_DEX_VILEPLUME: _bindgen_ty_1 = 45;
pub const NATIONAL_DEX_PARAS: _bindgen_ty_1 = 46;
pub const NATIONAL_DEX_PARASECT: _bindgen_ty_1 = 47;
pub const NATIONAL_DEX_VENONAT: _bindgen_ty_1 = 48;
pub const NATIONAL_DEX_VENOMOTH: _bindgen_ty_1 = 49;
pub const NATIONAL_DEX_DIGLETT: _bindgen_ty_1 = 50;
pub const NATIONAL_DEX_DUGTRIO: _bindgen_ty_1 = 51;
pub const NATIONAL_DEX_MEOWTH: _bindgen_ty_1 = 52;
pub const NATIONAL_DEX_PERSIAN: _bindgen_ty_1 = 53;
pub const NATIONAL_DEX_PSYDUCK: _bindgen_ty_1 = 54;
pub const NATIONAL_DEX_GOLDUCK: _bindgen_ty_1 = 55;
pub const NATIONAL_DEX_MANKEY: _bindgen_ty_1 = 56;
pub const NATIONAL_DEX_PRIMEAPE: _bindgen_ty_1 = 57;
pub const NATIONAL_DEX_GROWLITHE: _bindgen_ty_1 = 58;
pub const NATIONAL_DEX_ARCANINE: _bindgen_ty_1 = 59;
pub const NATIONAL_DEX_POLIWAG: _bindgen_ty_1 = 60;
pub const NATIONAL_DEX_POLIWHIRL: _bindgen_ty_1 = 61;
pub const NATIONAL_DEX_POLIWRATH: _bindgen_ty_1 = 62;
pub const NATIONAL_DEX_ABRA: _bindgen_ty_1 = 63;
pub const NATIONAL_DEX_KADABRA: _bindgen_ty_1 = 64;
pub const NATIONAL_DEX_ALAKAZAM: _bindgen_ty_1 = 65;
pub const NATIONAL_DEX_MACHOP: _bindgen_ty_1 = 66;
pub const NATIONAL_DEX_MACHOKE: _bindgen_ty_1 = 67;
pub const NATIONAL_DEX_MACHAMP: _bindgen_ty_1 = 68;
pub const NATIONAL_DEX_BELLSPROUT: _bindgen_ty_1 = 69;
pub const NATIONAL_DEX_WEEPINBELL: _bindgen_ty_1 = 70;
pub const NATIONAL_DEX_VICTREEBEL: _bindgen_ty_1 = 71;
pub const NATIONAL_DEX_TENTACOOL: _bindgen_ty_1 = 72;
pub const NATIONAL_DEX_TENTACRUEL: _bindgen_ty_1 = 73;
pub const NATIONAL_DEX_GEODUDE: _bindgen_ty_1 = 74;
pub const NATIONAL_DEX_GRAVELER: _bindgen_ty_1 = 75;
pub const NATIONAL_DEX_GOLEM: _bindgen_ty_1 = 76;
pub const NATIONAL_DEX_PONYTA: _bindgen_ty_1 = 77;
pub const NATIONAL_DEX_RAPIDASH: _bindgen_ty_1 = 78;
pub const NATIONAL_DEX_SLOWPOKE: _bindgen_ty_1 = 79;
pub const NATIONAL_DEX_SLOWBRO: _bindgen_ty_1 = 80;
pub const NATIONAL_DEX_MAGNEMITE: _bindgen_ty_1 = 81;
pub const NATIONAL_DEX_MAGNETON: _bindgen_ty_1 = 82;
pub const NATIONAL_DEX_FARFETCHD: _bindgen_ty_1 = 83;
pub const NATIONAL_DEX_DODUO: _bindgen_ty_1 = 84;
pub const NATIONAL_DEX_DODRIO: _bindgen_ty_1 = 85;
pub const NATIONAL_DEX_SEEL: _bindgen_ty_1 = 86;
pub const NATIONAL_DEX_DEWGONG: _bindgen_ty_1 = 87;
pub const NATIONAL_DEX_GRIMER: _bindgen_ty_1 = 88;
pub const NATIONAL_DEX_MUK: _bindgen_ty_1 = 89;
pub const NATIONAL_DEX_SHELLDER: _bindgen_ty_1 = 90;
pub const NATIONAL_DEX_CLOYSTER: _bindgen_ty_1 = 91;
pub const NATIONAL_DEX_GASTLY: _bindgen_ty_1 = 92;
pub const NATIONAL_DEX_HAUNTER: _bindgen_ty_1 = 93;
pub const NATIONAL_DEX_GENGAR: _bindgen_ty_1 = 94;
pub const NATIONAL_DEX_ONIX: _bindgen_ty_1 = 95;
pub const NATIONAL_DEX_DROWZEE: _bindgen_ty_1 = 96;
pub const NATIONAL_DEX_HYPNO: _bindgen_ty_1 = 97;
pub const NATIONAL_DEX_KRABBY: _bindgen_ty_1 = 98;
pub const NATIONAL_DEX_KINGLER: _bindgen_ty_1 = 99;
pub const NATIONAL_DEX_VOLTORB: _bindgen_ty_1 = 100;
pub const NATIONAL_DEX_ELECTRODE: _bindgen_ty_1 = 101;
pub const NATIONAL_DEX_EXEGGCUTE: _bindgen_ty_1 = 102;
pub const NATIONAL_DEX_EXEGGUTOR: _bindgen_ty_1 = 103;
pub const NATIONAL_DEX_CUBONE: _bindgen_ty_1 = 104;
pub const NATIONAL_DEX_MAROWAK: _bindgen_ty_1 = 105;
pub const NATIONAL_DEX_HITMONLEE: _bindgen_ty_1 = 106;
pub const NATIONAL_DEX_HITMONCHAN: _bindgen_ty_1 = 107;
pub const NATIONAL_DEX_LICKITUNG: _bindgen_ty_1 = 108;
pub const NATIONAL_DEX_KOFFING: _bindgen_ty_1 = 109;
pub const NATIONAL_DEX_WEEZING: _bindgen_ty_1 = 110;
pub const NATIONAL_DEX_RHYHORN: _bindgen_ty_1 = 111;
pub const NATIONAL_DEX_RHYDON: _bindgen_ty_1 = 112;
pub const NATIONAL_DEX_CHANSEY: _bindgen_ty_1 = 113;
pub const NATIONAL_DEX_TANGELA: _bindgen_ty_1 = 114;
pub const NATIONAL_DEX_KANGASKHAN: _bindgen_ty_1 = 115;
pub const NATIONAL_DEX_HORSEA: _bindgen_ty_1 = 116;
pub const NATIONAL_DEX_SEADRA: _bindgen_ty_1 = 117;
pub const NATIONAL_DEX_GOLDEEN: _bindgen_ty_1 = 118;
pub const NATIONAL_DEX_SEAKING: _bindgen_ty_1 = 119;
pub const NATIONAL_DEX_STARYU: _bindgen_ty_1 = 120;
pub const NATIONAL_DEX_STARMIE: _bindgen_ty_1 = 121;
pub const NATIONAL_DEX_MR_MIME: _bindgen_ty_1 = 122;
pub const NATIONAL_DEX_SCYTHER: _bindgen_ty_1 = 123;
pub const NATIONAL_DEX_JYNX: _bindgen_ty_1 = 124;
pub const NATIONAL_DEX_ELECTABUZZ: _bindgen_ty_1 = 125;
pub const NATIONAL_DEX_MAGMAR: _bindgen_ty_1 = 126;
pub const NATIONAL_DEX_PINSIR: _bindgen_ty_1 = 127;
pub const NATIONAL_DEX_TAUROS: _bindgen_ty_1 = 128;
pub const NATIONAL_DEX_MAGIKARP: _bindgen_ty_1 = 129;
pub const NATIONAL_DEX_GYARADOS: _bindgen_ty_1 = 130;
pub const NATIONAL_DEX_LAPRAS: _bindgen_ty_1 = 131;
pub const NATIONAL_DEX_DITTO: _bindgen_ty_1 = 132;
pub const NATIONAL_DEX_EEVEE: _bindgen_ty_1 = 133;
pub const NATIONAL_DEX_VAPOREON: _bindgen_ty_1 = 134;
pub const NATIONAL_DEX_JOLTEON: _bindgen_ty_1 = 135;
pub const NATIONAL_DEX_FLAREON: _bindgen_ty_1 = 136;
pub const NATIONAL_DEX_PORYGON: _bindgen_ty_1 = 137;
pub const NATIONAL_DEX_OMANYTE: _bindgen_ty_1 = 138;
pub const NATIONAL_DEX_OMASTAR: _bindgen_ty_1 = 139;
pub const NATIONAL_DEX_KABUTO: _bindgen_ty_1 = 140;
pub const NATIONAL_DEX_KABUTOPS: _bindgen_ty_1 = 141;
pub const NATIONAL_DEX_AERODACTYL: _bindgen_ty_1 = 142;
pub const NATIONAL_DEX_SNORLAX: _bindgen_ty_1 = 143;
pub const NATIONAL_DEX_ARTICUNO: _bindgen_ty_1 = 144;
pub const NATIONAL_DEX_ZAPDOS: _bindgen_ty_1 = 145;
pub const NATIONAL_DEX_MOLTRES: _bindgen_ty_1 = 146;
pub const NATIONAL_DEX_DRATINI: _bindgen_ty_1 = 147;
pub const NATIONAL_DEX_DRAGONAIR: _bindgen_ty_1 = 148;
pub const NATIONAL_DEX_DRAGONITE: _bindgen_ty_1 = 149;
pub const NATIONAL_DEX_MEWTWO: _bindgen_ty_1 = 150;
pub const NATIONAL_DEX_MEW: _bindgen_ty_1 = 151;
pub const NATIONAL_DEX_CHIKORITA: _bindgen_ty_1 = 152;
pub const NATIONAL_DEX_BAYLEEF: _bindgen_ty_1 = 153;
pub const NATIONAL_DEX_MEGANIUM: _bindgen_ty_1 = 154;
pub const NATIONAL_DEX_CYNDAQUIL: _bindgen_ty_1 = 155;
pub const NATIONAL_DEX_QUILAVA: _bindgen_ty_1 = 156;
pub const NATIONAL_DEX_TYPHLOSION: _bindgen_ty_1 = 157;
pub const NATIONAL_DEX_TOTODILE: _bindgen_ty_1 = 158;
pub const NATIONAL_DEX_CROCONAW: _bindgen_ty_1 = 159;
pub const NATIONAL_DEX_FERALIGATR: _bindgen_ty_1 = 160;
pub const NATIONAL_DEX_SENTRET: _bindgen_ty_1 = 161;
pub const NATIONAL_DEX_FURRET: _bindgen_ty_1 = 162;
pub const NATIONAL_DEX_HOOTHOOT: _bindgen_ty_1 = 163;
pub const NATIONAL_DEX_NOCTOWL: _bindgen_ty_1 = 164;
pub const NATIONAL_DEX_LEDYBA: _bindgen_ty_1 = 165;
pub const NATIONAL_DEX_LEDIAN: _bindgen_ty_1 = 166;
pub const NATIONAL_DEX_SPINARAK: _bindgen_ty_1 = 167;
pub const NATIONAL_DEX_ARIADOS: _bindgen_ty_1 = 168;
pub const NATIONAL_DEX_CROBAT: _bindgen_ty_1 = 169;
pub const NATIONAL_DEX_CHINCHOU: _bindgen_ty_1 = 170;
pub const NATIONAL_DEX_LANTURN: _bindgen_ty_1 = 171;
pub const NATIONAL_DEX_PICHU: _bindgen_ty_1 = 172;
pub const NATIONAL_DEX_CLEFFA: _bindgen_ty_1 = 173;
pub const NATIONAL_DEX_IGGLYBUFF: _bindgen_ty_1 = 174;
pub const NATIONAL_DEX_TOGEPI: _bindgen_ty_1 = 175;
pub const NATIONAL_DEX_TOGETIC: _bindgen_ty_1 = 176;
pub const NATIONAL_DEX_NATU: _bindgen_ty_1 = 177;
pub const NATIONAL_DEX_XATU: _bindgen_ty_1 = 178;
pub const NATIONAL_DEX_MAREEP: _bindgen_ty_1 = 179;
pub const NATIONAL_DEX_FLAAFFY: _bindgen_ty_1 = 180;
pub const NATIONAL_DEX_AMPHAROS: _bindgen_ty_1 = 181;
pub const NATIONAL_DEX_BELLOSSOM: _bindgen_ty_1 = 182;
pub const NATIONAL_DEX_MARILL: _bindgen_ty_1 = 183;
pub const NATIONAL_DEX_AZUMARILL: _bindgen_ty_1 = 184;
pub const NATIONAL_DEX_SUDOWOODO: _bindgen_ty_1 = 185;
pub const NATIONAL_DEX_POLITOED: _bindgen_ty_1 = 186;
pub const NATIONAL_DEX_HOPPIP: _bindgen_ty_1 = 187;
pub const NATIONAL_DEX_SKIPLOOM: _bindgen_ty_1 = 188;
pub const NATIONAL_DEX_JUMPLUFF: _bindgen_ty_1 = 189;
pub const NATIONAL_DEX_AIPOM: _bindgen_ty_1 = 190;
pub const NATIONAL_DEX_SUNKERN: _bindgen_ty_1 = 191;
pub const NATIONAL_DEX_SUNFLORA: _bindgen_ty_1 = 192;
pub const NATIONAL_DEX_YANMA: _bindgen_ty_1 = 193;
pub const NATIONAL_DEX_WOOPER: _bindgen_ty_1 = 194;
pub const NATIONAL_DEX_QUAGSIRE: _bindgen_ty_1 = 195;
pub const NATIONAL_DEX_ESPEON: _bindgen_ty_1 = 196;
pub const NATIONAL_DEX_UMBREON: _bindgen_ty_1 = 197;
pub const NATIONAL_DEX_MURKROW: _bindgen_ty_1 = 198;
pub const NATIONAL_DEX_SLOWKING: _bindgen_ty_1 = 199;
pub const NATIONAL_DEX_MISDREAVUS: _bindgen_ty_1 = 200;
pub const NATIONAL_DEX_UNOWN: _bindgen_ty_1 = 201;
pub const NATIONAL_DEX_WOBBUFFET: _bindgen_ty_1 = 202;
pub const NATIONAL_DEX_GIRAFARIG: _bindgen_ty_1 = 203;
pub const NATIONAL_DEX_PINECO: _bindgen_ty_1 = 204;
pub const NATIONAL_DEX_FORRETRESS: _bindgen_ty_1 = 205;
pub const NATIONAL_DEX_DUNSPARCE: _bindgen_ty_1 = 206;
pub const NATIONAL_DEX_GLIGAR: _bindgen_ty_1 = 207;
pub const NATIONAL_DEX_STEELIX: _bindgen_ty_1 = 208;
pub const NATIONAL_DEX_SNUBBULL: _bindgen_ty_1 = 209;
pub const NATIONAL_DEX_GRANBULL: _bindgen_ty_1 = 210;
pub const NATIONAL_DEX_QWILFISH: _bindgen_ty_1 = 211;
pub const NATIONAL_DEX_SCIZOR: _bindgen_ty_1 = 212;
pub const NATIONAL_DEX_SHUCKLE: _bindgen_ty_1 = 213;
pub const NATIONAL_DEX_HERACROSS: _bindgen_ty_1 = 214;
pub const NATIONAL_DEX_SNEASEL: _bindgen_ty_1 = 215;
pub const NATIONAL_DEX_TEDDIURSA: _bindgen_ty_1 = 216;
pub const NATIONAL_DEX_URSARING: _bindgen_ty_1 = 217;
pub const NATIONAL_DEX_SLUGMA: _bindgen_ty_1 = 218;
pub const NATIONAL_DEX_MAGCARGO: _bindgen_ty_1 = 219;
pub const NATIONAL_DEX_SWINUB: _bindgen_ty_1 = 220;
pub const NATIONAL_DEX_PILOSWINE: _bindgen_ty_1 = 221;
pub const NATIONAL_DEX_CORSOLA: _bindgen_ty_1 = 222;
pub const NATIONAL_DEX_REMORAID: _bindgen_ty_1 = 223;
pub const NATIONAL_DEX_OCTILLERY: _bindgen_ty_1 = 224;
pub const NATIONAL_DEX_DELIBIRD: _bindgen_ty_1 = 225;
pub const NATIONAL_DEX_MANTINE: _bindgen_ty_1 = 226;
pub const NATIONAL_DEX_SKARMORY: _bindgen_ty_1 = 227;
pub const NATIONAL_DEX_HOUNDOUR: _bindgen_ty_1 = 228;
pub const NATIONAL_DEX_HOUNDOOM: _bindgen_ty_1 = 229;
pub const NATIONAL_DEX_KINGDRA: _bindgen_ty_1 = 230;
pub const NATIONAL_DEX_PHANPY: _bindgen_ty_1 = 231;
pub const NATIONAL_DEX_DONPHAN: _bindgen_ty_1 = 232;
pub const NATIONAL_DEX_PORYGON2: _bindgen_ty_1 = 233;
pub const NATIONAL_DEX_STANTLER: _bindgen_ty_1 = 234;
pub const NATIONAL_DEX_SMEARGLE: _bindgen_ty_1 = 235;
pub const NATIONAL_DEX_TYROGUE: _bindgen_ty_1 = 236;
pub const NATIONAL_DEX_HITMONTOP: _bindgen_ty_1 = 237;
pub const NATIONAL_DEX_SMOOCHUM: _bindgen_ty_1 = 238;
pub const NATIONAL_DEX_ELEKID: _bindgen_ty_1 = 239;
pub const NATIONAL_DEX_MAGBY: _bindgen_ty_1 = 240;
pub const NATIONAL_DEX_MILTANK: _bindgen_ty_1 = 241;
pub const NATIONAL_DEX_BLISSEY: _bindgen_ty_1 = 242;
pub const NATIONAL_DEX_RAIKOU: _bindgen_ty_1 = 243;
pub const NATIONAL_DEX_ENTEI: _bindgen_ty_1 = 244;
pub const NATIONAL_DEX_SUICUNE: _bindgen_ty_1 = 245;
pub const NATIONAL_DEX_LARVITAR: _bindgen_ty_1 = 246;
pub const NATIONAL_DEX_PUPITAR: _bindgen_ty_1 = 247;
pub const NATIONAL_DEX_TYRANITAR: _bindgen_ty_1 = 248;
pub const NATIONAL_DEX_LUGIA: _bindgen_ty_1 = 249;
pub const NATIONAL_DEX_HO_OH: _bindgen_ty_1 = 250;
pub const NATIONAL_DEX_CELEBI: _bindgen_ty_1 = 251;
pub const NATIONAL_DEX_TREECKO: _bindgen_ty_1 = 252;
pub const NATIONAL_DEX_GROVYLE: _bindgen_ty_1 = 253;
pub const NATIONAL_DEX_SCEPTILE: _bindgen_ty_1 = 254;
pub const NATIONAL_DEX_TORCHIC: _bindgen_ty_1 = 255;
pub const NATIONAL_DEX_COMBUSKEN: _bindgen_ty_1 = 256;
pub const NATIONAL_DEX_BLAZIKEN: _bindgen_ty_1 = 257;
pub const NATIONAL_DEX_MUDKIP: _bindgen_ty_1 = 258;
pub const NATIONAL_DEX_MARSHTOMP: _bindgen_ty_1 = 259;
pub const NATIONAL_DEX_SWAMPERT: _bindgen_ty_1 = 260;
pub const NATIONAL_DEX_POOCHYENA: _bindgen_ty_1 = 261;
pub const NATIONAL_DEX_MIGHTYENA: _bindgen_ty_1 = 262;
pub const NATIONAL_DEX_ZIGZAGOON: _bindgen_ty_1 = 263;
pub const NATIONAL_DEX_LINOONE: _bindgen_ty_1 = 264;
pub const NATIONAL_DEX_WURMPLE: _bindgen_ty_1 = 265;
pub const NATIONAL_DEX_SILCOON: _bindgen_ty_1 = 266;
pub const NATIONAL_DEX_BEAUTIFLY: _bindgen_ty_1 = 267;
pub const NATIONAL_DEX_CASCOON: _bindgen_ty_1 = 268;
pub const NATIONAL_DEX_DUSTOX: _bindgen_ty_1 = 269;
pub const NATIONAL_DEX_LOTAD: _bindgen_ty_1 = 270;
pub const NATIONAL_DEX_LOMBRE: _bindgen_ty_1 = 271;
pub const NATIONAL_DEX_LUDICOLO: _bindgen_ty_1 = 272;
pub const NATIONAL_DEX_SEEDOT: _bindgen_ty_1 = 273;
pub const NATIONAL_DEX_NUZLEAF: _bindgen_ty_1 = 274;
pub const NATIONAL_DEX_SHIFTRY: _bindgen_ty_1 = 275;
pub const NATIONAL_DEX_TAILLOW: _bindgen_ty_1 = 276;
pub const NATIONAL_DEX_SWELLOW: _bindgen_ty_1 = 277;
pub const NATIONAL_DEX_WINGULL: _bindgen_ty_1 = 278;
pub const NATIONAL_DEX_PELIPPER: _bindgen_ty_1 = 279;
pub const NATIONAL_DEX_RALTS: _bindgen_ty_1 = 280;
pub const NATIONAL_DEX_KIRLIA: _bindgen_ty_1 = 281;
pub const NATIONAL_DEX_GARDEVOIR: _bindgen_ty_1 = 282;
pub const NATIONAL_DEX_SURSKIT: _bindgen_ty_1 = 283;
pub const NATIONAL_DEX_MASQUERAIN: _bindgen_ty_1 = 284;
pub const NATIONAL_DEX_SHROOMISH: _bindgen_ty_1 = 285;
pub const NATIONAL_DEX_BRELOOM: _bindgen_ty_1 = 286;
pub const NATIONAL_DEX_SLAKOTH: _bindgen_ty_1 = 287;
pub const NATIONAL_DEX_VIGOROTH: _bindgen_ty_1 = 288;
pub const NATIONAL_DEX_SLAKING: _bindgen_ty_1 = 289;
pub const NATIONAL_DEX_NINCADA: _bindgen_ty_1 = 290;
pub const NATIONAL_DEX_NINJASK: _bindgen_ty_1 = 291;
pub const NATIONAL_DEX_SHEDINJA: _bindgen_ty_1 = 292;
pub const NATIONAL_DEX_WHISMUR: _bindgen_ty_1 = 293;
pub const NATIONAL_DEX_LOUDRED: _bindgen_ty_1 = 294;
pub const NATIONAL_DEX_EXPLOUD: _bindgen_ty_1 = 295;
pub const NATIONAL_DEX_MAKUHITA: _bindgen_ty_1 = 296;
pub const NATIONAL_DEX_HARIYAMA: _bindgen_ty_1 = 297;
pub const NATIONAL_DEX_AZURILL: _bindgen_ty_1 = 298;
pub const NATIONAL_DEX_NOSEPASS: _bindgen_ty_1 = 299;
pub const NATIONAL_DEX_SKITTY: _bindgen_ty_1 = 300;
pub const NATIONAL_DEX_DELCATTY: _bindgen_ty_1 = 301;
pub const NATIONAL_DEX_SABLEYE: _bindgen_ty_1 = 302;
pub const NATIONAL_DEX_MAWILE: _bindgen_ty_1 = 303;
pub const NATIONAL_DEX_ARON: _bindgen_ty_1 = 304;
pub const NATIONAL_DEX_LAIRON: _bindgen_ty_1 = 305;
pub const NATIONAL_DEX_AGGRON: _bindgen_ty_1 = 306;
pub const NATIONAL_DEX_MEDITITE: _bindgen_ty_1 = 307;
pub const NATIONAL_DEX_MEDICHAM: _bindgen_ty_1 = 308;
pub const NATIONAL_DEX_ELECTRIKE: _bindgen_ty_1 = 309;
pub const NATIONAL_DEX_MANECTRIC: _bindgen_ty_1 = 310;
pub const NATIONAL_DEX_PLUSLE: _bindgen_ty_1 = 311;
pub const NATIONAL_DEX_MINUN: _bindgen_ty_1 = 312;
pub const NATIONAL_DEX_VOLBEAT: _bindgen_ty_1 = 313;
pub const NATIONAL_DEX_ILLUMISE: _bindgen_ty_1 = 314;
pub const NATIONAL_DEX_ROSELIA: _bindgen_ty_1 = 315;
pub const NATIONAL_DEX_GULPIN: _bindgen_ty_1 = 316;
pub const NATIONAL_DEX_SWALOT: _bindgen_ty_1 = 317;
pub const NATIONAL_DEX_CARVANHA: _bindgen_ty_1 = 318;
pub const NATIONAL_DEX_SHARPEDO: _bindgen_ty_1 = 319;
pub const NATIONAL_DEX_WAILMER: _bindgen_ty_1 = 320;
pub const NATIONAL_DEX_WAILORD: _bindgen_ty_1 = 321;
pub const NATIONAL_DEX_NUMEL: _bindgen_ty_1 = 322;
pub const NATIONAL_DEX_CAMERUPT: _bindgen_ty_1 = 323;
pub const NATIONAL_DEX_TORKOAL: _bindgen_ty_1 = 324;
pub const NATIONAL_DEX_SPOINK: _bindgen_ty_1 = 325;
pub const NATIONAL_DEX_GRUMPIG: _bindgen_ty_1 = 326;
pub const NATIONAL_DEX_SPINDA: _bindgen_ty_1 = 327;
pub const NATIONAL_DEX_TRAPINCH: _bindgen_ty_1 = 328;
pub const NATIONAL_DEX_VIBRAVA: _bindgen_ty_1 = 329;
pub const NATIONAL_DEX_FLYGON: _bindgen_ty_1 = 330;
pub const NATIONAL_DEX_CACNEA: _bindgen_ty_1 = 331;
pub const NATIONAL_DEX_CACTURNE: _bindgen_ty_1 = 332;
pub const NATIONAL_DEX_SWABLU: _bindgen_ty_1 = 333;
pub const NATIONAL_DEX_ALTARIA: _bindgen_ty_1 = 334;
pub const NATIONAL_DEX_ZANGOOSE: _bindgen_ty_1 = 335;
pub const NATIONAL_DEX_SEVIPER: _bindgen_ty_1 = 336;
pub const NATIONAL_DEX_LUNATONE: _bindgen_ty_1 = 337;
pub const NATIONAL_DEX_SOLROCK: _bindgen_ty_1 = 338;
pub const NATIONAL_DEX_BARBOACH: _bindgen_ty_1 = 339;
pub const NATIONAL_DEX_WHISCASH: _bindgen_ty_1 = 340;
pub const NATIONAL_DEX_CORPHISH: _bindgen_ty_1 = 341;
pub const NATIONAL_DEX_CRAWDAUNT: _bindgen_ty_1 = 342;
pub const NATIONAL_DEX_BALTOY: _bindgen_ty_1 = 343;
pub const NATIONAL_DEX_CLAYDOL: _bindgen_ty_1 = 344;
pub const NATIONAL_DEX_LILEEP: _bindgen_ty_1 = 345;
pub const NATIONAL_DEX_CRADILY: _bindgen_ty_1 = 346;
pub const NATIONAL_DEX_ANORITH: _bindgen_ty_1 = 347;
pub const NATIONAL_DEX_ARMALDO: _bindgen_ty_1 = 348;
pub const NATIONAL_DEX_FEEBAS: _bindgen_ty_1 = 349;
pub const NATIONAL_DEX_MILOTIC: _bindgen_ty_1 = 350;
pub const NATIONAL_DEX_CASTFORM: _bindgen_ty_1 = 351;
pub const NATIONAL_DEX_KECLEON: _bindgen_ty_1 = 352;
pub const NATIONAL_DEX_SHUPPET: _bindgen_ty_1 = 353;
pub const NATIONAL_DEX_BANETTE: _bindgen_ty_1 = 354;
pub const NATIONAL_DEX_DUSKULL: _bindgen_ty_1 = 355;
pub const NATIONAL_DEX_DUSCLOPS: _bindgen_ty_1 = 356;
pub const NATIONAL_DEX_TROPIUS: _bindgen_ty_1 = 357;
pub const NATIONAL_DEX_CHIMECHO: _bindgen_ty_1 = 358;
pub const NATIONAL_DEX_ABSOL: _bindgen_ty_1 = 359;
pub const NATIONAL_DEX_WYNAUT: _bindgen_ty_1 = 360;
pub const NATIONAL_DEX_SNORUNT: _bindgen_ty_1 = 361;
pub const NATIONAL_DEX_GLALIE: _bindgen_ty_1 = 362;
pub const NATIONAL_DEX_SPHEAL: _bindgen_ty_1 = 363;
pub const NATIONAL_DEX_SEALEO: _bindgen_ty_1 = 364;
pub const NATIONAL_DEX_WALREIN: _bindgen_ty_1 = 365;
pub const NATIONAL_DEX_CLAMPERL: _bindgen_ty_1 = 366;
pub const NATIONAL_DEX_HUNTAIL: _bindgen_ty_1 = 367;
pub const NATIONAL_DEX_GOREBYSS: _bindgen_ty_1 = 368;
pub const NATIONAL_DEX_RELICANTH: _bindgen_ty_1 = 369;
pub const NATIONAL_DEX_LUVDISC: _bindgen_ty_1 = 370;
pub const NATIONAL_DEX_BAGON: _bindgen_ty_1 = 371;
pub const NATIONAL_DEX_SHELGON: _bindgen_ty_1 = 372;
pub const NATIONAL_DEX_SALAMENCE: _bindgen_ty_1 = 373;
pub const NATIONAL_DEX_BELDUM: _bindgen_ty_1 = 374;
pub const NATIONAL_DEX_METANG: _bindgen_ty_1 = 375;
pub const NATIONAL_DEX_METAGROSS: _bindgen_ty_1 = 376;
pub const NATIONAL_DEX_REGIROCK: _bindgen_ty_1 = 377;
pub const NATIONAL_DEX_REGICE: _bindgen_ty_1 = 378;
pub const NATIONAL_DEX_REGISTEEL: _bindgen_ty_1 = 379;
pub const NATIONAL_DEX_LATIAS: _bindgen_ty_1 = 380;
pub const NATIONAL_DEX_LATIOS: _bindgen_ty_1 = 381;
pub const NATIONAL_DEX_KYOGRE: _bindgen_ty_1 = 382;
pub const NATIONAL_DEX_GROUDON: _bindgen_ty_1 = 383;
pub const NATIONAL_DEX_RAYQUAZA: _bindgen_ty_1 = 384;
pub const NATIONAL_DEX_JIRACHI: _bindgen_ty_1 = 385;
pub const NATIONAL_DEX_DEOXYS: _bindgen_ty_1 = 386;
pub const NATIONAL_DEX_TURTWIG: _bindgen_ty_1 = 387;
pub const NATIONAL_DEX_GROTLE: _bindgen_ty_1 = 388;
pub const NATIONAL_DEX_TORTERRA: _bindgen_ty_1 = 389;
pub const NATIONAL_DEX_CHIMCHAR: _bindgen_ty_1 = 390;
pub const NATIONAL_DEX_MONFERNO: _bindgen_ty_1 = 391;
pub const NATIONAL_DEX_INFERNAPE: _bindgen_ty_1 = 392;
pub const NATIONAL_DEX_PIPLUP: _bindgen_ty_1 = 393;
pub const NATIONAL_DEX_PRINPLUP: _bindgen_ty_1 = 394;
pub const NATIONAL_DEX_EMPOLEON: _bindgen_ty_1 = 395;
pub const NATIONAL_DEX_STARLY: _bindgen_ty_1 = 396;
pub const NATIONAL_DEX_STARAVIA: _bindgen_ty_1 = 397;
pub const NATIONAL_DEX_STARAPTOR: _bindgen_ty_1 = 398;
pub const NATIONAL_DEX_BIDOOF: _bindgen_ty_1 = 399;
pub const NATIONAL_DEX_BIBAREL: _bindgen_ty_1 = 400;
pub const NATIONAL_DEX_KRICKETOT: _bindgen_ty_1 = 401;
pub const NATIONAL_DEX_KRICKETUNE: _bindgen_ty_1 = 402;
pub const NATIONAL_DEX_SHINX: _bindgen_ty_1 = 403;
pub const NATIONAL_DEX_LUXIO: _bindgen_ty_1 = 404;
pub const NATIONAL_DEX_LUXRAY: _bindgen_ty_1 = 405;
pub const NATIONAL_DEX_BUDEW: _bindgen_ty_1 = 406;
pub const NATIONAL_DEX_ROSERADE: _bindgen_ty_1 = 407;
pub const NATIONAL_DEX_CRANIDOS: _bindgen_ty_1 = 408;
pub const NATIONAL_DEX_RAMPARDOS: _bindgen_ty_1 = 409;
pub const NATIONAL_DEX_SHIELDON: _bindgen_ty_1 = 410;
pub const NATIONAL_DEX_BASTIODON: _bindgen_ty_1 = 411;
pub const NATIONAL_DEX_BURMY: _bindgen_ty_1 = 412;
pub const NATIONAL_DEX_WORMADAM: _bindgen_ty_1 = 413;
pub const NATIONAL_DEX_MOTHIM: _bindgen_ty_1 = 414;
pub const NATIONAL_DEX_COMBEE: _bindgen_ty_1 = 415;
pub const NATIONAL_DEX_VESPIQUEN: _bindgen_ty_1 = 416;
pub const NATIONAL_DEX_PACHIRISU: _bindgen_ty_1 = 417;
pub const NATIONAL_DEX_BUIZEL: _bindgen_ty_1 = 418;
pub const NATIONAL_DEX_FLOATZEL: _bindgen_ty_1 = 419;
pub const NATIONAL_DEX_CHERUBI: _bindgen_ty_1 = 420;
pub const NATIONAL_DEX_CHERRIM: _bindgen_ty_1 = 421;
pub const NATIONAL_DEX_SHELLOS: _bindgen_ty_1 = 422;
pub const NATIONAL_DEX_GASTRODON: _bindgen_ty_1 = 423;
pub const NATIONAL_DEX_AMBIPOM: _bindgen_ty_1 = 424;
pub const NATIONAL_DEX_DRIFLOON: _bindgen_ty_1 = 425;
pub const NATIONAL_DEX_DRIFBLIM: _bindgen_ty_1 = 426;
pub const NATIONAL_DEX_BUNEARY: _bindgen_ty_1 = 427;
pub const NATIONAL_DEX_LOPUNNY: _bindgen_ty_1 = 428;
pub const NATIONAL_DEX_MISMAGIUS: _bindgen_ty_1 = 429;
pub const NATIONAL_DEX_HONCHKROW: _bindgen_ty_1 = 430;
pub const NATIONAL_DEX_GLAMEOW: _bindgen_ty_1 = 431;
pub const NATIONAL_DEX_PURUGLY: _bindgen_ty_1 = 432;
pub const NATIONAL_DEX_CHINGLING: _bindgen_ty_1 = 433;
pub const NATIONAL_DEX_STUNKY: _bindgen_ty_1 = 434;
pub const NATIONAL_DEX_SKUNTANK: _bindgen_ty_1 = 435;
pub const NATIONAL_DEX_BRONZOR: _bindgen_ty_1 = 436;
pub const NATIONAL_DEX_BRONZONG: _bindgen_ty_1 = 437;
pub const NATIONAL_DEX_BONSLY: _bindgen_ty_1 = 438;
pub const NATIONAL_DEX_MIME_JR: _bindgen_ty_1 = 439;
pub const NATIONAL_DEX_HAPPINY: _bindgen_ty_1 = 440;
pub const NATIONAL_DEX_CHATOT: _bindgen_ty_1 = 441;
pub const NATIONAL_DEX_SPIRITOMB: _bindgen_ty_1 = 442;
pub const NATIONAL_DEX_GIBLE: _bindgen_ty_1 = 443;
pub const NATIONAL_DEX_GABITE: _bindgen_ty_1 = 444;
pub const NATIONAL_DEX_GARCHOMP: _bindgen_ty_1 = 445;
pub const NATIONAL_DEX_MUNCHLAX: _bindgen_ty_1 = 446;
pub const NATIONAL_DEX_RIOLU: _bindgen_ty_1 = 447;
pub const NATIONAL_DEX_LUCARIO: _bindgen_ty_1 = 448;
pub const NATIONAL_DEX_HIPPOPOTAS: _bindgen_ty_1 = 449;
pub const NATIONAL_DEX_HIPPOWDON: _bindgen_ty_1 = 450;
pub const NATIONAL_DEX_SKORUPI: _bindgen_ty_1 = 451;
pub const NATIONAL_DEX_DRAPION: _bindgen_ty_1 = 452;
pub const NATIONAL_DEX_CROAGUNK: _bindgen_ty_1 = 453;
pub const NATIONAL_DEX_TOXICROAK: _bindgen_ty_1 = 454;
pub const NATIONAL_DEX_CARNIVINE: _bindgen_ty_1 = 455;
pub const NATIONAL_DEX_FINNEON: _bindgen_ty_1 = 456;
pub const NATIONAL_DEX_LUMINEON: _bindgen_ty_1 = 457;
pub const NATIONAL_DEX_MANTYKE: _bindgen_ty_1 = 458;
pub const NATIONAL_DEX_SNOVER: _bindgen_ty_1 = 459;
pub const NATIONAL_DEX_ABOMASNOW: _bindgen_ty_1 = 460;
pub const NATIONAL_DEX_WEAVILE: _bindgen_ty_1 = 461;
pub const NATIONAL_DEX_MAGNEZONE: _bindgen_ty_1 = 462;
pub const NATIONAL_DEX_LICKILICKY: _bindgen_ty_1 = 463;
pub const NATIONAL_DEX_RHYPERIOR: _bindgen_ty_1 = 464;
pub const NATIONAL_DEX_TANGROWTH: _bindgen_ty_1 = 465;
pub const NATIONAL_DEX_ELECTIVIRE: _bindgen_ty_1 = 466;
pub const NATIONAL_DEX_MAGMORTAR: _bindgen_ty_1 = 467;
pub const NATIONAL_DEX_TOGEKISS: _bindgen_ty_1 = 468;
pub const NATIONAL_DEX_YANMEGA: _bindgen_ty_1 = 469;
pub const NATIONAL_DEX_LEAFEON: _bindgen_ty_1 = 470;
pub const NATIONAL_DEX_GLACEON: _bindgen_ty_1 = 471;
pub const NATIONAL_DEX_GLISCOR: _bindgen_ty_1 = 472;
pub const NATIONAL_DEX_MAMOSWINE: _bindgen_ty_1 = 473;
pub const NATIONAL_DEX_PORYGON_Z: _bindgen_ty_1 = 474;
pub const NATIONAL_DEX_GALLADE: _bindgen_ty_1 = 475;
pub const NATIONAL_DEX_PROBOPASS: _bindgen_ty_1 = 476;
pub const NATIONAL_DEX_DUSKNOIR: _bindgen_ty_1 = 477;
pub const NATIONAL_DEX_FROSLASS: _bindgen_ty_1 = 478;
pub const NATIONAL_DEX_ROTOM: _bindgen_ty_1 = 479;
pub const NATIONAL_DEX_UXIE: _bindgen_ty_1 = 480;
pub const NATIONAL_DEX_MESPRIT: _bindgen_ty_1 = 481;
pub const NATIONAL_DEX_AZELF: _bindgen_ty_1 = 482;
pub const NATIONAL_DEX_DIALGA: _bindgen_ty_1 = 483;
pub const NATIONAL_DEX_PALKIA: _bindgen_ty_1 = 484;
pub const NATIONAL_DEX_HEATRAN: _bindgen_ty_1 = 485;
pub const NATIONAL_DEX_REGIGIGAS: _bindgen_ty_1 = 486;
pub const NATIONAL_DEX_GIRATINA: _bindgen_ty_1 = 487;
pub const NATIONAL_DEX_CRESSELIA: _bindgen_ty_1 = 488;
pub const NATIONAL_DEX_PHIONE: _bindgen_ty_1 = 489;
pub const NATIONAL_DEX_MANAPHY: _bindgen_ty_1 = 490;
pub const NATIONAL_DEX_DARKRAI: _bindgen_ty_1 = 491;
pub const NATIONAL_DEX_SHAYMIN: _bindgen_ty_1 = 492;
pub const NATIONAL_DEX_ARCEUS: _bindgen_ty_1 = 493;
pub const NATIONAL_DEX_VICTINI: _bindgen_ty_1 = 494;
pub const NATIONAL_DEX_SNIVY: _bindgen_ty_1 = 495;
pub const NATIONAL_DEX_SERVINE: _bindgen_ty_1 = 496;
pub const NATIONAL_DEX_SERPERIOR: _bindgen_ty_1 = 497;
pub const NATIONAL_DEX_TEPIG: _bindgen_ty_1 = 498;
pub const NATIONAL_DEX_PIGNITE: _bindgen_ty_1 = 499;
pub const NATIONAL_DEX_EMBOAR: _bindgen_ty_1 = 500;
pub const NATIONAL_DEX_OSHAWOTT: _bindgen_ty_1 = 501;
pub const NATIONAL_DEX_DEWOTT: _bindgen_ty_1 = 502;
pub const NATIONAL_DEX_SAMUROTT: _bindgen_ty_1 = 503;
pub const NATIONAL_DEX_PATRAT: _bindgen_ty_1 = 504;
pub const NATIONAL_DEX_WATCHOG: _bindgen_ty_1 = 505;
pub const NATIONAL_DEX_LILLIPUP: _bindgen_ty_1 = 506;
pub const NATIONAL_DEX_HERDIER: _bindgen_ty_1 = 507;
pub const NATIONAL_DEX_STOUTLAND: _bindgen_ty_1 = 508;
pub const NATIONAL_DEX_PURRLOIN: _bindgen_ty_1 = 509;
pub const NATIONAL_DEX_LIEPARD: _bindgen_ty_1 = 510;
pub const NATIONAL_DEX_PANSAGE: _bindgen_ty_1 = 511;
pub const NATIONAL_DEX_SIMISAGE: _bindgen_ty_1 = 512;
pub const NATIONAL_DEX_PANSEAR: _bindgen_ty_1 = 513;
pub const NATIONAL_DEX_SIMISEAR: _bindgen_ty_1 = 514;
pub const NATIONAL_DEX_PANPOUR: _bindgen_ty_1 = 515;
pub const NATIONAL_DEX_SIMIPOUR: _bindgen_ty_1 = 516;
pub const NATIONAL_DEX_MUNNA: _bindgen_ty_1 = 517;
pub const NATIONAL_DEX_MUSHARNA: _bindgen_ty_1 = 518;
pub const NATIONAL_DEX_PIDOVE: _bindgen_ty_1 = 519;
pub const NATIONAL_DEX_TRANQUILL: _bindgen_ty_1 = 520;
pub const NATIONAL_DEX_UNFEZANT: _bindgen_ty_1 = 521;
pub const NATIONAL_DEX_BLITZLE: _bindgen_ty_1 = 522;
pub const NATIONAL_DEX_ZEBSTRIKA: _bindgen_ty_1 = 523;
pub const NATIONAL_DEX_ROGGENROLA: _bindgen_ty_1 = 524;
pub const NATIONAL_DEX_BOLDORE: _bindgen_ty_1 = 525;
pub const NATIONAL_DEX_GIGALITH: _bindgen_ty_1 = 526;
pub const NATIONAL_DEX_WOOBAT: _bindgen_ty_1 = 527;
pub const NATIONAL_DEX_SWOOBAT: _bindgen_ty_1 = 528;
pub const NATIONAL_DEX_DRILBUR: _bindgen_ty_1 = 529;
pub const NATIONAL_DEX_EXCADRILL: _bindgen_ty_1 = 530;
pub const NATIONAL_DEX_AUDINO: _bindgen_ty_1 = 531;
pub const NATIONAL_DEX_TIMBURR: _bindgen_ty_1 = 532;
pub const NATIONAL_DEX_GURDURR: _bindgen_ty_1 = 533;
pub const NATIONAL_DEX_CONKELDURR: _bindgen_ty_1 = 534;
pub const NATIONAL_DEX_TYMPOLE: _bindgen_ty_1 = 535;
pub const NATIONAL_DEX_PALPITOAD: _bindgen_ty_1 = 536;
pub const NATIONAL_DEX_SEISMITOAD: _bindgen_ty_1 = 537;
pub const NATIONAL_DEX_THROH: _bindgen_ty_1 = 538;
pub const NATIONAL_DEX_SAWK: _bindgen_ty_1 = 539;
pub const NATIONAL_DEX_SEWADDLE: _bindgen_ty_1 = 540;
pub const NATIONAL_DEX_SWADLOON: _bindgen_ty_1 = 541;
pub const NATIONAL_DEX_LEAVANNY: _bindgen_ty_1 = 542;
pub const NATIONAL_DEX_VENIPEDE: _bindgen_ty_1 = 543;
pub const NATIONAL_DEX_WHIRLIPEDE: _bindgen_ty_1 = 544;
pub const NATIONAL_DEX_SCOLIPEDE: _bindgen_ty_1 = 545;
pub const NATIONAL_DEX_COTTONEE: _bindgen_ty_1 = 546;
pub const NATIONAL_DEX_WHIMSICOTT: _bindgen_ty_1 = 547;
pub const NATIONAL_DEX_PETILIL: _bindgen_ty_1 = 548;
pub const NATIONAL_DEX_LILLIGANT: _bindgen_ty_1 = 549;
pub const NATIONAL_DEX_BASCULIN: _bindgen_ty_1 = 550;
pub const NATIONAL_DEX_SANDILE: _bindgen_ty_1 = 551;
pub const NATIONAL_DEX_KROKOROK: _bindgen_ty_1 = 552;
pub const NATIONAL_DEX_KROOKODILE: _bindgen_ty_1 = 553;
pub const NATIONAL_DEX_DARUMAKA: _bindgen_ty_1 = 554;
pub const NATIONAL_DEX_DARMANITAN: _bindgen_ty_1 = 555;
pub const NATIONAL_DEX_MARACTUS: _bindgen_ty_1 = 556;
pub const NATIONAL_DEX_DWEBBLE: _bindgen_ty_1 = 557;
pub const NATIONAL_DEX_CRUSTLE: _bindgen_ty_1 = 558;
pub const NATIONAL_DEX_SCRAGGY: _bindgen_ty_1 = 559;
pub const NATIONAL_DEX_SCRAFTY: _bindgen_ty_1 = 560;
pub const NATIONAL_DEX_SIGILYPH: _bindgen_ty_1 = 561;
pub const NATIONAL_DEX_YAMASK: _bindgen_ty_1 = 562;
pub const NATIONAL_DEX_COFAGRIGUS: _bindgen_ty_1 = 563;
pub const NATIONAL_DEX_TIRTOUGA: _bindgen_ty_1 = 564;
pub const NATIONAL_DEX_CARRACOSTA: _bindgen_ty_1 = 565;
pub const NATIONAL_DEX_ARCHEN: _bindgen_ty_1 = 566;
pub const NATIONAL_DEX_ARCHEOPS: _bindgen_ty_1 = 567;
pub const NATIONAL_DEX_TRUBBISH: _bindgen_ty_1 = 568;
pub const NATIONAL_DEX_GARBODOR: _bindgen_ty_1 = 569;
pub const NATIONAL_DEX_ZORUA: _bindgen_ty_1 = 570;
pub const NATIONAL_DEX_ZOROARK: _bindgen_ty_1 = 571;
pub const NATIONAL_DEX_MINCCINO: _bindgen_ty_1 = 572;
pub const NATIONAL_DEX_CINCCINO: _bindgen_ty_1 = 573;
pub const NATIONAL_DEX_GOTHITA: _bindgen_ty_1 = 574;
pub const NATIONAL_DEX_GOTHORITA: _bindgen_ty_1 = 575;
pub const NATIONAL_DEX_GOTHITELLE: _bindgen_ty_1 = 576;
pub const NATIONAL_DEX_SOLOSIS: _bindgen_ty_1 = 577;
pub const NATIONAL_DEX_DUOSION: _bindgen_ty_1 = 578;
pub const NATIONAL_DEX_REUNICLUS: _bindgen_ty_1 = 579;
pub const NATIONAL_DEX_DUCKLETT: _bindgen_ty_1 = 580;
pub const NATIONAL_DEX_SWANNA: _bindgen_ty_1 = 581;
pub const NATIONAL_DEX_VANILLITE: _bindgen_ty_1 = 582;
pub const NATIONAL_DEX_VANILLISH: _bindgen_ty_1 = 583;
pub const NATIONAL_DEX_VANILLUXE: _bindgen_ty_1 = 584;
pub const NATIONAL_DEX_DEERLING: _bindgen_ty_1 = 585;
pub const NATIONAL_DEX_SAWSBUCK: _bindgen_ty_1 = 586;
pub const NATIONAL_DEX_EMOLGA: _bindgen_ty_1 = 587;
pub const NATIONAL_DEX_KARRABLAST: _bindgen_ty_1 = 588;
pub const NATIONAL_DEX_ESCAVALIER: _bindgen_ty_1 = 589;
pub const NATIONAL_DEX_FOONGUS: _bindgen_ty_1 = 590;
pub const NATIONAL_DEX_AMOONGUSS: _bindgen_ty_1 = 591;
pub const NATIONAL_DEX_FRILLISH: _bindgen_ty_1 = 592;
pub const NATIONAL_DEX_JELLICENT: _bindgen_ty_1 = 593;
pub const NATIONAL_DEX_ALOMOMOLA: _bindgen_ty_1 = 594;
pub const NATIONAL_DEX_JOLTIK: _bindgen_ty_1 = 595;
pub const NATIONAL_DEX_GALVANTULA: _bindgen_ty_1 = 596;
pub const NATIONAL_DEX_FERROSEED: _bindgen_ty_1 = 597;
pub const NATIONAL_DEX_FERROTHORN: _bindgen_ty_1 = 598;
pub const NATIONAL_DEX_KLINK: _bindgen_ty_1 = 599;
pub const NATIONAL_DEX_KLANG: _bindgen_ty_1 = 600;
pub const NATIONAL_DEX_KLINKLANG: _bindgen_ty_1 = 601;
pub const NATIONAL_DEX_TYNAMO: _bindgen_ty_1 = 602;
pub const NATIONAL_DEX_EELEKTRIK: _bindgen_ty_1 = 603;
pub const NATIONAL_DEX_EELEKTROSS: _bindgen_ty_1 = 604;
pub const NATIONAL_DEX_ELGYEM: _bindgen_ty_1 = 605;
pub const NATIONAL_DEX_BEHEEYEM: _bindgen_ty_1 = 606;
pub const NATIONAL_DEX_LITWICK: _bindgen_ty_1 = 607;
pub const NATIONAL_DEX_LAMPENT: _bindgen_ty_1 = 608;
pub const NATIONAL_DEX_CHANDELURE: _bindgen_ty_1 = 609;
pub const NATIONAL_DEX_AXEW: _bindgen_ty_1 = 610;
pub const NATIONAL_DEX_FRAXURE: _bindgen_ty_1 = 611;
pub const NATIONAL_DEX_HAXORUS: _bindgen_ty_1 = 612;
pub const NATIONAL_DEX_CUBCHOO: _bindgen_ty_1 = 613;
pub const NATIONAL_DEX_BEARTIC: _bindgen_ty_1 = 614;
pub const NATIONAL_DEX_CRYOGONAL: _bindgen_ty_1 = 615;
pub const NATIONAL_DEX_SHELMET: _bindgen_ty_1 = 616;
pub const NATIONAL_DEX_ACCELGOR: _bindgen_ty_1 = 617;
pub const NATIONAL_DEX_STUNFISK: _bindgen_ty_1 = 618;
pub const NATIONAL_DEX_MIENFOO: _bindgen_ty_1 = 619;
pub const NATIONAL_DEX_MIENSHAO: _bindgen_ty_1 = 620;
pub const NATIONAL_DEX_DRUDDIGON: _bindgen_ty_1 = 621;
pub const NATIONAL_DEX_GOLETT: _bindgen_ty_1 = 622;
pub const NATIONAL_DEX_GOLURK: _bindgen_ty_1 = 623;
pub const NATIONAL_DEX_PAWNIARD: _bindgen_ty_1 = 624;
pub const NATIONAL_DEX_BISHARP: _bindgen_ty_1 = 625;
pub const NATIONAL_DEX_BOUFFALANT: _bindgen_ty_1 = 626;
pub const NATIONAL_DEX_RUFFLET: _bindgen_ty_1 = 627;
pub const NATIONAL_DEX_BRAVIARY: _bindgen_ty_1 = 628;
pub const NATIONAL_DEX_VULLABY: _bindgen_ty_1 = 629;
pub const NATIONAL_DEX_MANDIBUZZ: _bindgen_ty_1 = 630;
pub const NATIONAL_DEX_HEATMOR: _bindgen_ty_1 = 631;
pub const NATIONAL_DEX_DURANT: _bindgen_ty_1 = 632;
pub const NATIONAL_DEX_DEINO: _bindgen_ty_1 = 633;
pub const NATIONAL_DEX_ZWEILOUS: _bindgen_ty_1 = 634;
pub const NATIONAL_DEX_HYDREIGON: _bindgen_ty_1 = 635;
pub const NATIONAL_DEX_LARVESTA: _bindgen_ty_1 = 636;
pub const NATIONAL_DEX_VOLCARONA: _bindgen_ty_1 = 637;
pub const NATIONAL_DEX_COBALION: _bindgen_ty_1 = 638;
pub const NATIONAL_DEX_TERRAKION: _bindgen_ty_1 = 639;
pub const NATIONAL_DEX_VIRIZION: _bindgen_ty_1 = 640;
pub const NATIONAL_DEX_TORNADUS: _bindgen_ty_1 = 641;
pub const NATIONAL_DEX_THUNDURUS: _bindgen_ty_1 = 642;
pub const NATIONAL_DEX_RESHIRAM: _bindgen_ty_1 = 643;
pub const NATIONAL_DEX_ZEKROM: _bindgen_ty_1 = 644;
pub const NATIONAL_DEX_LANDORUS: _bindgen_ty_1 = 645;
pub const NATIONAL_DEX_KYUREM: _bindgen_ty_1 = 646;
pub const NATIONAL_DEX_KELDEO: _bindgen_ty_1 = 647;
pub const NATIONAL_DEX_MELOETTA: _bindgen_ty_1 = 648;
pub const NATIONAL_DEX_GENESECT: _bindgen_ty_1 = 649;
pub const NATIONAL_DEX_CHESPIN: _bindgen_ty_1 = 650;
pub const NATIONAL_DEX_QUILLADIN: _bindgen_ty_1 = 651;
pub const NATIONAL_DEX_CHESNAUGHT: _bindgen_ty_1 = 652;
pub const NATIONAL_DEX_FENNEKIN: _bindgen_ty_1 = 653;
pub const NATIONAL_DEX_BRAIXEN: _bindgen_ty_1 = 654;
pub const NATIONAL_DEX_DELPHOX: _bindgen_ty_1 = 655;
pub const NATIONAL_DEX_FROAKIE: _bindgen_ty_1 = 656;
pub const NATIONAL_DEX_FROGADIER: _bindgen_ty_1 = 657;
pub const NATIONAL_DEX_GRENINJA: _bindgen_ty_1 = 658;
pub const NATIONAL_DEX_BUNNELBY: _bindgen_ty_1 = 659;
pub const NATIONAL_DEX_DIGGERSBY: _bindgen_ty_1 = 660;
pub const NATIONAL_DEX_FLETCHLING: _bindgen_ty_1 = 661;
pub const NATIONAL_DEX_FLETCHINDER: _bindgen_ty_1 = 662;
pub const NATIONAL_DEX_TALONFLAME: _bindgen_ty_1 = 663;
pub const NATIONAL_DEX_SCATTERBUG: _bindgen_ty_1 = 664;
pub const NATIONAL_DEX_SPEWPA: _bindgen_ty_1 = 665;
pub const NATIONAL_DEX_VIVILLON: _bindgen_ty_1 = 666;
pub const NATIONAL_DEX_LITLEO: _bindgen_ty_1 = 667;
pub const NATIONAL_DEX_PYROAR: _bindgen_ty_1 = 668;
pub const NATIONAL_DEX_FLABEBE: _bindgen_ty_1 = 669;
pub const NATIONAL_DEX_FLOETTE: _bindgen_ty_1 = 670;
pub const NATIONAL_DEX_FLORGES: _bindgen_ty_1 = 671;
pub const NATIONAL_DEX_SKIDDO: _bindgen_ty_1 = 672;
pub const NATIONAL_DEX_GOGOAT: _bindgen_ty_1 = 673;
pub const NATIONAL_DEX_PANCHAM: _bindgen_ty_1 = 674;
pub const NATIONAL_DEX_PANGORO: _bindgen_ty_1 = 675;
pub const NATIONAL_DEX_FURFROU: _bindgen_ty_1 = 676;
pub const NATIONAL_DEX_ESPURR: _bindgen_ty_1 = 677;
pub const NATIONAL_DEX_MEOWSTIC: _bindgen_ty_1 = 678;
pub const NATIONAL_DEX_HONEDGE: _bindgen_ty_1 = 679;
pub const NATIONAL_DEX_DOUBLADE: _bindgen_ty_1 = 680;
pub const NATIONAL_DEX_AEGISLASH: _bindgen_ty_1 = 681;
pub const NATIONAL_DEX_SPRITZEE: _bindgen_ty_1 = 682;
pub const NATIONAL_DEX_AROMATISSE: _bindgen_ty_1 = 683;
pub const NATIONAL_DEX_SWIRLIX: _bindgen_ty_1 = 684;
pub const NATIONAL_DEX_SLURPUFF: _bindgen_ty_1 = 685;
pub const NATIONAL_DEX_INKAY: _bindgen_ty_1 = 686;
pub const NATIONAL_DEX_MALAMAR: _bindgen_ty_1 = 687;
pub const NATIONAL_DEX_BINACLE: _bindgen_ty_1 = 688;
pub const NATIONAL_DEX_BARBARACLE: _bindgen_ty_1 = 689;
pub const NATIONAL_DEX_SKRELP: _bindgen_ty_1 = 690;
pub const NATIONAL_DEX_DRAGALGE: _bindgen_ty_1 = 691;
pub const NATIONAL_DEX_CLAUNCHER: _bindgen_ty_1 = 692;
pub const NATIONAL_DEX_CLAWITZER: _bindgen_ty_1 = 693;
pub const NATIONAL_DEX_HELIOPTILE: _bindgen_ty_1 = 694;
pub const NATIONAL_DEX_HELIOLISK: _bindgen_ty_1 = 695;
pub const NATIONAL_DEX_TYRUNT: _bindgen_ty_1 = 696;
pub const NATIONAL_DEX_TYRANTRUM: _bindgen_ty_1 = 697;
pub const NATIONAL_DEX_AMAURA: _bindgen_ty_1 = 698;
pub const NATIONAL_DEX_AURORUS: _bindgen_ty_1 = 699;
pub const NATIONAL_DEX_SYLVEON: _bindgen_ty_1 = 700;
pub const NATIONAL_DEX_HAWLUCHA: _bindgen_ty_1 = 701;
pub const NATIONAL_DEX_DEDENNE: _bindgen_ty_1 = 702;
pub const NATIONAL_DEX_CARBINK: _bindgen_ty_1 = 703;
pub const NATIONAL_DEX_GOOMY: _bindgen_ty_1 = 704;
pub const NATIONAL_DEX_SLIGGOO: _bindgen_ty_1 = 705;
pub const NATIONAL_DEX_GOODRA: _bindgen_ty_1 = 706;
pub const NATIONAL_DEX_KLEFKI: _bindgen_ty_1 = 707;
pub const NATIONAL_DEX_PHANTUMP: _bindgen_ty_1 = 708;
pub const NATIONAL_DEX_TREVENANT: _bindgen_ty_1 = 709;
pub const NATIONAL_DEX_PUMPKABOO: _bindgen_ty_1 = 710;
pub const NATIONAL_DEX_GOURGEIST: _bindgen_ty_1 = 711;
pub const NATIONAL_DEX_BERGMITE: _bindgen_ty_1 = 712;
pub const NATIONAL_DEX_AVALUGG: _bindgen_ty_1 = 713;
pub const NATIONAL_DEX_NOIBAT: _bindgen_ty_1 = 714;
pub const NATIONAL_DEX_NOIVERN: _bindgen_ty_1 = 715;
pub const NATIONAL_DEX_XERNEAS: _bindgen_ty_1 = 716;
pub const NATIONAL_DEX_YVELTAL: _bindgen_ty_1 = 717;
pub const NATIONAL_DEX_ZYGARDE: _bindgen_ty_1 = 718;
pub const NATIONAL_DEX_DIANCIE: _bindgen_ty_1 = 719;
pub const NATIONAL_DEX_HOOPA: _bindgen_ty_1 = 720;
pub const NATIONAL_DEX_VOLCANION: _bindgen_ty_1 = 721;
pub const NATIONAL_DEX_ROWLET: _bindgen_ty_1 = 722;
pub const NATIONAL_DEX_DARTRIX: _bindgen_ty_1 = 723;
pub const NATIONAL_DEX_DECIDUEYE: _bindgen_ty_1 = 724;
pub const NATIONAL_DEX_LITTEN: _bindgen_ty_1 = 725;
pub const NATIONAL_DEX_TORRACAT: _bindgen_ty_1 = 726;
pub const NATIONAL_DEX_INCINEROAR: _bindgen_ty_1 = 727;
pub const NATIONAL_DEX_POPPLIO: _bindgen_ty_1 = 728;
pub const NATIONAL_DEX_BRIONNE: _bindgen_ty_1 = 729;
pub const NATIONAL_DEX_PRIMARINA: _bindgen_ty_1 = 730;
pub const NATIONAL_DEX_PIKIPEK: _bindgen_ty_1 = 731;
pub const NATIONAL_DEX_TRUMBEAK: _bindgen_ty_1 = 732;
pub const NATIONAL_DEX_TOUCANNON: _bindgen_ty_1 = 733;
pub const NATIONAL_DEX_YUNGOOS: _bindgen_ty_1 = 734;
pub const NATIONAL_DEX_GUMSHOOS: _bindgen_ty_1 = 735;
pub const NATIONAL_DEX_GRUBBIN: _bindgen_ty_1 = 736;
pub const NATIONAL_DEX_CHARJABUG: _bindgen_ty_1 = 737;
pub const NATIONAL_DEX_VIKAVOLT: _bindgen_ty_1 = 738;
pub const NATIONAL_DEX_CRABRAWLER: _bindgen_ty_1 = 739;
pub const NATIONAL_DEX_CRABOMINABLE: _bindgen_ty_1 = 740;
pub const NATIONAL_DEX_ORICORIO: _bindgen_ty_1 = 741;
pub const NATIONAL_DEX_CUTIEFLY: _bindgen_ty_1 = 742;
pub const NATIONAL_DEX_RIBOMBEE: _bindgen_ty_1 = 743;
pub const NATIONAL_DEX_ROCKRUFF: _bindgen_ty_1 = 744;
pub const NATIONAL_DEX_LYCANROC: _bindgen_ty_1 = 745;
pub const NATIONAL_DEX_WISHIWASHI: _bindgen_ty_1 = 746;
pub const NATIONAL_DEX_MAREANIE: _bindgen_ty_1 = 747;
pub const NATIONAL_DEX_TOXAPEX: _bindgen_ty_1 = 748;
pub const NATIONAL_DEX_MUDBRAY: _bindgen_ty_1 = 749;
pub const NATIONAL_DEX_MUDSDALE: _bindgen_ty_1 = 750;
pub const NATIONAL_DEX_DEWPIDER: _bindgen_ty_1 = 751;
pub const NATIONAL_DEX_ARAQUANID: _bindgen_ty_1 = 752;
pub const NATIONAL_DEX_FOMANTIS: _bindgen_ty_1 = 753;
pub const NATIONAL_DEX_LURANTIS: _bindgen_ty_1 = 754;
pub const NATIONAL_DEX_MORELULL: _bindgen_ty_1 = 755;
pub const NATIONAL_DEX_SHIINOTIC: _bindgen_ty_1 = 756;
pub const NATIONAL_DEX_SALANDIT: _bindgen_ty_1 = 757;
pub const NATIONAL_DEX_SALAZZLE: _bindgen_ty_1 = 758;
pub const NATIONAL_DEX_STUFFUL: _bindgen_ty_1 = 759;
pub const NATIONAL_DEX_BEWEAR: _bindgen_ty_1 = 760;
pub const NATIONAL_DEX_BOUNSWEET: _bindgen_ty_1 = 761;
pub const NATIONAL_DEX_STEENEE: _bindgen_ty_1 = 762;
pub const NATIONAL_DEX_TSAREENA: _bindgen_ty_1 = 763;
pub const NATIONAL_DEX_COMFEY: _bindgen_ty_1 = 764;
pub const NATIONAL_DEX_ORANGURU: _bindgen_ty_1 = 765;
pub const NATIONAL_DEX_PASSIMIAN: _bindgen_ty_1 = 766;
pub const NATIONAL_DEX_WIMPOD: _bindgen_ty_1 = 767;
pub const NATIONAL_DEX_GOLISOPOD: _bindgen_ty_1 = 768;
pub const NATIONAL_DEX_SANDYGAST: _bindgen_ty_1 = 769;
pub const NATIONAL_DEX_PALOSSAND: _bindgen_ty_1 = 770;
pub const NATIONAL_DEX_PYUKUMUKU: _bindgen_ty_1 = 771;
pub const NATIONAL_DEX_TYPE_NULL: _bindgen_ty_1 = 772;
pub const NATIONAL_DEX_SILVALLY: _bindgen_ty_1 = 773;
pub const NATIONAL_DEX_MINIOR: _bindgen_ty_1 = 774;
pub const NATIONAL_DEX_KOMALA: _bindgen_ty_1 = 775;
pub const NATIONAL_DEX_TURTONATOR: _bindgen_ty_1 = 776;
pub const NATIONAL_DEX_TOGEDEMARU: _bindgen_ty_1 = 777;
pub const NATIONAL_DEX_MIMIKYU: _bindgen_ty_1 = 778;
pub const NATIONAL_DEX_BRUXISH: _bindgen_ty_1 = 779;
pub const NATIONAL_DEX_DRAMPA: _bindgen_ty_1 = 780;
pub const NATIONAL_DEX_DHELMISE: _bindgen_ty_1 = 781;
pub const NATIONAL_DEX_JANGMO_O: _bindgen_ty_1 = 782;
pub const NATIONAL_DEX_HAKAMO_O: _bindgen_ty_1 = 783;
pub const NATIONAL_DEX_KOMMO_O: _bindgen_ty_1 = 784;
pub const NATIONAL_DEX_TAPU_KOKO: _bindgen_ty_1 = 785;
pub const NATIONAL_DEX_TAPU_LELE: _bindgen_ty_1 = 786;
pub const NATIONAL_DEX_TAPU_BULU: _bindgen_ty_1 = 787;
pub const NATIONAL_DEX_TAPU_FINI: _bindgen_ty_1 = 788;
pub const NATIONAL_DEX_COSMOG: _bindgen_ty_1 = 789;
pub const NATIONAL_DEX_COSMOEM: _bindgen_ty_1 = 790;
pub const NATIONAL_DEX_SOLGALEO: _bindgen_ty_1 = 791;
pub const NATIONAL_DEX_LUNALA: _bindgen_ty_1 = 792;
pub const NATIONAL_DEX_NIHILEGO: _bindgen_ty_1 = 793;
pub const NATIONAL_DEX_BUZZWOLE: _bindgen_ty_1 = 794;
pub const NATIONAL_DEX_PHEROMOSA: _bindgen_ty_1 = 795;
pub const NATIONAL_DEX_XURKITREE: _bindgen_ty_1 = 796;
pub const NATIONAL_DEX_CELESTEELA: _bindgen_ty_1 = 797;
pub const NATIONAL_DEX_KARTANA: _bindgen_ty_1 = 798;
pub const NATIONAL_DEX_GUZZLORD: _bindgen_ty_1 = 799;
pub const NATIONAL_DEX_NECROZMA: _bindgen_ty_1 = 800;
pub const NATIONAL_DEX_MAGEARNA: _bindgen_ty_1 = 801;
pub const NATIONAL_DEX_MARSHADOW: _bindgen_ty_1 = 802;
pub const NATIONAL_DEX_POIPOLE: _bindgen_ty_1 = 803;
pub const NATIONAL_DEX_NAGANADEL: _bindgen_ty_1 = 804;
pub const NATIONAL_DEX_STAKATAKA: _bindgen_ty_1 = 805;
pub const NATIONAL_DEX_BLACEPHALON: _bindgen_ty_1 = 806;
pub const NATIONAL_DEX_ZERAORA: _bindgen_ty_1 = 807;
pub const NATIONAL_DEX_MELTAN: _bindgen_ty_1 = 808;
pub const NATIONAL_DEX_MELMETAL: _bindgen_ty_1 = 809;
pub const NATIONAL_DEX_GROOKEY: _bindgen_ty_1 = 810;
pub const NATIONAL_DEX_THWACKEY: _bindgen_ty_1 = 811;
pub const NATIONAL_DEX_RILLABOOM: _bindgen_ty_1 = 812;
pub const NATIONAL_DEX_SCORBUNNY: _bindgen_ty_1 = 813;
pub const NATIONAL_DEX_RABOOT: _bindgen_ty_1 = 814;
pub const NATIONAL_DEX_CINDERACE: _bindgen_ty_1 = 815;
pub const NATIONAL_DEX_SOBBLE: _bindgen_ty_1 = 816;
pub const NATIONAL_DEX_DRIZZILE: _bindgen_ty_1 = 817;
pub const NATIONAL_DEX_INTELEON: _bindgen_ty_1 = 818;
pub const NATIONAL_DEX_SKWOVET: _bindgen_ty_1 = 819;
pub const NATIONAL_DEX_GREEDENT: _bindgen_ty_1 = 820;
pub const NATIONAL_DEX_ROOKIDEE: _bindgen_ty_1 = 821;
pub const NATIONAL_DEX_CORVISQUIRE: _bindgen_ty_1 = 822;
pub const NATIONAL_DEX_CORVIKNIGHT: _bindgen_ty_1 = 823;
pub const NATIONAL_DEX_BLIPBUG: _bindgen_ty_1 = 824;
pub const NATIONAL_DEX_DOTTLER: _bindgen_ty_1 = 825;
pub const NATIONAL_DEX_ORBEETLE: _bindgen_ty_1 = 826;
pub const NATIONAL_DEX_NICKIT: _bindgen_ty_1 = 827;
pub const NATIONAL_DEX_THIEVUL: _bindgen_ty_1 = 828;
pub const NATIONAL_DEX_GOSSIFLEUR: _bindgen_ty_1 = 829;
pub const NATIONAL_DEX_ELDEGOSS: _bindgen_ty_1 = 830;
pub const NATIONAL_DEX_WOOLOO: _bindgen_ty_1 = 831;
pub const NATIONAL_DEX_DUBWOOL: _bindgen_ty_1 = 832;
pub const NATIONAL_DEX_CHEWTLE: _bindgen_ty_1 = 833;
pub const NATIONAL_DEX_DREDNAW: _bindgen_ty_1 = 834;
pub const NATIONAL_DEX_YAMPER: _bindgen_ty_1 = 835;
pub const NATIONAL_DEX_BOLTUND: _bindgen_ty_1 = 836;
pub const NATIONAL_DEX_ROLYCOLY: _bindgen_ty_1 = 837;
pub const NATIONAL_DEX_CARKOL: _bindgen_ty_1 = 838;
pub const NATIONAL_DEX_COALOSSAL: _bindgen_ty_1 = 839;
pub const NATIONAL_DEX_APPLIN: _bindgen_ty_1 = 840;
pub const NATIONAL_DEX_FLAPPLE: _bindgen_ty_1 = 841;
pub const NATIONAL_DEX_APPLETUN: _bindgen_ty_1 = 842;
pub const NATIONAL_DEX_SILICOBRA: _bindgen_ty_1 = 843;
pub const NATIONAL_DEX_SANDACONDA: _bindgen_ty_1 = 844;
pub const NATIONAL_DEX_CRAMORANT: _bindgen_ty_1 = 845;
pub const NATIONAL_DEX_ARROKUDA: _bindgen_ty_1 = 846;
pub const NATIONAL_DEX_BARRASKEWDA: _bindgen_ty_1 = 847;
pub const NATIONAL_DEX_TOXEL: _bindgen_ty_1 = 848;
pub const NATIONAL_DEX_TOXTRICITY: _bindgen_ty_1 = 849;
pub const NATIONAL_DEX_SIZZLIPEDE: _bindgen_ty_1 = 850;
pub const NATIONAL_DEX_CENTISKORCH: _bindgen_ty_1 = 851;
pub const NATIONAL_DEX_CLOBBOPUS: _bindgen_ty_1 = 852;
pub const NATIONAL_DEX_GRAPPLOCT: _bindgen_ty_1 = 853;
pub const NATIONAL_DEX_SINISTEA: _bindgen_ty_1 = 854;
pub const NATIONAL_DEX_POLTEAGEIST: _bindgen_ty_1 = 855;
pub const NATIONAL_DEX_HATENNA: _bindgen_ty_1 = 856;
pub const NATIONAL_DEX_HATTREM: _bindgen_ty_1 = 857;
pub const NATIONAL_DEX_HATTERENE: _bindgen_ty_1 = 858;
pub const NATIONAL_DEX_IMPIDIMP: _bindgen_ty_1 = 859;
pub const NATIONAL_DEX_MORGREM: _bindgen_ty_1 = 860;
pub const NATIONAL_DEX_GRIMMSNARL: _bindgen_ty_1 = 861;
pub const NATIONAL_DEX_OBSTAGOON: _bindgen_ty_1 = 862;
pub const NATIONAL_DEX_PERRSERKER: _bindgen_ty_1 = 863;
pub const NATIONAL_DEX_CURSOLA: _bindgen_ty_1 = 864;
pub const NATIONAL_DEX_SIRFETCHD: _bindgen_ty_1 = 865;
pub const NATIONAL_DEX_MR_RIME: _bindgen_ty_1 = 866;
pub const NATIONAL_DEX_RUNERIGUS: _bindgen_ty_1 = 867;
pub const NATIONAL_DEX_MILCERY: _bindgen_ty_1 = 868;
pub const NATIONAL_DEX_ALCREMIE: _bindgen_ty_1 = 869;
pub const NATIONAL_DEX_FALINKS: _bindgen_ty_1 = 870;
pub const NATIONAL_DEX_PINCURCHIN: _bindgen_ty_1 = 871;
pub const NATIONAL_DEX_SNOM: _bindgen_ty_1 = 872;
pub const NATIONAL_DEX_FROSMOTH: _bindgen_ty_1 = 873;
pub const NATIONAL_DEX_STONJOURNER: _bindgen_ty_1 = 874;
pub const NATIONAL_DEX_EISCUE: _bindgen_ty_1 = 875;
pub const NATIONAL_DEX_INDEEDEE: _bindgen_ty_1 = 876;
pub const NATIONAL_DEX_MORPEKO: _bindgen_ty_1 = 877;
pub const NATIONAL_DEX_CUFANT: _bindgen_ty_1 = 878;
pub const NATIONAL_DEX_COPPERAJAH: _bindgen_ty_1 = 879;
pub const NATIONAL_DEX_DRACOZOLT: _bindgen_ty_1 = 880;
pub const NATIONAL_DEX_ARCTOZOLT: _bindgen_ty_1 = 881;
pub const NATIONAL_DEX_DRACOVISH: _bindgen_ty_1 = 882;
pub const NATIONAL_DEX_ARCTOVISH: _bindgen_ty_1 = 883;
pub const NATIONAL_DEX_DURALUDON: _bindgen_ty_1 = 884;
pub const NATIONAL_DEX_DREEPY: _bindgen_ty_1 = 885;
pub const NATIONAL_DEX_DRAKLOAK: _bindgen_ty_1 = 886;
pub const NATIONAL_DEX_DRAGAPULT: _bindgen_ty_1 = 887;
pub const NATIONAL_DEX_ZACIAN: _bindgen_ty_1 = 888;
pub const NATIONAL_DEX_ZAMAZENTA: _bindgen_ty_1 = 889;
pub const NATIONAL_DEX_ETERNATUS: _bindgen_ty_1 = 890;
pub const NATIONAL_DEX_KUBFU: _bindgen_ty_1 = 891;
pub const NATIONAL_DEX_URSHIFU: _bindgen_ty_1 = 892;
pub const NATIONAL_DEX_ZARUDE: _bindgen_ty_1 = 893;
pub const NATIONAL_DEX_REGIELEKI: _bindgen_ty_1 = 894;
pub const NATIONAL_DEX_REGIDRAGO: _bindgen_ty_1 = 895;
pub const NATIONAL_DEX_GLASTRIER: _bindgen_ty_1 = 896;
pub const NATIONAL_DEX_SPECTRIER: _bindgen_ty_1 = 897;
pub const NATIONAL_DEX_CALYREX: _bindgen_ty_1 = 898;
pub const NATIONAL_DEX_WYRDEER: _bindgen_ty_1 = 899;
pub const NATIONAL_DEX_KLEAVOR: _bindgen_ty_1 = 900;
pub const NATIONAL_DEX_URSALUNA: _bindgen_ty_1 = 901;
pub const NATIONAL_DEX_BASCULEGION: _bindgen_ty_1 = 902;
pub const NATIONAL_DEX_SNEASLER: _bindgen_ty_1 = 903;
pub const NATIONAL_DEX_OVERQWIL: _bindgen_ty_1 = 904;
pub const NATIONAL_DEX_ENAMORUS: _bindgen_ty_1 = 905;
pub const NATIONAL_DEX_ANNIHILAPE: _bindgen_ty_1 = 906;
pub const NATIONAL_DEX_FARIGIRAF: _bindgen_ty_1 = 907;
pub const NATIONAL_DEX_DUDUNSPARCE: _bindgen_ty_1 = 908;
pub const NATIONAL_DEX_KINGAMBIT: _bindgen_ty_1 = 909;
pub const NATIONAL_DEX_DIPPLIN: _bindgen_ty_1 = 910;
pub const NATIONAL_DEX_HYDRAPPLE: _bindgen_ty_1 = 911;
pub const NATIONAL_DEX_ARCHALUDON: _bindgen_ty_1 = 912;
pub const NATIONAL_DEX_SPRIGATITO: _bindgen_ty_1 = 913;
pub const NATIONAL_DEX_FLORAGATO: _bindgen_ty_1 = 914;
pub const NATIONAL_DEX_MEOWSCARADA: _bindgen_ty_1 = 915;
pub const NATIONAL_DEX_FUECOCO: _bindgen_ty_1 = 916;
pub const NATIONAL_DEX_CROCALOR: _bindgen_ty_1 = 917;
pub const NATIONAL_DEX_SKELEDIRGE: _bindgen_ty_1 = 918;
pub const NATIONAL_DEX_QUAXLY: _bindgen_ty_1 = 919;
pub const NATIONAL_DEX_QUAXWELL: _bindgen_ty_1 = 920;
pub const NATIONAL_DEX_QUAQUAVAL: _bindgen_ty_1 = 921;
pub const NATIONAL_DEX_LECHONK: _bindgen_ty_1 = 922;
pub const NATIONAL_DEX_OINKOLOGNE: _bindgen_ty_1 = 923;
pub const NATIONAL_DEX_TAROUNTULA: _bindgen_ty_1 = 924;
pub const NATIONAL_DEX_SPIDOPS: _bindgen_ty_1 = 925;
pub const NATIONAL_DEX_NYMBLE: _bindgen_ty_1 = 926;
pub const NATIONAL_DEX_LOKIX: _bindgen_ty_1 = 927;
pub const NATIONAL_DEX_PAWMI: _bindgen_ty_1 = 928;
pub const NATIONAL_DEX_PAWMO: _bindgen_ty_1 = 929;
pub const NATIONAL_DEX_PAWMOT: _bindgen_ty_1 = 930;
pub const NATIONAL_DEX_TANDEMAUS: _bindgen_ty_1 = 931;
pub const NATIONAL_DEX_MAUSHOLD: _bindgen_ty_1 = 932;
pub const NATIONAL_DEX_FIDOUGH: _bindgen_ty_1 = 933;
pub const NATIONAL_DEX_DACHSBUN: _bindgen_ty_1 = 934;
pub const NATIONAL_DEX_SMOLIV: _bindgen_ty_1 = 935;
pub const NATIONAL_DEX_DOLLIV: _bindgen_ty_1 = 936;
pub const NATIONAL_DEX_ARBOLIVA: _bindgen_ty_1 = 937;
pub const NATIONAL_DEX_SQUAWKABILLY: _bindgen_ty_1 = 938;
pub const NATIONAL_DEX_NACLI: _bindgen_ty_1 = 939;
pub const NATIONAL_DEX_NACLSTACK: _bindgen_ty_1 = 940;
pub const NATIONAL_DEX_GARGANACL: _bindgen_ty_1 = 941;
pub const NATIONAL_DEX_CHARCADET: _bindgen_ty_1 = 942;
pub const NATIONAL_DEX_ARMAROUGE: _bindgen_ty_1 = 943;
pub const NATIONAL_DEX_CERULEDGE: _bindgen_ty_1 = 944;
pub const NATIONAL_DEX_TADBULB: _bindgen_ty_1 = 945;
pub const NATIONAL_DEX_BELLIBOLT: _bindgen_ty_1 = 946;
pub const NATIONAL_DEX_WATTREL: _bindgen_ty_1 = 947;
pub const NATIONAL_DEX_KILOWATTREL: _bindgen_ty_1 = 948;
pub const NATIONAL_DEX_MASCHIFF: _bindgen_ty_1 = 949;
pub const NATIONAL_DEX_MABOSSTIFF: _bindgen_ty_1 = 950;
pub const NATIONAL_DEX_SHROODLE: _bindgen_ty_1 = 951;
pub const NATIONAL_DEX_GRAFAIAI: _bindgen_ty_1 = 952;
pub const NATIONAL_DEX_BRAMBLIN: _bindgen_ty_1 = 953;
pub const NATIONAL_DEX_BRAMBLEGHAST: _bindgen_ty_1 = 954;
pub const NATIONAL_DEX_TOEDSCOOL: _bindgen_ty_1 = 955;
pub const NATIONAL_DEX_TOEDSCRUEL: _bindgen_ty_1 = 956;
pub const NATIONAL_DEX_KLAWF: _bindgen_ty_1 = 957;
pub const NATIONAL_DEX_CAPSAKID: _bindgen_ty_1 = 958;
pub const NATIONAL_DEX_SCOVILLAIN: _bindgen_ty_1 = 959;
pub const NATIONAL_DEX_RELLOR: _bindgen_ty_1 = 960;
pub const NATIONAL_DEX_RABSCA: _bindgen_ty_1 = 961;
pub const NATIONAL_DEX_FLITTLE: _bindgen_ty_1 = 962;
pub const NATIONAL_DEX_ESPATHRA: _bindgen_ty_1 = 963;
pub const NATIONAL_DEX_TINKATINK: _bindgen_ty_1 = 964;
pub const NATIONAL_DEX_TINKATUFF: _bindgen_ty_1 = 965;
pub const NATIONAL_DEX_TINKATON: _bindgen_ty_1 = 966;
pub const NATIONAL_DEX_WIGLETT: _bindgen_ty_1 = 967;
pub const NATIONAL_DEX_WUGTRIO: _bindgen_ty_1 = 968;
pub const NATIONAL_DEX_BOMBIRDIER: _bindgen_ty_1 = 969;
pub const NATIONAL_DEX_FINIZEN: _bindgen_ty_1 = 970;
pub const NATIONAL_DEX_PALAFIN: _bindgen_ty_1 = 971;
pub const NATIONAL_DEX_VAROOM: _bindgen_ty_1 = 972;
pub const NATIONAL_DEX_REVAVROOM: _bindgen_ty_1 = 973;
pub const NATIONAL_DEX_CYCLIZAR: _bindgen_ty_1 = 974;
pub const NATIONAL_DEX_ORTHWORM: _bindgen_ty_1 = 975;
pub const NATIONAL_DEX_GLIMMET: _bindgen_ty_1 = 976;
pub const NATIONAL_DEX_GLIMMORA: _bindgen_ty_1 = 977;
pub const NATIONAL_DEX_GREAVARD: _bindgen_ty_1 = 978;
pub const NATIONAL_DEX_HOUNDSTONE: _bindgen_ty_1 = 979;
pub const NATIONAL_DEX_FLAMIGO: _bindgen_ty_1 = 980;
pub const NATIONAL_DEX_CETODDLE: _bindgen_ty_1 = 981;
pub const NATIONAL_DEX_CETITAN: _bindgen_ty_1 = 982;
pub const NATIONAL_DEX_VELUZA: _bindgen_ty_1 = 983;
pub const NATIONAL_DEX_DONDOZO: _bindgen_ty_1 = 984;
pub const NATIONAL_DEX_TATSUGIRI: _bindgen_ty_1 = 985;
pub const NATIONAL_DEX_CLODSIRE: _bindgen_ty_1 = 986;
pub const NATIONAL_DEX_GREAT_TUSK: _bindgen_ty_1 = 987;
pub const NATIONAL_DEX_SCREAM_TAIL: _bindgen_ty_1 = 988;
pub const NATIONAL_DEX_BRUTE_BONNET: _bindgen_ty_1 = 989;
pub const NATIONAL_DEX_FLUTTER_MANE: _bindgen_ty_1 = 990;
pub const NATIONAL_DEX_SLITHER_WING: _bindgen_ty_1 = 991;
pub const NATIONAL_DEX_SANDY_SHOCKS: _bindgen_ty_1 = 992;
pub const NATIONAL_DEX_IRON_TREADS: _bindgen_ty_1 = 993;
pub const NATIONAL_DEX_IRON_BUNDLE: _bindgen_ty_1 = 994;
pub const NATIONAL_DEX_IRON_HANDS: _bindgen_ty_1 = 995;
pub const NATIONAL_DEX_IRON_JUGULIS: _bindgen_ty_1 = 996;
pub const NATIONAL_DEX_IRON_MOTH: _bindgen_ty_1 = 997;
pub const NATIONAL_DEX_IRON_THORNS: _bindgen_ty_1 = 998;
pub const NATIONAL_DEX_FRIGIBAX: _bindgen_ty_1 = 999;
pub const NATIONAL_DEX_ARCTIBAX: _bindgen_ty_1 = 1000;
pub const NATIONAL_DEX_BAXCALIBUR: _bindgen_ty_1 = 1001;
pub const NATIONAL_DEX_GIMMIGHOUL: _bindgen_ty_1 = 1002;
pub const NATIONAL_DEX_GHOLDENGO: _bindgen_ty_1 = 1003;
pub const NATIONAL_DEX_WO_CHIEN: _bindgen_ty_1 = 1004;
pub const NATIONAL_DEX_CHIEN_PAO: _bindgen_ty_1 = 1005;
pub const NATIONAL_DEX_TING_LU: _bindgen_ty_1 = 1006;
pub const NATIONAL_DEX_CHI_YU: _bindgen_ty_1 = 1007;
pub const NATIONAL_DEX_ROARING_MOON: _bindgen_ty_1 = 1008;
pub const NATIONAL_DEX_IRON_VALIANT: _bindgen_ty_1 = 1009;
pub const NATIONAL_DEX_KORAIDON: _bindgen_ty_1 = 1010;
pub const NATIONAL_DEX_MIRAIDON: _bindgen_ty_1 = 1011;
pub const NATIONAL_DEX_WALKING_WAKE: _bindgen_ty_1 = 1012;
pub const NATIONAL_DEX_IRON_LEAVES: _bindgen_ty_1 = 1013;
pub const NATIONAL_DEX_POLTCHAGEIST: _bindgen_ty_1 = 1014;
pub const NATIONAL_DEX_SINISTCHA: _bindgen_ty_1 = 1015;
pub const NATIONAL_DEX_OKIDOGI: _bindgen_ty_1 = 1016;
pub const NATIONAL_DEX_MUNKIDORI: _bindgen_ty_1 = 1017;
pub const NATIONAL_DEX_FEZANDIPITI: _bindgen_ty_1 = 1018;
pub const NATIONAL_DEX_OGERPON: _bindgen_ty_1 = 1019;
pub const NATIONAL_DEX_GOUGING_FIRE: _bindgen_ty_1 = 1020;
pub const NATIONAL_DEX_RAGING_BOLT: _bindgen_ty_1 = 1021;
pub const NATIONAL_DEX_IRON_BOULDER: _bindgen_ty_1 = 1022;
pub const NATIONAL_DEX_IRON_CROWN: _bindgen_ty_1 = 1023;
pub const NATIONAL_DEX_TERAPAGOS: _bindgen_ty_1 = 1024;
pub const NATIONAL_DEX_PECHARUNT: _bindgen_ty_1 = 1025;
pub type _bindgen_ty_1 = ::std::os::raw::c_int;
pub const HOENN_DEX_NONE: _bindgen_ty_2 = 0;
pub const HOENN_DEX_TREECKO: _bindgen_ty_2 = 1;
pub const HOENN_DEX_GROVYLE: _bindgen_ty_2 = 2;
pub const HOENN_DEX_SCEPTILE: _bindgen_ty_2 = 3;
pub const HOENN_DEX_TORCHIC: _bindgen_ty_2 = 4;
pub const HOENN_DEX_COMBUSKEN: _bindgen_ty_2 = 5;
pub const HOENN_DEX_BLAZIKEN: _bindgen_ty_2 = 6;
pub const HOENN_DEX_MUDKIP: _bindgen_ty_2 = 7;
pub const HOENN_DEX_MARSHTOMP: _bindgen_ty_2 = 8;
pub const HOENN_DEX_SWAMPERT: _bindgen_ty_2 = 9;
pub const HOENN_DEX_POOCHYENA: _bindgen_ty_2 = 10;
pub const HOENN_DEX_MIGHTYENA: _bindgen_ty_2 = 11;
pub const HOENN_DEX_ZIGZAGOON: _bindgen_ty_2 = 12;
pub const HOENN_DEX_LINOONE: _bindgen_ty_2 = 13;
pub const HOENN_DEX_OBSTAGOON: _bindgen_ty_2 = 14;
pub const HOENN_DEX_WURMPLE: _bindgen_ty_2 = 15;
pub const HOENN_DEX_SILCOON: _bindgen_ty_2 = 16;
pub const HOENN_DEX_BEAUTIFLY: _bindgen_ty_2 = 17;
pub const HOENN_DEX_CASCOON: _bindgen_ty_2 = 18;
pub const HOENN_DEX_DUSTOX: _bindgen_ty_2 = 19;
pub const HOENN_DEX_LOTAD: _bindgen_ty_2 = 20;
pub const HOENN_DEX_LOMBRE: _bindgen_ty_2 = 21;
pub const HOENN_DEX_LUDICOLO: _bindgen_ty_2 = 22;
pub const HOENN_DEX_SEEDOT: _bindgen_ty_2 = 23;
pub const HOENN_DEX_NUZLEAF: _bindgen_ty_2 = 24;
pub const HOENN_DEX_SHIFTRY: _bindgen_ty_2 = 25;
pub const HOENN_DEX_TAILLOW: _bindgen_ty_2 = 26;
pub const HOENN_DEX_SWELLOW: _bindgen_ty_2 = 27;
pub const HOENN_DEX_WINGULL: _bindgen_ty_2 = 28;
pub const HOENN_DEX_PELIPPER: _bindgen_ty_2 = 29;
pub const HOENN_DEX_RALTS: _bindgen_ty_2 = 30;
pub const HOENN_DEX_KIRLIA: _bindgen_ty_2 = 31;
pub const HOENN_DEX_GARDEVOIR: _bindgen_ty_2 = 32;
pub const HOENN_DEX_GALLADE: _bindgen_ty_2 = 33;
pub const HOENN_DEX_SURSKIT: _bindgen_ty_2 = 34;
pub const HOENN_DEX_MASQUERAIN: _bindgen_ty_2 = 35;
pub const HOENN_DEX_SHROOMISH: _bindgen_ty_2 = 36;
pub const HOENN_DEX_BRELOOM: _bindgen_ty_2 = 37;
pub const HOENN_DEX_SLAKOTH: _bindgen_ty_2 = 38;
pub const HOENN_DEX_VIGOROTH: _bindgen_ty_2 = 39;
pub const HOENN_DEX_SLAKING: _bindgen_ty_2 = 40;
pub const HOENN_DEX_ABRA: _bindgen_ty_2 = 41;
pub const HOENN_DEX_KADABRA: _bindgen_ty_2 = 42;
pub const HOENN_DEX_ALAKAZAM: _bindgen_ty_2 = 43;
pub const HOENN_DEX_NINCADA: _bindgen_ty_2 = 44;
pub const HOENN_DEX_NINJASK: _bindgen_ty_2 = 45;
pub const HOENN_DEX_SHEDINJA: _bindgen_ty_2 = 46;
pub const HOENN_DEX_WHISMUR: _bindgen_ty_2 = 47;
pub const HOENN_DEX_LOUDRED: _bindgen_ty_2 = 48;
pub const HOENN_DEX_EXPLOUD: _bindgen_ty_2 = 49;
pub const HOENN_DEX_MAKUHITA: _bindgen_ty_2 = 50;
pub const HOENN_DEX_HARIYAMA: _bindgen_ty_2 = 51;
pub const HOENN_DEX_GOLDEEN: _bindgen_ty_2 = 52;
pub const HOENN_DEX_SEAKING: _bindgen_ty_2 = 53;
pub const HOENN_DEX_MAGIKARP: _bindgen_ty_2 = 54;
pub const HOENN_DEX_GYARADOS: _bindgen_ty_2 = 55;
pub const HOENN_DEX_AZURILL: _bindgen_ty_2 = 56;
pub const HOENN_DEX_MARILL: _bindgen_ty_2 = 57;
pub const HOENN_DEX_AZUMARILL: _bindgen_ty_2 = 58;
pub const HOENN_DEX_GEODUDE: _bindgen_ty_2 = 59;
pub const HOENN_DEX_GRAVELER: _bindgen_ty_2 = 60;
pub const HOENN_DEX_GOLEM: _bindgen_ty_2 = 61;
pub const HOENN_DEX_NOSEPASS: _bindgen_ty_2 = 62;
pub const HOENN_DEX_PROBOPASS: _bindgen_ty_2 = 63;
pub const HOENN_DEX_SKITTY: _bindgen_ty_2 = 64;
pub const HOENN_DEX_DELCATTY: _bindgen_ty_2 = 65;
pub const HOENN_DEX_ZUBAT: _bindgen_ty_2 = 66;
pub const HOENN_DEX_GOLBAT: _bindgen_ty_2 = 67;
pub const HOENN_DEX_CROBAT: _bindgen_ty_2 = 68;
pub const HOENN_DEX_TENTACOOL: _bindgen_ty_2 = 69;
pub const HOENN_DEX_TENTACRUEL: _bindgen_ty_2 = 70;
pub const HOENN_DEX_SABLEYE: _bindgen_ty_2 = 71;
pub const HOENN_DEX_MAWILE: _bindgen_ty_2 = 72;
pub const HOENN_DEX_ARON: _bindgen_ty_2 = 73;
pub const HOENN_DEX_LAIRON: _bindgen_ty_2 = 74;
pub const HOENN_DEX_AGGRON: _bindgen_ty_2 = 75;
pub const HOENN_DEX_MACHOP: _bindgen_ty_2 = 76;
pub const HOENN_DEX_MACHOKE: _bindgen_ty_2 = 77;
pub const HOENN_DEX_MACHAMP: _bindgen_ty_2 = 78;
pub const HOENN_DEX_MEDITITE: _bindgen_ty_2 = 79;
pub const HOENN_DEX_MEDICHAM: _bindgen_ty_2 = 80;
pub const HOENN_DEX_ELECTRIKE: _bindgen_ty_2 = 81;
pub const HOENN_DEX_MANECTRIC: _bindgen_ty_2 = 82;
pub const HOENN_DEX_PLUSLE: _bindgen_ty_2 = 83;
pub const HOENN_DEX_MINUN: _bindgen_ty_2 = 84;
pub const HOENN_DEX_MAGNEMITE: _bindgen_ty_2 = 85;
pub const HOENN_DEX_MAGNETON: _bindgen_ty_2 = 86;
pub const HOENN_DEX_MAGNEZONE: _bindgen_ty_2 = 87;
pub const HOENN_DEX_VOLTORB: _bindgen_ty_2 = 88;
pub const HOENN_DEX_ELECTRODE: _bindgen_ty_2 = 89;
pub const HOENN_DEX_VOLBEAT: _bindgen_ty_2 = 90;
pub const HOENN_DEX_ILLUMISE: _bindgen_ty_2 = 91;
pub const HOENN_DEX_ODDISH: _bindgen_ty_2 = 92;
pub const HOENN_DEX_GLOOM: _bindgen_ty_2 = 93;
pub const HOENN_DEX_VILEPLUME: _bindgen_ty_2 = 94;
pub const HOENN_DEX_BELLOSSOM: _bindgen_ty_2 = 95;
pub const HOENN_DEX_DODUO: _bindgen_ty_2 = 96;
pub const HOENN_DEX_DODRIO: _bindgen_ty_2 = 97;
pub const HOENN_DEX_BUDEW: _bindgen_ty_2 = 98;
pub const HOENN_DEX_ROSELIA: _bindgen_ty_2 = 99;
pub const HOENN_DEX_ROSERADE: _bindgen_ty_2 = 100;
pub const HOENN_DEX_GULPIN: _bindgen_ty_2 = 101;
pub const HOENN_DEX_SWALOT: _bindgen_ty_2 = 102;
pub const HOENN_DEX_CARVANHA: _bindgen_ty_2 = 103;
pub const HOENN_DEX_SHARPEDO: _bindgen_ty_2 = 104;
pub const HOENN_DEX_WAILMER: _bindgen_ty_2 = 105;
pub const HOENN_DEX_WAILORD: _bindgen_ty_2 = 106;
pub const HOENN_DEX_NUMEL: _bindgen_ty_2 = 107;
pub const HOENN_DEX_CAMERUPT: _bindgen_ty_2 = 108;
pub const HOENN_DEX_SLUGMA: _bindgen_ty_2 = 109;
pub const HOENN_DEX_MAGCARGO: _bindgen_ty_2 = 110;
pub const HOENN_DEX_TORKOAL: _bindgen_ty_2 = 111;
pub const HOENN_DEX_GRIMER: _bindgen_ty_2 = 112;
pub const HOENN_DEX_MUK: _bindgen_ty_2 = 113;
pub const HOENN_DEX_KOFFING: _bindgen_ty_2 = 114;
pub const HOENN_DEX_WEEZING: _bindgen_ty_2 = 115;
pub const HOENN_DEX_SPOINK: _bindgen_ty_2 = 116;
pub const HOENN_DEX_GRUMPIG: _bindgen_ty_2 = 117;
pub const HOENN_DEX_SANDSHREW: _bindgen_ty_2 = 118;
pub const HOENN_DEX_SANDSLASH: _bindgen_ty_2 = 119;
pub const HOENN_DEX_SPINDA: _bindgen_ty_2 = 120;
pub const HOENN_DEX_SKARMORY: _bindgen_ty_2 = 121;
pub const HOENN_DEX_TRAPINCH: _bindgen_ty_2 = 122;
pub const HOENN_DEX_VIBRAVA: _bindgen_ty_2 = 123;
pub const HOENN_DEX_FLYGON: _bindgen_ty_2 = 124;
pub const HOENN_DEX_CACNEA: _bindgen_ty_2 = 125;
pub const HOENN_DEX_CACTURNE: _bindgen_ty_2 = 126;
pub const HOENN_DEX_SWABLU: _bindgen_ty_2 = 127;
pub const HOENN_DEX_ALTARIA: _bindgen_ty_2 = 128;
pub const HOENN_DEX_ZANGOOSE: _bindgen_ty_2 = 129;
pub const HOENN_DEX_SEVIPER: _bindgen_ty_2 = 130;
pub const HOENN_DEX_LUNATONE: _bindgen_ty_2 = 131;
pub const HOENN_DEX_SOLROCK: _bindgen_ty_2 = 132;
pub const HOENN_DEX_BARBOACH: _bindgen_ty_2 = 133;
pub const HOENN_DEX_WHISCASH: _bindgen_ty_2 = 134;
pub const HOENN_DEX_CORPHISH: _bindgen_ty_2 = 135;
pub const HOENN_DEX_CRAWDAUNT: _bindgen_ty_2 = 136;
pub const HOENN_DEX_BALTOY: _bindgen_ty_2 = 137;
pub const HOENN_DEX_CLAYDOL: _bindgen_ty_2 = 138;
pub const HOENN_DEX_LILEEP: _bindgen_ty_2 = 139;
pub const HOENN_DEX_CRADILY: _bindgen_ty_2 = 140;
pub const HOENN_DEX_ANORITH: _bindgen_ty_2 = 141;
pub const HOENN_DEX_ARMALDO: _bindgen_ty_2 = 142;
pub const HOENN_DEX_IGGLYBUFF: _bindgen_ty_2 = 143;
pub const HOENN_DEX_JIGGLYPUFF: _bindgen_ty_2 = 144;
pub const HOENN_DEX_WIGGLYTUFF: _bindgen_ty_2 = 145;
pub const HOENN_DEX_FEEBAS: _bindgen_ty_2 = 146;
pub const HOENN_DEX_MILOTIC: _bindgen_ty_2 = 147;
pub const HOENN_DEX_CASTFORM: _bindgen_ty_2 = 148;
pub const HOENN_DEX_STARYU: _bindgen_ty_2 = 149;
pub const HOENN_DEX_STARMIE: _bindgen_ty_2 = 150;
pub const HOENN_DEX_KECLEON: _bindgen_ty_2 = 151;
pub const HOENN_DEX_SHUPPET: _bindgen_ty_2 = 152;
pub const HOENN_DEX_BANETTE: _bindgen_ty_2 = 153;
pub const HOENN_DEX_DUSKULL: _bindgen_ty_2 = 154;
pub const HOENN_DEX_DUSCLOPS: _bindgen_ty_2 = 155;
pub const HOENN_DEX_DUSKNOIR: _bindgen_ty_2 = 156;
pub const HOENN_DEX_TROPIUS: _bindgen_ty_2 = 157;
pub const HOENN_DEX_CHINGLING: _bindgen_ty_2 = 158;
pub const HOENN_DEX_CHIMECHO: _bindgen_ty_2 = 159;
pub const HOENN_DEX_ABSOL: _bindgen_ty_2 = 160;
pub const HOENN_DEX_VULPIX: _bindgen_ty_2 = 161;
pub const HOENN_DEX_NINETALES: _bindgen_ty_2 = 162;
pub const HOENN_DEX_PICHU: _bindgen_ty_2 = 163;
pub const HOENN_DEX_PIKACHU: _bindgen_ty_2 = 164;
pub const HOENN_DEX_RAICHU: _bindgen_ty_2 = 165;
pub const HOENN_DEX_PSYDUCK: _bindgen_ty_2 = 166;
pub const HOENN_DEX_GOLDUCK: _bindgen_ty_2 = 167;
pub const HOENN_DEX_WYNAUT: _bindgen_ty_2 = 168;
pub const HOENN_DEX_WOBBUFFET: _bindgen_ty_2 = 169;
pub const HOENN_DEX_NATU: _bindgen_ty_2 = 170;
pub const HOENN_DEX_XATU: _bindgen_ty_2 = 171;
pub const HOENN_DEX_GIRAFARIG: _bindgen_ty_2 = 172;
pub const HOENN_DEX_FARIGIRAF: _bindgen_ty_2 = 173;
pub const HOENN_DEX_PHANPY: _bindgen_ty_2 = 174;
pub const HOENN_DEX_DONPHAN: _bindgen_ty_2 = 175;
pub const HOENN_DEX_PINSIR: _bindgen_ty_2 = 176;
pub const HOENN_DEX_HERACROSS: _bindgen_ty_2 = 177;
pub const HOENN_DEX_RHYHORN: _bindgen_ty_2 = 178;
pub const HOENN_DEX_RHYDON: _bindgen_ty_2 = 179;
pub const HOENN_DEX_RHYPERIOR: _bindgen_ty_2 = 180;
pub const HOENN_DEX_SNORUNT: _bindgen_ty_2 = 181;
pub const HOENN_DEX_GLALIE: _bindgen_ty_2 = 182;
pub const HOENN_DEX_FROSLASS: _bindgen_ty_2 = 183;
pub const HOENN_DEX_SPHEAL: _bindgen_ty_2 = 184;
pub const HOENN_DEX_SEALEO: _bindgen_ty_2 = 185;
pub const HOENN_DEX_WALREIN: _bindgen_ty_2 = 186;
pub const HOENN_DEX_CLAMPERL: _bindgen_ty_2 = 187;
pub const HOENN_DEX_HUNTAIL: _bindgen_ty_2 = 188;
pub const HOENN_DEX_GOREBYSS: _bindgen_ty_2 = 189;
pub const HOENN_DEX_RELICANTH: _bindgen_ty_2 = 190;
pub const HOENN_DEX_CORSOLA: _bindgen_ty_2 = 191;
pub const HOENN_DEX_CURSOLA: _bindgen_ty_2 = 192;
pub const HOENN_DEX_CHINCHOU: _bindgen_ty_2 = 193;
pub const HOENN_DEX_LANTURN: _bindgen_ty_2 = 194;
pub const HOENN_DEX_LUVDISC: _bindgen_ty_2 = 195;
pub const HOENN_DEX_HORSEA: _bindgen_ty_2 = 196;
pub const HOENN_DEX_SEADRA: _bindgen_ty_2 = 197;
pub const HOENN_DEX_KINGDRA: _bindgen_ty_2 = 198;
pub const HOENN_DEX_BAGON: _bindgen_ty_2 = 199;
pub const HOENN_DEX_SHELGON: _bindgen_ty_2 = 200;
pub const HOENN_DEX_SALAMENCE: _bindgen_ty_2 = 201;
pub const HOENN_DEX_BELDUM: _bindgen_ty_2 = 202;
pub const HOENN_DEX_METANG: _bindgen_ty_2 = 203;
pub const HOENN_DEX_METAGROSS: _bindgen_ty_2 = 204;
pub const HOENN_DEX_REGIROCK: _bindgen_ty_2 = 205;
pub const HOENN_DEX_REGICE: _bindgen_ty_2 = 206;
pub const HOENN_DEX_REGISTEEL: _bindgen_ty_2 = 207;
pub const HOENN_DEX_LATIAS: _bindgen_ty_2 = 208;
pub const HOENN_DEX_LATIOS: _bindgen_ty_2 = 209;
pub const HOENN_DEX_KYOGRE: _bindgen_ty_2 = 210;
pub const HOENN_DEX_GROUDON: _bindgen_ty_2 = 211;
pub const HOENN_DEX_RAYQUAZA: _bindgen_ty_2 = 212;
pub const HOENN_DEX_JIRACHI: _bindgen_ty_2 = 213;
pub const HOENN_DEX_DEOXYS: _bindgen_ty_2 = 214;
pub type _bindgen_ty_2 = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Coords8 {
    pub x: s8,
    pub y: s8,
}
#[test]
fn bindgen_test_layout_Coords8() {
    const UNINIT: ::std::mem::MaybeUninit<Coords8> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Coords8>(),
        2usize,
        concat!("Size of: ", stringify!(Coords8))
    );
    assert_eq!(
        ::std::mem::align_of::<Coords8>(),
        1usize,
        concat!("Alignment of ", stringify!(Coords8))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Coords8),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(Coords8),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UCoords8 {
    pub x: u8_,
    pub y: u8_,
}
#[test]
fn bindgen_test_layout_UCoords8() {
    const UNINIT: ::std::mem::MaybeUninit<UCoords8> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UCoords8>(),
        2usize,
        concat!("Size of: ", stringify!(UCoords8))
    );
    assert_eq!(
        ::std::mem::align_of::<UCoords8>(),
        1usize,
        concat!("Alignment of ", stringify!(UCoords8))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UCoords8),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UCoords8),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Coords16 {
    pub x: s16,
    pub y: s16,
}
#[test]
fn bindgen_test_layout_Coords16() {
    const UNINIT: ::std::mem::MaybeUninit<Coords16> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Coords16>(),
        4usize,
        concat!("Size of: ", stringify!(Coords16))
    );
    assert_eq!(
        ::std::mem::align_of::<Coords16>(),
        2usize,
        concat!("Alignment of ", stringify!(Coords16))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Coords16),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Coords16),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UCoords16 {
    pub x: u16_,
    pub y: u16_,
}
#[test]
fn bindgen_test_layout_UCoords16() {
    const UNINIT: ::std::mem::MaybeUninit<UCoords16> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UCoords16>(),
        4usize,
        concat!("Size of: ", stringify!(UCoords16))
    );
    assert_eq!(
        ::std::mem::align_of::<UCoords16>(),
        2usize,
        concat!("Alignment of ", stringify!(UCoords16))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UCoords16),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UCoords16),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Coords32 {
    pub x: s32,
    pub y: s32,
}
#[test]
fn bindgen_test_layout_Coords32() {
    const UNINIT: ::std::mem::MaybeUninit<Coords32> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Coords32>(),
        8usize,
        concat!("Size of: ", stringify!(Coords32))
    );
    assert_eq!(
        ::std::mem::align_of::<Coords32>(),
        4usize,
        concat!("Alignment of ", stringify!(Coords32))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Coords32),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Coords32),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UCoords32 {
    pub x: u32_,
    pub y: u32_,
}
#[test]
fn bindgen_test_layout_UCoords32() {
    const UNINIT: ::std::mem::MaybeUninit<UCoords32> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UCoords32>(),
        8usize,
        concat!("Size of: ", stringify!(UCoords32))
    );
    assert_eq!(
        ::std::mem::align_of::<UCoords32>(),
        4usize,
        concat!("Alignment of ", stringify!(UCoords32))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UCoords32),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UCoords32),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SaveBlock3 {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_SaveBlock3() {
    assert_eq!(
        ::std::mem::size_of::<SaveBlock3>(),
        4usize,
        concat!("Size of: ", stringify!(SaveBlock3))
    );
    assert_eq!(
        ::std::mem::align_of::<SaveBlock3>(),
        1usize,
        concat!("Alignment of ", stringify!(SaveBlock3))
    );
}
extern "C" {
    pub static mut gSaveBlock3Ptr: *mut SaveBlock3;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Time {
    pub days: s16,
    pub hours: s8,
    pub minutes: s8,
    pub seconds: s8,
}
#[test]
fn bindgen_test_layout_Time() {
    const UNINIT: ::std::mem::MaybeUninit<Time> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Time>(),
        6usize,
        concat!("Size of: ", stringify!(Time))
    );
    assert_eq!(
        ::std::mem::align_of::<Time>(),
        2usize,
        concat!("Alignment of ", stringify!(Time))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).days) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Time),
            "::",
            stringify!(days)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hours) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Time),
            "::",
            stringify!(hours)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minutes) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(Time),
            "::",
            stringify!(minutes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seconds) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Time),
            "::",
            stringify!(seconds)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Pokedex {
    pub order: u8_,
    pub mode: u8_,
    pub nationalMagic: u8_,
    pub unknown2: u8_,
    pub unownPersonality: u32_,
    pub spindaPersonality: u32_,
    pub unknown3: u32_,
    pub filler: [u8_; 104usize],
}
#[test]
fn bindgen_test_layout_Pokedex() {
    const UNINIT: ::std::mem::MaybeUninit<Pokedex> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Pokedex>(),
        120usize,
        concat!("Size of: ", stringify!(Pokedex))
    );
    assert_eq!(
        ::std::mem::align_of::<Pokedex>(),
        4usize,
        concat!("Alignment of ", stringify!(Pokedex))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).order) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Pokedex),
            "::",
            stringify!(order)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(Pokedex),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nationalMagic) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Pokedex),
            "::",
            stringify!(nationalMagic)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown2) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(Pokedex),
            "::",
            stringify!(unknown2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unownPersonality) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Pokedex),
            "::",
            stringify!(unownPersonality)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).spindaPersonality) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Pokedex),
            "::",
            stringify!(spindaPersonality)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown3) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Pokedex),
            "::",
            stringify!(unknown3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).filler) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Pokedex),
            "::",
            stringify!(filler)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PokemonJumpRecords {
    pub jumpsInRow: u16_,
    pub unused1: u16_,
    pub excellentsInRow: u16_,
    pub gamesWithMaxPlayers: u16_,
    pub unused2: u32_,
    pub bestJumpScore: u32_,
}
#[test]
fn bindgen_test_layout_PokemonJumpRecords() {
    const UNINIT: ::std::mem::MaybeUninit<PokemonJumpRecords> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<PokemonJumpRecords>(),
        16usize,
        concat!("Size of: ", stringify!(PokemonJumpRecords))
    );
    assert_eq!(
        ::std::mem::align_of::<PokemonJumpRecords>(),
        4usize,
        concat!("Alignment of ", stringify!(PokemonJumpRecords))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jumpsInRow) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PokemonJumpRecords),
            "::",
            stringify!(jumpsInRow)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused1) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(PokemonJumpRecords),
            "::",
            stringify!(unused1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).excellentsInRow) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(PokemonJumpRecords),
            "::",
            stringify!(excellentsInRow)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gamesWithMaxPlayers) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(PokemonJumpRecords),
            "::",
            stringify!(gamesWithMaxPlayers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused2) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PokemonJumpRecords),
            "::",
            stringify!(unused2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bestJumpScore) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(PokemonJumpRecords),
            "::",
            stringify!(bestJumpScore)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BerryPickingResults {
    pub bestScore: u32_,
    pub berriesPicked: u16_,
    pub berriesPickedInRow: u16_,
    pub field_8: u8_,
    pub field_9: u8_,
    pub field_A: u8_,
    pub field_B: u8_,
    pub field_C: u8_,
    pub field_D: u8_,
    pub field_E: u8_,
    pub field_F: u8_,
}
#[test]
fn bindgen_test_layout_BerryPickingResults() {
    const UNINIT: ::std::mem::MaybeUninit<BerryPickingResults> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BerryPickingResults>(),
        16usize,
        concat!("Size of: ", stringify!(BerryPickingResults))
    );
    assert_eq!(
        ::std::mem::align_of::<BerryPickingResults>(),
        4usize,
        concat!("Alignment of ", stringify!(BerryPickingResults))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bestScore) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BerryPickingResults),
            "::",
            stringify!(bestScore)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).berriesPicked) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BerryPickingResults),
            "::",
            stringify!(berriesPicked)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).berriesPickedInRow) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(BerryPickingResults),
            "::",
            stringify!(berriesPickedInRow)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_8) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BerryPickingResults),
            "::",
            stringify!(field_8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_9) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(BerryPickingResults),
            "::",
            stringify!(field_9)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_A) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(BerryPickingResults),
            "::",
            stringify!(field_A)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_B) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(BerryPickingResults),
            "::",
            stringify!(field_B)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_C) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BerryPickingResults),
            "::",
            stringify!(field_C)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_D) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(BerryPickingResults),
            "::",
            stringify!(field_D)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_E) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(BerryPickingResults),
            "::",
            stringify!(field_E)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_F) as usize - ptr as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(BerryPickingResults),
            "::",
            stringify!(field_F)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyramidBag {
    pub itemId: [[u16_; 10usize]; 2usize],
    pub quantity: [[u8_; 10usize]; 2usize],
}
#[test]
fn bindgen_test_layout_PyramidBag() {
    const UNINIT: ::std::mem::MaybeUninit<PyramidBag> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<PyramidBag>(),
        60usize,
        concat!("Size of: ", stringify!(PyramidBag))
    );
    assert_eq!(
        ::std::mem::align_of::<PyramidBag>(),
        2usize,
        concat!("Alignment of ", stringify!(PyramidBag))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).itemId) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyramidBag),
            "::",
            stringify!(itemId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quantity) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PyramidBag),
            "::",
            stringify!(quantity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BerryCrush {
    pub pressingSpeeds: [u16_; 4usize],
    pub berryPowderAmount: u32_,
    pub unk: u32_,
}
#[test]
fn bindgen_test_layout_BerryCrush() {
    const UNINIT: ::std::mem::MaybeUninit<BerryCrush> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BerryCrush>(),
        16usize,
        concat!("Size of: ", stringify!(BerryCrush))
    );
    assert_eq!(
        ::std::mem::align_of::<BerryCrush>(),
        4usize,
        concat!("Alignment of ", stringify!(BerryCrush))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pressingSpeeds) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BerryCrush),
            "::",
            stringify!(pressingSpeeds)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).berryPowderAmount) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BerryCrush),
            "::",
            stringify!(berryPowderAmount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unk) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BerryCrush),
            "::",
            stringify!(unk)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ApprenticeMon {
    pub species: u16_,
    pub moves: [u16_; 4usize],
    pub item: u16_,
}
#[test]
fn bindgen_test_layout_ApprenticeMon() {
    const UNINIT: ::std::mem::MaybeUninit<ApprenticeMon> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ApprenticeMon>(),
        12usize,
        concat!("Size of: ", stringify!(ApprenticeMon))
    );
    assert_eq!(
        ::std::mem::align_of::<ApprenticeMon>(),
        2usize,
        concat!("Alignment of ", stringify!(ApprenticeMon))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).species) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ApprenticeMon),
            "::",
            stringify!(species)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).moves) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ApprenticeMon),
            "::",
            stringify!(moves)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).item) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(ApprenticeMon),
            "::",
            stringify!(item)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Apprentice {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub numQuestions: u8_,
    pub number: u8_,
    pub party: [ApprenticeMon; 3usize],
    pub speechWon: [u16_; 6usize],
    pub playerId: [u8_; 4usize],
    pub playerName: [u8_; 7usize],
    pub language: u8_,
    pub checksum: u32_,
}
#[test]
fn bindgen_test_layout_Apprentice() {
    const UNINIT: ::std::mem::MaybeUninit<Apprentice> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Apprentice>(),
        68usize,
        concat!("Size of: ", stringify!(Apprentice))
    );
    assert_eq!(
        ::std::mem::align_of::<Apprentice>(),
        4usize,
        concat!("Alignment of ", stringify!(Apprentice))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numQuestions) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(Apprentice),
            "::",
            stringify!(numQuestions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).number) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Apprentice),
            "::",
            stringify!(number)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).party) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Apprentice),
            "::",
            stringify!(party)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).speechWon) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Apprentice),
            "::",
            stringify!(speechWon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).playerId) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(Apprentice),
            "::",
            stringify!(playerId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).playerName) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Apprentice),
            "::",
            stringify!(playerName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).language) as usize - ptr as usize },
        63usize,
        concat!(
            "Offset of field: ",
            stringify!(Apprentice),
            "::",
            stringify!(language)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).checksum) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(Apprentice),
            "::",
            stringify!(checksum)
        )
    );
}
impl Apprentice {
    #[inline]
    pub fn id(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_id(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn lvlMode(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_lvlMode(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(id: u8_, lvlMode: u8_) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 5u8, {
            let id: u8 = unsafe { ::std::mem::transmute(id) };
            id as u64
        });
        __bindgen_bitfield_unit.set(5usize, 2u8, {
            let lvlMode: u8 = unsafe { ::std::mem::transmute(lvlMode) };
            lvlMode as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BattleTowerPokemon {
    pub species: u16_,
    pub heldItem: u16_,
    pub moves: [u16_; 4usize],
    pub level: u8_,
    pub ppBonuses: u8_,
    pub hpEV: u8_,
    pub attackEV: u8_,
    pub defenseEV: u8_,
    pub speedEV: u8_,
    pub spAttackEV: u8_,
    pub spDefenseEV: u8_,
    pub otId: u32_,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub personality: u32_,
    pub nickname: [u8_; 11usize],
    pub friendship: u8_,
}
#[test]
fn bindgen_test_layout_BattleTowerPokemon() {
    const UNINIT: ::std::mem::MaybeUninit<BattleTowerPokemon> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BattleTowerPokemon>(),
        44usize,
        concat!("Size of: ", stringify!(BattleTowerPokemon))
    );
    assert_eq!(
        ::std::mem::align_of::<BattleTowerPokemon>(),
        4usize,
        concat!("Alignment of ", stringify!(BattleTowerPokemon))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).species) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerPokemon),
            "::",
            stringify!(species)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).heldItem) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerPokemon),
            "::",
            stringify!(heldItem)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).moves) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerPokemon),
            "::",
            stringify!(moves)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).level) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerPokemon),
            "::",
            stringify!(level)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ppBonuses) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerPokemon),
            "::",
            stringify!(ppBonuses)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hpEV) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerPokemon),
            "::",
            stringify!(hpEV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attackEV) as usize - ptr as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerPokemon),
            "::",
            stringify!(attackEV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).defenseEV) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerPokemon),
            "::",
            stringify!(defenseEV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).speedEV) as usize - ptr as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerPokemon),
            "::",
            stringify!(speedEV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).spAttackEV) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerPokemon),
            "::",
            stringify!(spAttackEV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).spDefenseEV) as usize - ptr as usize },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerPokemon),
            "::",
            stringify!(spDefenseEV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).otId) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerPokemon),
            "::",
            stringify!(otId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).personality) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerPokemon),
            "::",
            stringify!(personality)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nickname) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerPokemon),
            "::",
            stringify!(nickname)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).friendship) as usize - ptr as usize },
        43usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerPokemon),
            "::",
            stringify!(friendship)
        )
    );
}
impl BattleTowerPokemon {
    #[inline]
    pub fn hpIV(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_hpIV(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn attackIV(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_attackIV(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn defenseIV(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_defenseIV(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn speedIV(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_speedIV(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn spAttackIV(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(20usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_spAttackIV(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(20usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn spDefenseIV(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(25usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_spDefenseIV(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(25usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn gap(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_gap(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn abilityNum(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_abilityNum(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        hpIV: u32_,
        attackIV: u32_,
        defenseIV: u32_,
        speedIV: u32_,
        spAttackIV: u32_,
        spDefenseIV: u32_,
        gap: u32_,
        abilityNum: u32_,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 5u8, {
            let hpIV: u32 = unsafe { ::std::mem::transmute(hpIV) };
            hpIV as u64
        });
        __bindgen_bitfield_unit.set(5usize, 5u8, {
            let attackIV: u32 = unsafe { ::std::mem::transmute(attackIV) };
            attackIV as u64
        });
        __bindgen_bitfield_unit.set(10usize, 5u8, {
            let defenseIV: u32 = unsafe { ::std::mem::transmute(defenseIV) };
            defenseIV as u64
        });
        __bindgen_bitfield_unit.set(15usize, 5u8, {
            let speedIV: u32 = unsafe { ::std::mem::transmute(speedIV) };
            speedIV as u64
        });
        __bindgen_bitfield_unit.set(20usize, 5u8, {
            let spAttackIV: u32 = unsafe { ::std::mem::transmute(spAttackIV) };
            spAttackIV as u64
        });
        __bindgen_bitfield_unit.set(25usize, 5u8, {
            let spDefenseIV: u32 = unsafe { ::std::mem::transmute(spDefenseIV) };
            spDefenseIV as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let gap: u32 = unsafe { ::std::mem::transmute(gap) };
            gap as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let abilityNum: u32 = unsafe { ::std::mem::transmute(abilityNum) };
            abilityNum as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EmeraldBattleTowerRecord {
    pub lvlMode: u8_,
    pub facilityClass: u8_,
    pub winStreak: u16_,
    pub name: [u8_; 8usize],
    pub trainerId: [u8_; 4usize],
    pub greeting: [u16_; 6usize],
    pub speechWon: [u16_; 6usize],
    pub speechLost: [u16_; 6usize],
    pub party: [BattleTowerPokemon; 4usize],
    pub language: u8_,
    pub checksum: u32_,
}
#[test]
fn bindgen_test_layout_EmeraldBattleTowerRecord() {
    const UNINIT: ::std::mem::MaybeUninit<EmeraldBattleTowerRecord> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<EmeraldBattleTowerRecord>(),
        236usize,
        concat!("Size of: ", stringify!(EmeraldBattleTowerRecord))
    );
    assert_eq!(
        ::std::mem::align_of::<EmeraldBattleTowerRecord>(),
        4usize,
        concat!("Alignment of ", stringify!(EmeraldBattleTowerRecord))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lvlMode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(EmeraldBattleTowerRecord),
            "::",
            stringify!(lvlMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).facilityClass) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(EmeraldBattleTowerRecord),
            "::",
            stringify!(facilityClass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).winStreak) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(EmeraldBattleTowerRecord),
            "::",
            stringify!(winStreak)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(EmeraldBattleTowerRecord),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trainerId) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(EmeraldBattleTowerRecord),
            "::",
            stringify!(trainerId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).greeting) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(EmeraldBattleTowerRecord),
            "::",
            stringify!(greeting)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).speechWon) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(EmeraldBattleTowerRecord),
            "::",
            stringify!(speechWon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).speechLost) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(EmeraldBattleTowerRecord),
            "::",
            stringify!(speechLost)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).party) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(EmeraldBattleTowerRecord),
            "::",
            stringify!(party)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).language) as usize - ptr as usize },
        228usize,
        concat!(
            "Offset of field: ",
            stringify!(EmeraldBattleTowerRecord),
            "::",
            stringify!(language)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).checksum) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(EmeraldBattleTowerRecord),
            "::",
            stringify!(checksum)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BattleTowerInterview {
    pub playerSpecies: u16_,
    pub opponentSpecies: u16_,
    pub opponentName: [u8_; 8usize],
    pub opponentMonNickname: [u8_; 11usize],
    pub opponentLanguage: u8_,
}
#[test]
fn bindgen_test_layout_BattleTowerInterview() {
    const UNINIT: ::std::mem::MaybeUninit<BattleTowerInterview> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BattleTowerInterview>(),
        24usize,
        concat!("Size of: ", stringify!(BattleTowerInterview))
    );
    assert_eq!(
        ::std::mem::align_of::<BattleTowerInterview>(),
        2usize,
        concat!("Alignment of ", stringify!(BattleTowerInterview))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).playerSpecies) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerInterview),
            "::",
            stringify!(playerSpecies)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).opponentSpecies) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerInterview),
            "::",
            stringify!(opponentSpecies)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).opponentName) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerInterview),
            "::",
            stringify!(opponentName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).opponentMonNickname) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerInterview),
            "::",
            stringify!(opponentMonNickname)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).opponentLanguage) as usize - ptr as usize },
        23usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerInterview),
            "::",
            stringify!(opponentLanguage)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BattleTowerEReaderTrainer {
    pub unk0: u8_,
    pub facilityClass: u8_,
    pub winStreak: u16_,
    pub name: [u8_; 8usize],
    pub trainerId: [u8_; 4usize],
    pub greeting: [u16_; 6usize],
    pub farewellPlayerLost: [u16_; 6usize],
    pub farewellPlayerWon: [u16_; 6usize],
    pub party: [BattleTowerPokemon; 3usize],
    pub checksum: u32_,
}
#[test]
fn bindgen_test_layout_BattleTowerEReaderTrainer() {
    const UNINIT: ::std::mem::MaybeUninit<BattleTowerEReaderTrainer> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BattleTowerEReaderTrainer>(),
        188usize,
        concat!("Size of: ", stringify!(BattleTowerEReaderTrainer))
    );
    assert_eq!(
        ::std::mem::align_of::<BattleTowerEReaderTrainer>(),
        4usize,
        concat!("Alignment of ", stringify!(BattleTowerEReaderTrainer))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unk0) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerEReaderTrainer),
            "::",
            stringify!(unk0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).facilityClass) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerEReaderTrainer),
            "::",
            stringify!(facilityClass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).winStreak) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerEReaderTrainer),
            "::",
            stringify!(winStreak)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerEReaderTrainer),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trainerId) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerEReaderTrainer),
            "::",
            stringify!(trainerId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).greeting) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerEReaderTrainer),
            "::",
            stringify!(greeting)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).farewellPlayerLost) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerEReaderTrainer),
            "::",
            stringify!(farewellPlayerLost)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).farewellPlayerWon) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerEReaderTrainer),
            "::",
            stringify!(farewellPlayerWon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).party) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerEReaderTrainer),
            "::",
            stringify!(party)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).checksum) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleTowerEReaderTrainer),
            "::",
            stringify!(checksum)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DomeMonData {
    pub moves: [u16_; 4usize],
    pub evs: [u8_; 6usize],
    pub nature: u8_,
}
#[test]
fn bindgen_test_layout_DomeMonData() {
    const UNINIT: ::std::mem::MaybeUninit<DomeMonData> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<DomeMonData>(),
        16usize,
        concat!("Size of: ", stringify!(DomeMonData))
    );
    assert_eq!(
        ::std::mem::align_of::<DomeMonData>(),
        2usize,
        concat!("Alignment of ", stringify!(DomeMonData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).moves) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DomeMonData),
            "::",
            stringify!(moves)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).evs) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DomeMonData),
            "::",
            stringify!(evs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nature) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(DomeMonData),
            "::",
            stringify!(nature)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RentalMon {
    pub monId: u16_,
    pub personality: u32_,
    pub ivs: u8_,
    pub abilityNum: u8_,
}
#[test]
fn bindgen_test_layout_RentalMon() {
    const UNINIT: ::std::mem::MaybeUninit<RentalMon> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RentalMon>(),
        12usize,
        concat!("Size of: ", stringify!(RentalMon))
    );
    assert_eq!(
        ::std::mem::align_of::<RentalMon>(),
        4usize,
        concat!("Alignment of ", stringify!(RentalMon))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).monId) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RentalMon),
            "::",
            stringify!(monId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).personality) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RentalMon),
            "::",
            stringify!(personality)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ivs) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RentalMon),
            "::",
            stringify!(ivs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).abilityNum) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(RentalMon),
            "::",
            stringify!(abilityNum)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BattleDomeTrainer {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[test]
fn bindgen_test_layout_BattleDomeTrainer() {
    assert_eq!(
        ::std::mem::size_of::<BattleDomeTrainer>(),
        2usize,
        concat!("Size of: ", stringify!(BattleDomeTrainer))
    );
    assert_eq!(
        ::std::mem::align_of::<BattleDomeTrainer>(),
        2usize,
        concat!("Alignment of ", stringify!(BattleDomeTrainer))
    );
}
impl BattleDomeTrainer {
    #[inline]
    pub fn trainerId(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 10u8) as u16) }
    }
    #[inline]
    pub fn set_trainerId(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 10u8, val as u64)
        }
    }
    #[inline]
    pub fn isEliminated(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_isEliminated(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn eliminatedAt(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_eliminatedAt(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn forfeited(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_forfeited(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        trainerId: u16_,
        isEliminated: u16_,
        eliminatedAt: u16_,
        forfeited: u16_,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 10u8, {
            let trainerId: u16 = unsafe { ::std::mem::transmute(trainerId) };
            trainerId as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let isEliminated: u16 = unsafe { ::std::mem::transmute(isEliminated) };
            isEliminated as u64
        });
        __bindgen_bitfield_unit.set(11usize, 2u8, {
            let eliminatedAt: u16 = unsafe { ::std::mem::transmute(eliminatedAt) };
            eliminatedAt as u64
        });
        __bindgen_bitfield_unit.set(13usize, 3u8, {
            let forfeited: u16 = unsafe { ::std::mem::transmute(forfeited) };
            forfeited as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BattleFrontier {
    pub towerPlayer: EmeraldBattleTowerRecord,
    pub towerRecords: [EmeraldBattleTowerRecord; 5usize],
    pub towerInterview: BattleTowerInterview,
    pub ereaderTrainer: BattleTowerEReaderTrainer,
    pub challengeStatus: u8_,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub selectedPartyMons: [u16_; 4usize],
    pub curChallengeBattleNum: u16_,
    pub trainerIds: [u16_; 20usize],
    pub winStreakActiveFlags: u32_,
    pub towerWinStreaks: [[u16_; 2usize]; 4usize],
    pub towerRecordWinStreaks: [[u16_; 2usize]; 4usize],
    pub battledBrainFlags: u16_,
    pub towerSinglesStreak: u16_,
    pub towerNumWins: u16_,
    pub towerBattleOutcome: u8_,
    pub towerLvlMode: u8_,
    pub _bitfield_align_2: [u8; 0],
    pub _bitfield_2: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub domeUnused: u8_,
    pub domeLvlMode: u8_,
    pub domeBattleMode: u8_,
    pub domeWinStreaks: [[u16_; 2usize]; 2usize],
    pub domeRecordWinStreaks: [[u16_; 2usize]; 2usize],
    pub domeTotalChampionships: [[u16_; 2usize]; 2usize],
    pub domeTrainers: [BattleDomeTrainer; 16usize],
    pub domeMonIds: [[u16_; 3usize]; 16usize],
    pub unused_DC4: u16_,
    pub palacePrize: u16_,
    pub palaceWinStreaks: [[u16_; 2usize]; 2usize],
    pub palaceRecordWinStreaks: [[u16_; 2usize]; 2usize],
    pub arenaPrize: u16_,
    pub arenaWinStreaks: [u16_; 2usize],
    pub arenaRecordStreaks: [u16_; 2usize],
    pub factoryWinStreaks: [[u16_; 2usize]; 2usize],
    pub factoryRecordWinStreaks: [[u16_; 2usize]; 2usize],
    pub factoryRentsCount: [[u16_; 2usize]; 2usize],
    pub factoryRecordRentsCount: [[u16_; 2usize]; 2usize],
    pub pikePrize: u16_,
    pub pikeWinStreaks: [u16_; 2usize],
    pub pikeRecordStreaks: [u16_; 2usize],
    pub pikeTotalStreaks: [u16_; 2usize],
    pub _bitfield_align_3: [u8; 0],
    pub _bitfield_3: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub pikeHeldItemsBackup: [u16_; 3usize],
    pub pyramidPrize: u16_,
    pub pyramidWinStreaks: [u16_; 2usize],
    pub pyramidRecordStreaks: [u16_; 2usize],
    pub pyramidRandoms: [u16_; 4usize],
    pub pyramidTrainerFlags: u8_,
    pub pyramidBag: PyramidBag,
    pub pyramidLightRadius: u8_,
    pub verdanturfTentPrize: u16_,
    pub fallarborTentPrize: u16_,
    pub slateportTentPrize: u16_,
    pub rentalMons: [RentalMon; 6usize],
    pub battlePoints: u16_,
    pub cardBattlePoints: u16_,
    pub battlesCount: u32_,
    pub domeWinningMoves: [u16_; 16usize],
    pub trainerFlags: u8_,
    pub opponentNames: [[u8_; 8usize]; 2usize],
    pub opponentTrainerIds: [[u8_; 4usize]; 2usize],
    pub _bitfield_align_4: [u8; 0],
    pub _bitfield_4: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub unused_EFA: u8_,
    pub unused_EFB: u8_,
    pub domePlayerPartyData: [DomeMonData; 3usize],
}
#[test]
fn bindgen_test_layout_BattleFrontier() {
    const UNINIT: ::std::mem::MaybeUninit<BattleFrontier> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BattleFrontier>(),
        2240usize,
        concat!("Size of: ", stringify!(BattleFrontier))
    );
    assert_eq!(
        ::std::mem::align_of::<BattleFrontier>(),
        4usize,
        concat!("Alignment of ", stringify!(BattleFrontier))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).towerPlayer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(towerPlayer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).towerRecords) as usize - ptr as usize },
        236usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(towerRecords)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).towerInterview) as usize - ptr as usize },
        1416usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(towerInterview)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ereaderTrainer) as usize - ptr as usize },
        1440usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(ereaderTrainer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).challengeStatus) as usize - ptr as usize },
        1628usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(challengeStatus)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).selectedPartyMons) as usize - ptr as usize },
        1630usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(selectedPartyMons)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).curChallengeBattleNum) as usize - ptr as usize },
        1638usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(curChallengeBattleNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trainerIds) as usize - ptr as usize },
        1640usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(trainerIds)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).winStreakActiveFlags) as usize - ptr as usize },
        1680usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(winStreakActiveFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).towerWinStreaks) as usize - ptr as usize },
        1684usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(towerWinStreaks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).towerRecordWinStreaks) as usize - ptr as usize },
        1700usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(towerRecordWinStreaks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).battledBrainFlags) as usize - ptr as usize },
        1716usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(battledBrainFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).towerSinglesStreak) as usize - ptr as usize },
        1718usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(towerSinglesStreak)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).towerNumWins) as usize - ptr as usize },
        1720usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(towerNumWins)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).towerBattleOutcome) as usize - ptr as usize },
        1722usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(towerBattleOutcome)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).towerLvlMode) as usize - ptr as usize },
        1723usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(towerLvlMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).domeUnused) as usize - ptr as usize },
        1725usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(domeUnused)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).domeLvlMode) as usize - ptr as usize },
        1726usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(domeLvlMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).domeBattleMode) as usize - ptr as usize },
        1727usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(domeBattleMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).domeWinStreaks) as usize - ptr as usize },
        1728usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(domeWinStreaks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).domeRecordWinStreaks) as usize - ptr as usize },
        1736usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(domeRecordWinStreaks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).domeTotalChampionships) as usize - ptr as usize },
        1744usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(domeTotalChampionships)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).domeTrainers) as usize - ptr as usize },
        1752usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(domeTrainers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).domeMonIds) as usize - ptr as usize },
        1784usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(domeMonIds)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused_DC4) as usize - ptr as usize },
        1880usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(unused_DC4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).palacePrize) as usize - ptr as usize },
        1882usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(palacePrize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).palaceWinStreaks) as usize - ptr as usize },
        1884usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(palaceWinStreaks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).palaceRecordWinStreaks) as usize - ptr as usize },
        1892usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(palaceRecordWinStreaks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arenaPrize) as usize - ptr as usize },
        1900usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(arenaPrize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arenaWinStreaks) as usize - ptr as usize },
        1902usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(arenaWinStreaks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arenaRecordStreaks) as usize - ptr as usize },
        1906usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(arenaRecordStreaks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).factoryWinStreaks) as usize - ptr as usize },
        1910usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(factoryWinStreaks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).factoryRecordWinStreaks) as usize - ptr as usize },
        1918usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(factoryRecordWinStreaks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).factoryRentsCount) as usize - ptr as usize },
        1926usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(factoryRentsCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).factoryRecordRentsCount) as usize - ptr as usize },
        1934usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(factoryRecordRentsCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pikePrize) as usize - ptr as usize },
        1942usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(pikePrize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pikeWinStreaks) as usize - ptr as usize },
        1944usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(pikeWinStreaks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pikeRecordStreaks) as usize - ptr as usize },
        1948usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(pikeRecordStreaks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pikeTotalStreaks) as usize - ptr as usize },
        1952usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(pikeTotalStreaks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pikeHeldItemsBackup) as usize - ptr as usize },
        1958usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(pikeHeldItemsBackup)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pyramidPrize) as usize - ptr as usize },
        1964usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(pyramidPrize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pyramidWinStreaks) as usize - ptr as usize },
        1966usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(pyramidWinStreaks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pyramidRecordStreaks) as usize - ptr as usize },
        1970usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(pyramidRecordStreaks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pyramidRandoms) as usize - ptr as usize },
        1974usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(pyramidRandoms)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pyramidTrainerFlags) as usize - ptr as usize },
        1982usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(pyramidTrainerFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pyramidBag) as usize - ptr as usize },
        1984usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(pyramidBag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pyramidLightRadius) as usize - ptr as usize },
        2044usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(pyramidLightRadius)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).verdanturfTentPrize) as usize - ptr as usize },
        2046usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(verdanturfTentPrize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fallarborTentPrize) as usize - ptr as usize },
        2048usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(fallarborTentPrize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slateportTentPrize) as usize - ptr as usize },
        2050usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(slateportTentPrize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rentalMons) as usize - ptr as usize },
        2052usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(rentalMons)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).battlePoints) as usize - ptr as usize },
        2124usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(battlePoints)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cardBattlePoints) as usize - ptr as usize },
        2126usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(cardBattlePoints)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).battlesCount) as usize - ptr as usize },
        2128usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(battlesCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).domeWinningMoves) as usize - ptr as usize },
        2132usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(domeWinningMoves)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trainerFlags) as usize - ptr as usize },
        2164usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(trainerFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).opponentNames) as usize - ptr as usize },
        2165usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(opponentNames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).opponentTrainerIds) as usize - ptr as usize },
        2181usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(opponentTrainerIds)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused_EFA) as usize - ptr as usize },
        2190usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(unused_EFA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused_EFB) as usize - ptr as usize },
        2191usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(unused_EFB)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).domePlayerPartyData) as usize - ptr as usize },
        2192usize,
        concat!(
            "Offset of field: ",
            stringify!(BattleFrontier),
            "::",
            stringify!(domePlayerPartyData)
        )
    );
}
impl BattleFrontier {
    #[inline]
    pub fn lvlMode(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_lvlMode(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn challengePaused(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_challengePaused(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn disableRecordBattle(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_disableRecordBattle(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        lvlMode: u8_,
        challengePaused: u8_,
        disableRecordBattle: u8_,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let lvlMode: u8 = unsafe { ::std::mem::transmute(lvlMode) };
            lvlMode as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let challengePaused: u8 = unsafe { ::std::mem::transmute(challengePaused) };
            challengePaused as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let disableRecordBattle: u8 = unsafe { ::std::mem::transmute(disableRecordBattle) };
            disableRecordBattle as u64
        });
        __bindgen_bitfield_unit
    }
    #[inline]
    pub fn domeAttemptedSingles50(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_domeAttemptedSingles50(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn domeAttemptedSinglesOpen(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_domeAttemptedSinglesOpen(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn domeHasWonSingles50(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_domeHasWonSingles50(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn domeHasWonSinglesOpen(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_domeHasWonSinglesOpen(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn domeAttemptedDoubles50(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_domeAttemptedDoubles50(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn domeAttemptedDoublesOpen(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_domeAttemptedDoublesOpen(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn domeHasWonDoubles50(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_domeHasWonDoubles50(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn domeHasWonDoublesOpen(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_domeHasWonDoublesOpen(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_2(
        domeAttemptedSingles50: u8_,
        domeAttemptedSinglesOpen: u8_,
        domeHasWonSingles50: u8_,
        domeHasWonSinglesOpen: u8_,
        domeAttemptedDoubles50: u8_,
        domeAttemptedDoublesOpen: u8_,
        domeHasWonDoubles50: u8_,
        domeHasWonDoublesOpen: u8_,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let domeAttemptedSingles50: u8 =
                unsafe { ::std::mem::transmute(domeAttemptedSingles50) };
            domeAttemptedSingles50 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let domeAttemptedSinglesOpen: u8 =
                unsafe { ::std::mem::transmute(domeAttemptedSinglesOpen) };
            domeAttemptedSinglesOpen as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let domeHasWonSingles50: u8 = unsafe { ::std::mem::transmute(domeHasWonSingles50) };
            domeHasWonSingles50 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let domeHasWonSinglesOpen: u8 = unsafe { ::std::mem::transmute(domeHasWonSinglesOpen) };
            domeHasWonSinglesOpen as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let domeAttemptedDoubles50: u8 =
                unsafe { ::std::mem::transmute(domeAttemptedDoubles50) };
            domeAttemptedDoubles50 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let domeAttemptedDoublesOpen: u8 =
                unsafe { ::std::mem::transmute(domeAttemptedDoublesOpen) };
            domeAttemptedDoublesOpen as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let domeHasWonDoubles50: u8 = unsafe { ::std::mem::transmute(domeHasWonDoubles50) };
            domeHasWonDoubles50 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let domeHasWonDoublesOpen: u8 = unsafe { ::std::mem::transmute(domeHasWonDoublesOpen) };
            domeHasWonDoublesOpen as u64
        });
        __bindgen_bitfield_unit
    }
    #[inline]
    pub fn pikeHintedRoomIndex(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_3.get(0usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_pikeHintedRoomIndex(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_3.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn pikeHintedRoomType(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_3.get(3usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_pikeHintedRoomType(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_3.set(3usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn pikeHealingRoomsDisabled(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_3.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_pikeHealingRoomsDisabled(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_3.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_3(
        pikeHintedRoomIndex: u8_,
        pikeHintedRoomType: u8_,
        pikeHealingRoomsDisabled: u8_,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let pikeHintedRoomIndex: u8 = unsafe { ::std::mem::transmute(pikeHintedRoomIndex) };
            pikeHintedRoomIndex as u64
        });
        __bindgen_bitfield_unit.set(3usize, 4u8, {
            let pikeHintedRoomType: u8 = unsafe { ::std::mem::transmute(pikeHintedRoomType) };
            pikeHintedRoomType as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let pikeHealingRoomsDisabled: u8 =
                unsafe { ::std::mem::transmute(pikeHealingRoomsDisabled) };
            pikeHealingRoomsDisabled as u64
        });
        __bindgen_bitfield_unit
    }
    #[inline]
    pub fn unk_EF9(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_4.get(0usize, 7u8) as u8) }
    }
    #[inline]
    pub fn set_unk_EF9(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_4.set(0usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn savedGame(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_4.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_savedGame(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_4.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_4(unk_EF9: u8_, savedGame: u8_) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 7u8, {
            let unk_EF9: u8 = unsafe { ::std::mem::transmute(unk_EF9) };
            unk_EF9 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let savedGame: u8 = unsafe { ::std::mem::transmute(savedGame) };
            savedGame as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ApprenticeQuestion {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub data: u16_,
}
#[test]
fn bindgen_test_layout_ApprenticeQuestion() {
    const UNINIT: ::std::mem::MaybeUninit<ApprenticeQuestion> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ApprenticeQuestion>(),
        4usize,
        concat!("Size of: ", stringify!(ApprenticeQuestion))
    );
    assert_eq!(
        ::std::mem::align_of::<ApprenticeQuestion>(),
        2usize,
        concat!("Alignment of ", stringify!(ApprenticeQuestion))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ApprenticeQuestion),
            "::",
            stringify!(data)
        )
    );
}
impl ApprenticeQuestion {
    #[inline]
    pub fn questionId(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_questionId(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn monId(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_monId(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn moveSlot(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_moveSlot(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn suggestedChange(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_suggestedChange(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        questionId: u8_,
        monId: u8_,
        moveSlot: u8_,
        suggestedChange: u8_,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let questionId: u8 = unsafe { ::std::mem::transmute(questionId) };
            questionId as u64
        });
        __bindgen_bitfield_unit.set(2usize, 2u8, {
            let monId: u8 = unsafe { ::std::mem::transmute(monId) };
            monId as u64
        });
        __bindgen_bitfield_unit.set(4usize, 2u8, {
            let moveSlot: u8 = unsafe { ::std::mem::transmute(moveSlot) };
            moveSlot as u64
        });
        __bindgen_bitfield_unit.set(6usize, 2u8, {
            let suggestedChange: u8 = unsafe { ::std::mem::transmute(suggestedChange) };
            suggestedChange as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PlayersApprentice {
    pub id: u8_,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub unused: u8_,
    pub speciesIds: [u8_; 3usize],
    pub questions: [ApprenticeQuestion; 9usize],
}
#[test]
fn bindgen_test_layout_PlayersApprentice() {
    const UNINIT: ::std::mem::MaybeUninit<PlayersApprentice> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<PlayersApprentice>(),
        44usize,
        concat!("Size of: ", stringify!(PlayersApprentice))
    );
    assert_eq!(
        ::std::mem::align_of::<PlayersApprentice>(),
        2usize,
        concat!("Alignment of ", stringify!(PlayersApprentice))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PlayersApprentice),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(PlayersApprentice),
            "::",
            stringify!(unused)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).speciesIds) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(PlayersApprentice),
            "::",
            stringify!(speciesIds)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).questions) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PlayersApprentice),
            "::",
            stringify!(questions)
        )
    );
}
impl PlayersApprentice {
    #[inline]
    pub fn lvlMode(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_lvlMode(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn questionsAnswered(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_questionsAnswered(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn leadMonId(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_leadMonId(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn party(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_party(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn saveId(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_saveId(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        lvlMode: u8_,
        questionsAnswered: u8_,
        leadMonId: u8_,
        party: u8_,
        saveId: u8_,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let lvlMode: u8 = unsafe { ::std::mem::transmute(lvlMode) };
            lvlMode as u64
        });
        __bindgen_bitfield_unit.set(2usize, 4u8, {
            let questionsAnswered: u8 = unsafe { ::std::mem::transmute(questionsAnswered) };
            questionsAnswered as u64
        });
        __bindgen_bitfield_unit.set(6usize, 2u8, {
            let leadMonId: u8 = unsafe { ::std::mem::transmute(leadMonId) };
            leadMonId as u64
        });
        __bindgen_bitfield_unit.set(8usize, 3u8, {
            let party: u8 = unsafe { ::std::mem::transmute(party) };
            party as u64
        });
        __bindgen_bitfield_unit.set(11usize, 2u8, {
            let saveId: u8 = unsafe { ::std::mem::transmute(saveId) };
            saveId as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RankingHall1P {
    pub id: [u8_; 4usize],
    pub winStreak: u16_,
    pub name: [u8_; 8usize],
    pub language: u8_,
}
#[test]
fn bindgen_test_layout_RankingHall1P() {
    const UNINIT: ::std::mem::MaybeUninit<RankingHall1P> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RankingHall1P>(),
        16usize,
        concat!("Size of: ", stringify!(RankingHall1P))
    );
    assert_eq!(
        ::std::mem::align_of::<RankingHall1P>(),
        2usize,
        concat!("Alignment of ", stringify!(RankingHall1P))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RankingHall1P),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).winStreak) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RankingHall1P),
            "::",
            stringify!(winStreak)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(RankingHall1P),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).language) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(RankingHall1P),
            "::",
            stringify!(language)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RankingHall2P {
    pub id1: [u8_; 4usize],
    pub id2: [u8_; 4usize],
    pub winStreak: u16_,
    pub name1: [u8_; 8usize],
    pub name2: [u8_; 8usize],
    pub language: u8_,
}
#[test]
fn bindgen_test_layout_RankingHall2P() {
    const UNINIT: ::std::mem::MaybeUninit<RankingHall2P> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RankingHall2P>(),
        28usize,
        concat!("Size of: ", stringify!(RankingHall2P))
    );
    assert_eq!(
        ::std::mem::align_of::<RankingHall2P>(),
        2usize,
        concat!("Alignment of ", stringify!(RankingHall2P))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RankingHall2P),
            "::",
            stringify!(id1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id2) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RankingHall2P),
            "::",
            stringify!(id2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).winStreak) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RankingHall2P),
            "::",
            stringify!(winStreak)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name1) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(RankingHall2P),
            "::",
            stringify!(name1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name2) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(RankingHall2P),
            "::",
            stringify!(name2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).language) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(RankingHall2P),
            "::",
            stringify!(language)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SaveBlock2 {
    pub playerName: [u8_; 8usize],
    pub playerGender: u8_,
    pub specialSaveWarpFlags: u8_,
    pub playerTrainerId: [u8_; 4usize],
    pub playTimeHours: u16_,
    pub playTimeMinutes: u8_,
    pub playTimeSeconds: u8_,
    pub playTimeVBlanks: u8_,
    pub optionsButtonMode: u8_,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub pokedex: Pokedex,
    pub filler_90: [u8_; 8usize],
    pub localTimeOffset: Time,
    pub lastBerryTreeUpdate: Time,
    pub gcnLinkFlags: u32_,
    pub encryptionKey: u32_,
    pub playerApprentice: PlayersApprentice,
    pub apprentices: [Apprentice; 4usize],
    pub berryCrush: BerryCrush,
    pub pokeJump: PokemonJumpRecords,
    pub berryPick: BerryPickingResults,
    pub hallRecords1P: [[[RankingHall1P; 3usize]; 2usize]; 9usize],
    pub hallRecords2P: [[RankingHall2P; 3usize]; 2usize],
    pub contestLinkResults: [[u16_; 4usize]; 5usize],
    pub frontier: BattleFrontier,
}
#[test]
fn bindgen_test_layout_SaveBlock2() {
    const UNINIT: ::std::mem::MaybeUninit<SaveBlock2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SaveBlock2>(),
        3848usize,
        concat!("Size of: ", stringify!(SaveBlock2))
    );
    assert_eq!(
        ::std::mem::align_of::<SaveBlock2>(),
        4usize,
        concat!("Alignment of ", stringify!(SaveBlock2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).playerName) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SaveBlock2),
            "::",
            stringify!(playerName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).playerGender) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SaveBlock2),
            "::",
            stringify!(playerGender)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).specialSaveWarpFlags) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(SaveBlock2),
            "::",
            stringify!(specialSaveWarpFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).playerTrainerId) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(SaveBlock2),
            "::",
            stringify!(playerTrainerId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).playTimeHours) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(SaveBlock2),
            "::",
            stringify!(playTimeHours)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).playTimeMinutes) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SaveBlock2),
            "::",
            stringify!(playTimeMinutes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).playTimeSeconds) as usize - ptr as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(SaveBlock2),
            "::",
            stringify!(playTimeSeconds)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).playTimeVBlanks) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(SaveBlock2),
            "::",
            stringify!(playTimeVBlanks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).optionsButtonMode) as usize - ptr as usize },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(SaveBlock2),
            "::",
            stringify!(optionsButtonMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pokedex) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SaveBlock2),
            "::",
            stringify!(pokedex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).filler_90) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(SaveBlock2),
            "::",
            stringify!(filler_90)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).localTimeOffset) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(SaveBlock2),
            "::",
            stringify!(localTimeOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastBerryTreeUpdate) as usize - ptr as usize },
        158usize,
        concat!(
            "Offset of field: ",
            stringify!(SaveBlock2),
            "::",
            stringify!(lastBerryTreeUpdate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gcnLinkFlags) as usize - ptr as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(SaveBlock2),
            "::",
            stringify!(gcnLinkFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encryptionKey) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(SaveBlock2),
            "::",
            stringify!(encryptionKey)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).playerApprentice) as usize - ptr as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(SaveBlock2),
            "::",
            stringify!(playerApprentice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).apprentices) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(SaveBlock2),
            "::",
            stringify!(apprentices)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).berryCrush) as usize - ptr as usize },
        488usize,
        concat!(
            "Offset of field: ",
            stringify!(SaveBlock2),
            "::",
            stringify!(berryCrush)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pokeJump) as usize - ptr as usize },
        504usize,
        concat!(
            "Offset of field: ",
            stringify!(SaveBlock2),
            "::",
            stringify!(pokeJump)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).berryPick) as usize - ptr as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(SaveBlock2),
            "::",
            stringify!(berryPick)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hallRecords1P) as usize - ptr as usize },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(SaveBlock2),
            "::",
            stringify!(hallRecords1P)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hallRecords2P) as usize - ptr as usize },
        1400usize,
        concat!(
            "Offset of field: ",
            stringify!(SaveBlock2),
            "::",
            stringify!(hallRecords2P)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).contestLinkResults) as usize - ptr as usize },
        1568usize,
        concat!(
            "Offset of field: ",
            stringify!(SaveBlock2),
            "::",
            stringify!(contestLinkResults)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frontier) as usize - ptr as usize },
        1608usize,
        concat!(
            "Offset of field: ",
            stringify!(SaveBlock2),
            "::",
            stringify!(frontier)
        )
    );
}
impl SaveBlock2 {
    #[inline]
    pub fn optionsTextSpeed(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_optionsTextSpeed(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn optionsWindowFrameType(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 5u8) as u16) }
    }
    #[inline]
    pub fn set_optionsWindowFrameType(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn optionsSound(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_optionsSound(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn optionsBattleStyle(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_optionsBattleStyle(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn optionsBattleSceneOff(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_optionsBattleSceneOff(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn regionMapZoom(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_regionMapZoom(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        optionsTextSpeed: u16_,
        optionsWindowFrameType: u16_,
        optionsSound: u16_,
        optionsBattleStyle: u16_,
        optionsBattleSceneOff: u16_,
        regionMapZoom: u16_,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let optionsTextSpeed: u16 = unsafe { ::std::mem::transmute(optionsTextSpeed) };
            optionsTextSpeed as u64
        });
        __bindgen_bitfield_unit.set(3usize, 5u8, {
            let optionsWindowFrameType: u16 =
                unsafe { ::std::mem::transmute(optionsWindowFrameType) };
            optionsWindowFrameType as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let optionsSound: u16 = unsafe { ::std::mem::transmute(optionsSound) };
            optionsSound as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let optionsBattleStyle: u16 = unsafe { ::std::mem::transmute(optionsBattleStyle) };
            optionsBattleStyle as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let optionsBattleSceneOff: u16 =
                unsafe { ::std::mem::transmute(optionsBattleSceneOff) };
            optionsBattleSceneOff as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let regionMapZoom: u16 = unsafe { ::std::mem::transmute(regionMapZoom) };
            regionMapZoom as u64
        });
        __bindgen_bitfield_unit
    }
}
extern "C" {
    pub static mut gSaveBlock2Ptr: *mut SaveBlock2;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SecretBaseParty {
    pub personality: [u32_; 6usize],
    pub moves: [u16_; 24usize],
    pub species: [u16_; 6usize],
    pub heldItems: [u16_; 6usize],
    pub levels: [u8_; 6usize],
    pub EVs: [u8_; 6usize],
}
#[test]
fn bindgen_test_layout_SecretBaseParty() {
    const UNINIT: ::std::mem::MaybeUninit<SecretBaseParty> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SecretBaseParty>(),
        108usize,
        concat!("Size of: ", stringify!(SecretBaseParty))
    );
    assert_eq!(
        ::std::mem::align_of::<SecretBaseParty>(),
        4usize,
        concat!("Alignment of ", stringify!(SecretBaseParty))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).personality) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SecretBaseParty),
            "::",
            stringify!(personality)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).moves) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SecretBaseParty),
            "::",
            stringify!(moves)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).species) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(SecretBaseParty),
            "::",
            stringify!(species)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).heldItems) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(SecretBaseParty),
            "::",
            stringify!(heldItems)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).levels) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(SecretBaseParty),
            "::",
            stringify!(levels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EVs) as usize - ptr as usize },
        102usize,
        concat!(
            "Offset of field: ",
            stringify!(SecretBaseParty),
            "::",
            stringify!(EVs)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SecretBase {
    pub secretBaseId: u8_,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub trainerName: [u8_; 7usize],
    pub trainerId: [u8_; 4usize],
    pub language: u8_,
    pub numSecretBasesReceived: u16_,
    pub numTimesEntered: u8_,
    pub unused: u8_,
    pub decorations: [u8_; 16usize],
    pub decorationPositions: [u8_; 16usize],
    pub party: SecretBaseParty,
}
#[test]
fn bindgen_test_layout_SecretBase() {
    const UNINIT: ::std::mem::MaybeUninit<SecretBase> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SecretBase>(),
        160usize,
        concat!("Size of: ", stringify!(SecretBase))
    );
    assert_eq!(
        ::std::mem::align_of::<SecretBase>(),
        4usize,
        concat!("Alignment of ", stringify!(SecretBase))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).secretBaseId) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SecretBase),
            "::",
            stringify!(secretBaseId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trainerName) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(SecretBase),
            "::",
            stringify!(trainerName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trainerId) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(SecretBase),
            "::",
            stringify!(trainerId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).language) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(SecretBase),
            "::",
            stringify!(language)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numSecretBasesReceived) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(SecretBase),
            "::",
            stringify!(numSecretBasesReceived)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numTimesEntered) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SecretBase),
            "::",
            stringify!(numTimesEntered)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(SecretBase),
            "::",
            stringify!(unused)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decorations) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(SecretBase),
            "::",
            stringify!(decorations)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decorationPositions) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(SecretBase),
            "::",
            stringify!(decorationPositions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).party) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(SecretBase),
            "::",
            stringify!(party)
        )
    );
}
impl SecretBase {
    #[inline]
    pub fn toRegister(&self) -> bool8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_toRegister(&mut self, val: bool8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn gender(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_gender(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn battledOwnerToday(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_battledOwnerToday(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn registryStatus(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_registryStatus(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        toRegister: bool8,
        gender: u8_,
        battledOwnerToday: u8_,
        registryStatus: u8_,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let toRegister: u8 = unsafe { ::std::mem::transmute(toRegister) };
            toRegister as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let gender: u8 = unsafe { ::std::mem::transmute(gender) };
            gender as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let battledOwnerToday: u8 = unsafe { ::std::mem::transmute(battledOwnerToday) };
            battledOwnerToday as u64
        });
        __bindgen_bitfield_unit.set(6usize, 2u8, {
            let registryStatus: u8 = unsafe { ::std::mem::transmute(registryStatus) };
            registryStatus as u64
        });
        __bindgen_bitfield_unit
    }
}
pub const METATILE_LAYER_TYPE_NORMAL: _bindgen_ty_3 = 0;
pub const METATILE_LAYER_TYPE_COVERED: _bindgen_ty_3 = 1;
pub const METATILE_LAYER_TYPE_SPLIT: _bindgen_ty_3 = 2;
pub type _bindgen_ty_3 = ::std::os::raw::c_int;
pub type TilesetCB = ::std::option::Option<unsafe extern "C" fn()>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tileset {
    pub isCompressed: bool8,
    pub isSecondary: bool8,
    pub tiles: *const u32_,
    pub palettes: *const [::std::os::raw::c_ushort; 16usize],
    pub metatiles: *const u16_,
    pub metatileAttributes: *const u16_,
    pub callback: TilesetCB,
}
#[test]
fn bindgen_test_layout_Tileset() {
    const UNINIT: ::std::mem::MaybeUninit<Tileset> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Tileset>(),
        48usize,
        concat!("Size of: ", stringify!(Tileset))
    );
    assert_eq!(
        ::std::mem::align_of::<Tileset>(),
        8usize,
        concat!("Alignment of ", stringify!(Tileset))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isCompressed) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tileset),
            "::",
            stringify!(isCompressed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isSecondary) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(Tileset),
            "::",
            stringify!(isSecondary)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tiles) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tileset),
            "::",
            stringify!(tiles)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).palettes) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tileset),
            "::",
            stringify!(palettes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).metatiles) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Tileset),
            "::",
            stringify!(metatiles)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).metatileAttributes) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Tileset),
            "::",
            stringify!(metatileAttributes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).callback) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Tileset),
            "::",
            stringify!(callback)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MapLayout {
    pub width: s32,
    pub height: s32,
    pub border: *const u16_,
    pub map: *const u16_,
    pub primaryTileset: *const Tileset,
    pub secondaryTileset: *const Tileset,
}
#[test]
fn bindgen_test_layout_MapLayout() {
    const UNINIT: ::std::mem::MaybeUninit<MapLayout> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<MapLayout>(),
        40usize,
        concat!("Size of: ", stringify!(MapLayout))
    );
    assert_eq!(
        ::std::mem::align_of::<MapLayout>(),
        8usize,
        concat!("Alignment of ", stringify!(MapLayout))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MapLayout),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MapLayout),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).border) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MapLayout),
            "::",
            stringify!(border)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).map) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MapLayout),
            "::",
            stringify!(map)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).primaryTileset) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MapLayout),
            "::",
            stringify!(primaryTileset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).secondaryTileset) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(MapLayout),
            "::",
            stringify!(secondaryTileset)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BackupMapLayout {
    pub width: s32,
    pub height: s32,
    pub map: *mut u16_,
}
#[test]
fn bindgen_test_layout_BackupMapLayout() {
    const UNINIT: ::std::mem::MaybeUninit<BackupMapLayout> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BackupMapLayout>(),
        16usize,
        concat!("Size of: ", stringify!(BackupMapLayout))
    );
    assert_eq!(
        ::std::mem::align_of::<BackupMapLayout>(),
        8usize,
        concat!("Alignment of ", stringify!(BackupMapLayout))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BackupMapLayout),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BackupMapLayout),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).map) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BackupMapLayout),
            "::",
            stringify!(map)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ObjectEventTemplate {
    pub localId: u8_,
    pub graphicsId: u8_,
    pub kind: u8_,
    pub x: s16,
    pub y: s16,
    pub elevation: u8_,
    pub movementType: u8_,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub trainerType: u16_,
    pub trainerRange_berryTreeId: u16_,
    pub script: *const u8_,
    pub flagId: u16_,
}
#[test]
fn bindgen_test_layout_ObjectEventTemplate() {
    const UNINIT: ::std::mem::MaybeUninit<ObjectEventTemplate> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ObjectEventTemplate>(),
        32usize,
        concat!("Size of: ", stringify!(ObjectEventTemplate))
    );
    assert_eq!(
        ::std::mem::align_of::<ObjectEventTemplate>(),
        8usize,
        concat!("Alignment of ", stringify!(ObjectEventTemplate))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).localId) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEventTemplate),
            "::",
            stringify!(localId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).graphicsId) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEventTemplate),
            "::",
            stringify!(graphicsId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).kind) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEventTemplate),
            "::",
            stringify!(kind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEventTemplate),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEventTemplate),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).elevation) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEventTemplate),
            "::",
            stringify!(elevation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).movementType) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEventTemplate),
            "::",
            stringify!(movementType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trainerType) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEventTemplate),
            "::",
            stringify!(trainerType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trainerRange_berryTreeId) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEventTemplate),
            "::",
            stringify!(trainerRange_berryTreeId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).script) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEventTemplate),
            "::",
            stringify!(script)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flagId) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEventTemplate),
            "::",
            stringify!(flagId)
        )
    );
}
impl ObjectEventTemplate {
    #[inline]
    pub fn movementRangeX(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u16) }
    }
    #[inline]
    pub fn set_movementRangeX(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn movementRangeY(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u16) }
    }
    #[inline]
    pub fn set_movementRangeY(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        movementRangeX: u16_,
        movementRangeY: u16_,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let movementRangeX: u16 = unsafe { ::std::mem::transmute(movementRangeX) };
            movementRangeX as u64
        });
        __bindgen_bitfield_unit.set(4usize, 4u8, {
            let movementRangeY: u16 = unsafe { ::std::mem::transmute(movementRangeY) };
            movementRangeY as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WarpEvent {
    pub x: s16,
    pub y: s16,
    pub elevation: u8_,
    pub warpId: u8_,
    pub mapNum: u8_,
    pub mapGroup: u8_,
}
#[test]
fn bindgen_test_layout_WarpEvent() {
    const UNINIT: ::std::mem::MaybeUninit<WarpEvent> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<WarpEvent>(),
        8usize,
        concat!("Size of: ", stringify!(WarpEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<WarpEvent>(),
        2usize,
        concat!("Alignment of ", stringify!(WarpEvent))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WarpEvent),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(WarpEvent),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).elevation) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(WarpEvent),
            "::",
            stringify!(elevation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).warpId) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(WarpEvent),
            "::",
            stringify!(warpId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mapNum) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(WarpEvent),
            "::",
            stringify!(mapNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mapGroup) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(WarpEvent),
            "::",
            stringify!(mapGroup)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CoordEvent {
    pub x: s16,
    pub y: s16,
    pub elevation: u8_,
    pub trigger: u16_,
    pub index: u16_,
    pub script: *const u8_,
}
#[test]
fn bindgen_test_layout_CoordEvent() {
    const UNINIT: ::std::mem::MaybeUninit<CoordEvent> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CoordEvent>(),
        24usize,
        concat!("Size of: ", stringify!(CoordEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<CoordEvent>(),
        8usize,
        concat!("Alignment of ", stringify!(CoordEvent))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CoordEvent),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(CoordEvent),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).elevation) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CoordEvent),
            "::",
            stringify!(elevation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trigger) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(CoordEvent),
            "::",
            stringify!(trigger)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).index) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CoordEvent),
            "::",
            stringify!(index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).script) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CoordEvent),
            "::",
            stringify!(script)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct BgEvent {
    pub x: u16_,
    pub y: u16_,
    pub elevation: u8_,
    pub kind: u8_,
    pub bgUnion: BgEvent__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union BgEvent__bindgen_ty_1 {
    pub script: *const u8_,
    pub hiddenItem: BgEvent__bindgen_ty_1__bindgen_ty_1,
    pub secretBaseId: u32_,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BgEvent__bindgen_ty_1__bindgen_ty_1 {
    pub item: u16_,
    pub hiddenItemId: u16_,
}
#[test]
fn bindgen_test_layout_BgEvent__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<BgEvent__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BgEvent__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(BgEvent__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<BgEvent__bindgen_ty_1__bindgen_ty_1>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(BgEvent__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).item) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BgEvent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(item)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hiddenItemId) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(BgEvent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(hiddenItemId)
        )
    );
}
#[test]
fn bindgen_test_layout_BgEvent__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<BgEvent__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BgEvent__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(BgEvent__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<BgEvent__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(BgEvent__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).script) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BgEvent__bindgen_ty_1),
            "::",
            stringify!(script)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hiddenItem) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BgEvent__bindgen_ty_1),
            "::",
            stringify!(hiddenItem)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).secretBaseId) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BgEvent__bindgen_ty_1),
            "::",
            stringify!(secretBaseId)
        )
    );
}
#[test]
fn bindgen_test_layout_BgEvent() {
    const UNINIT: ::std::mem::MaybeUninit<BgEvent> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BgEvent>(),
        16usize,
        concat!("Size of: ", stringify!(BgEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<BgEvent>(),
        8usize,
        concat!("Alignment of ", stringify!(BgEvent))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BgEvent),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(BgEvent),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).elevation) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BgEvent),
            "::",
            stringify!(elevation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).kind) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(BgEvent),
            "::",
            stringify!(kind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bgUnion) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BgEvent),
            "::",
            stringify!(bgUnion)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MapEvents {
    pub objectEventCount: u8_,
    pub warpCount: u8_,
    pub coordEventCount: u8_,
    pub bgEventCount: u8_,
    pub objectEvents: *const ObjectEventTemplate,
    pub warps: *const WarpEvent,
    pub coordEvents: *const CoordEvent,
    pub bgEvents: *const BgEvent,
}
#[test]
fn bindgen_test_layout_MapEvents() {
    const UNINIT: ::std::mem::MaybeUninit<MapEvents> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<MapEvents>(),
        40usize,
        concat!("Size of: ", stringify!(MapEvents))
    );
    assert_eq!(
        ::std::mem::align_of::<MapEvents>(),
        8usize,
        concat!("Alignment of ", stringify!(MapEvents))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).objectEventCount) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MapEvents),
            "::",
            stringify!(objectEventCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).warpCount) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(MapEvents),
            "::",
            stringify!(warpCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coordEventCount) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(MapEvents),
            "::",
            stringify!(coordEventCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bgEventCount) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(MapEvents),
            "::",
            stringify!(bgEventCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).objectEvents) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MapEvents),
            "::",
            stringify!(objectEvents)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).warps) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MapEvents),
            "::",
            stringify!(warps)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coordEvents) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MapEvents),
            "::",
            stringify!(coordEvents)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bgEvents) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(MapEvents),
            "::",
            stringify!(bgEvents)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MapConnection {
    pub direction: u8_,
    pub offset: u32_,
    pub mapGroup: u8_,
    pub mapNum: u8_,
}
#[test]
fn bindgen_test_layout_MapConnection() {
    const UNINIT: ::std::mem::MaybeUninit<MapConnection> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<MapConnection>(),
        12usize,
        concat!("Size of: ", stringify!(MapConnection))
    );
    assert_eq!(
        ::std::mem::align_of::<MapConnection>(),
        4usize,
        concat!("Alignment of ", stringify!(MapConnection))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).direction) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MapConnection),
            "::",
            stringify!(direction)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MapConnection),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mapGroup) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MapConnection),
            "::",
            stringify!(mapGroup)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mapNum) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(MapConnection),
            "::",
            stringify!(mapNum)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MapConnections {
    pub count: s32,
    pub connections: *const MapConnection,
}
#[test]
fn bindgen_test_layout_MapConnections() {
    const UNINIT: ::std::mem::MaybeUninit<MapConnections> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<MapConnections>(),
        16usize,
        concat!("Size of: ", stringify!(MapConnections))
    );
    assert_eq!(
        ::std::mem::align_of::<MapConnections>(),
        8usize,
        concat!("Alignment of ", stringify!(MapConnections))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MapConnections),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).connections) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MapConnections),
            "::",
            stringify!(connections)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MapHeader {
    pub mapLayout: *const MapLayout,
    pub events: *const MapEvents,
    pub mapScripts: *const u8_,
    pub connections: *const MapConnections,
    pub music: u16_,
    pub mapLayoutId: u16_,
    pub regionMapSectionId: u8_,
    pub cave: u8_,
    pub weather: u8_,
    pub mapType: u8_,
    pub filler_18: [u8_; 2usize],
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub battleType: u8_,
}
#[test]
fn bindgen_test_layout_MapHeader() {
    const UNINIT: ::std::mem::MaybeUninit<MapHeader> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<MapHeader>(),
        48usize,
        concat!("Size of: ", stringify!(MapHeader))
    );
    assert_eq!(
        ::std::mem::align_of::<MapHeader>(),
        8usize,
        concat!("Alignment of ", stringify!(MapHeader))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mapLayout) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MapHeader),
            "::",
            stringify!(mapLayout)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).events) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MapHeader),
            "::",
            stringify!(events)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mapScripts) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MapHeader),
            "::",
            stringify!(mapScripts)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).connections) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MapHeader),
            "::",
            stringify!(connections)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).music) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(MapHeader),
            "::",
            stringify!(music)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mapLayoutId) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(MapHeader),
            "::",
            stringify!(mapLayoutId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).regionMapSectionId) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(MapHeader),
            "::",
            stringify!(regionMapSectionId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cave) as usize - ptr as usize },
        37usize,
        concat!(
            "Offset of field: ",
            stringify!(MapHeader),
            "::",
            stringify!(cave)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).weather) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(MapHeader),
            "::",
            stringify!(weather)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mapType) as usize - ptr as usize },
        39usize,
        concat!(
            "Offset of field: ",
            stringify!(MapHeader),
            "::",
            stringify!(mapType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).filler_18) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(MapHeader),
            "::",
            stringify!(filler_18)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).battleType) as usize - ptr as usize },
        43usize,
        concat!(
            "Offset of field: ",
            stringify!(MapHeader),
            "::",
            stringify!(battleType)
        )
    );
}
impl MapHeader {
    #[inline]
    pub fn allowCycling(&self) -> bool8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_allowCycling(&mut self, val: bool8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn allowEscaping(&self) -> bool8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_allowEscaping(&mut self, val: bool8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn allowRunning(&self) -> bool8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_allowRunning(&mut self, val: bool8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn showMapName(&self) -> bool8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_showMapName(&mut self, val: bool8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        allowCycling: bool8,
        allowEscaping: bool8,
        allowRunning: bool8,
        showMapName: bool8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let allowCycling: u8 = unsafe { ::std::mem::transmute(allowCycling) };
            allowCycling as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let allowEscaping: u8 = unsafe { ::std::mem::transmute(allowEscaping) };
            allowEscaping as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let allowRunning: u8 = unsafe { ::std::mem::transmute(allowRunning) };
            allowRunning as u64
        });
        __bindgen_bitfield_unit.set(3usize, 5u8, {
            let showMapName: u8 = unsafe { ::std::mem::transmute(showMapName) };
            showMapName as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct ObjectEvent {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub spriteId: u8_,
    pub graphicsId: u8_,
    pub movementType: u8_,
    pub trainerType: u8_,
    pub localId: u8_,
    pub mapNum: u8_,
    pub mapGroup: u8_,
    pub _bitfield_align_2: [u8; 0],
    pub _bitfield_2: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub initialCoords: Coords16,
    pub currentCoords: Coords16,
    pub previousCoords: Coords16,
    pub _bitfield_align_3: [u8; 0],
    pub _bitfield_3: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub fieldEffectSpriteId: u8_,
    pub warpArrowSpriteId: u8_,
    pub movementActionId: u8_,
    pub trainerRange_berryTreeId: u8_,
    pub currentMetatileBehavior: u8_,
    pub previousMetatileBehavior: u8_,
    pub previousMovementDirection: u8_,
    pub directionSequenceIndex: u8_,
    pub playerCopyableMovement: u8_,
}
#[test]
fn bindgen_test_layout_ObjectEvent() {
    const UNINIT: ::std::mem::MaybeUninit<ObjectEvent> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ObjectEvent>(),
        36usize,
        concat!("Size of: ", stringify!(ObjectEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<ObjectEvent>(),
        4usize,
        concat!("Alignment of ", stringify!(ObjectEvent))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).spriteId) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEvent),
            "::",
            stringify!(spriteId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).graphicsId) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEvent),
            "::",
            stringify!(graphicsId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).movementType) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEvent),
            "::",
            stringify!(movementType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trainerType) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEvent),
            "::",
            stringify!(trainerType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).localId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEvent),
            "::",
            stringify!(localId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mapNum) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEvent),
            "::",
            stringify!(mapNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mapGroup) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEvent),
            "::",
            stringify!(mapGroup)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).initialCoords) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEvent),
            "::",
            stringify!(initialCoords)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).currentCoords) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEvent),
            "::",
            stringify!(currentCoords)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).previousCoords) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEvent),
            "::",
            stringify!(previousCoords)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fieldEffectSpriteId) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEvent),
            "::",
            stringify!(fieldEffectSpriteId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).warpArrowSpriteId) as usize - ptr as usize },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEvent),
            "::",
            stringify!(warpArrowSpriteId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).movementActionId) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEvent),
            "::",
            stringify!(movementActionId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trainerRange_berryTreeId) as usize - ptr as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEvent),
            "::",
            stringify!(trainerRange_berryTreeId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).currentMetatileBehavior) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEvent),
            "::",
            stringify!(currentMetatileBehavior)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).previousMetatileBehavior) as usize - ptr as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEvent),
            "::",
            stringify!(previousMetatileBehavior)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).previousMovementDirection) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEvent),
            "::",
            stringify!(previousMovementDirection)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).directionSequenceIndex) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEvent),
            "::",
            stringify!(directionSequenceIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).playerCopyableMovement) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(ObjectEvent),
            "::",
            stringify!(playerCopyableMovement)
        )
    );
}
impl ObjectEvent {
    #[inline]
    pub fn active(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_active(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn singleMovementActive(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_singleMovementActive(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn triggerGroundEffectsOnMove(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_triggerGroundEffectsOnMove(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn triggerGroundEffectsOnStop(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_triggerGroundEffectsOnStop(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn disableCoveringGroundEffects(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_disableCoveringGroundEffects(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn landingJump(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_landingJump(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn heldMovementActive(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_heldMovementActive(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn heldMovementFinished(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
